[
  {
    "id": 1,
    "title": "Forgiveness, Anger and Trials",
    "categories": "Angry",
    "arabic": "اَللّٰهُمَّ رَبَّ مُحَمَّدٍ اغْفِرْ لِيْ ذَنْبِيْ ، وَأَذْهِبْ غَيْظَ قَلْبِيْ ، وَأَعِذْنِيْ مِنْ مُضِلَّاتِ الْفِتَنِ.",
    "translation": "O Allah, Lord of Muḥammad forgive my sins, remove the anger of my heart and protect me from misleading trials.",
    "transliteration": "Allāhumma Rabba Muḥammad, ighfir lī dhambī, wa adh-hib ghayẓa qalbī, wa aʿidhnī min muḍillāti-l-fitan.",
    "reference": "Muhammad b. Abī Bakr (raḥimahullāh) narrates that when ʿĀ'isha (raḍiy Allāhu ‘anhā) would become angry, the Messenger of Allah ﷺ would stroke her nose and then say (to her): “O ʿUwaysh! Say: [the above].” (Ibn al-Sunnī 456)",
    "virtue": ""
  },
  {
    "id": 2,
    "title": "Istiʿadhah #1",
    "categories": "Angry",
    "arabic": "أَعُوْذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيْمِ.",
    "translation": "I seek protection in Allah from the rejected Shayṭān.",
    "transliteration": "Aʿūdhu bi-llāhi mina-sh-Shayṭāni-r-rajīm.",
    "reference": "",
    "virtue": ""
  },
  {
    "id": 3,
    "title": "Duʿa for Seeking Protection from Shaytan",
    "categories": "Angry",
    "arabic": "رَبِّ أَعُوْذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِيْنِ ، وَأَعُوذُ بِكَ رَبِّ أَنْ يَّحْضُرُوْنِ",
    "translation": "My Lord, I seek protection with You from the promptings of the devils; and I seek protection in You, my Lord, from their coming near me. (23:97-98)",
    "transliteration": "Rabbi aʿūdhu bika min hamazāti-sh-shayāṭīn. Wa aʿūdhu bika Rabbi ay-yaḥḍurūn.",
    "reference": "",
    "virtue": ""
  },
  {
    "id": 4,
    "title": "The Ultimate Duʿa",
    "categories": "Angry",
    "arabic": "اَللّٰهُمَّ بِعِلْمِكَ الْغَيْبَ ، وَقُدْرَتِكَ عَلَى الْخَلْقِ ، أَحْيِنِيْ مَا عَلِمْتَ الْحَيَاةَ خَيْرًا لِّيْ ، وَتَوَفَّنِيْ إِذَا عَلِمْتَ الْوَفَاةَ خَيْرًا لِّيْ ، اَللّٰهُمَّ وَأَسْأَلُكَ خَشْيَتَكَ فِي الْغَيْبِ وَالشَّهَادَةِ ، وَأَسْأَلُكَ كَلِمَةَ الْحَقِّ فِي الرِّضَا وَالْغَضَبِ ، وَأَسْأَلُكَ الْقَصْدَ فِي الْفَقْرِ وَالْغِنَىٰ ، وَأَسْأَلُكَ نَعِيْمًا لَّا يَنْفَدُ ، وَأَسْأَلُكَ قُرَّةَ عَيْنٍ لَّا تَنْقَطِعُ ، وَأَسْأَلُكَ الرِّضَا بَعْدَ الْقَضَاءِ ، وَأَسْأَلُكَ بَرْدَ الْعَيْشِ بَعْدَ الْمَوْتِ ، وَأَسْأَلُكَ لَذَّةَ النَّظَرِ إِلَىٰ وَجْهِكَ ، وَالشَّوْقَ إِلَىٰ لِقَائِكَ ، فِيْ غَيْرِ ضَرَّاءَ مُضِرَّةٍ ، وَلَا فِتْنَةٍ مُّضِلَّةٍ ، اَللّٰهُمَّ زَيِّنَّا بِزِيْنَةِ الْإِيْمَانِ ، وَاجْعَلْنَا هُدَاةً مُّهْتَدِيْنَ",
    "translation": "O Allah, with Your knowledge of the unseen and Your absolute power over the creation, let me live in this world as long as You know my living is good for me; and give me death when You know death is better for me. O Allah, I ask You for Your fear in private and in public, and for the word of truth in times of joy and anger. I ask You for moderation in poverty and in wealth. I ask You for endless blessings and perpetual delights. I ask You to make me pleased with destiny; for a cool and comfortable life after death; for the pleasure of seeing Your Face; and for the longing to meet You, without any painful ordeals and tribulations that misguide. O Allah, adorn us with the beauty of faith, and make us those who guide others and are guided themselves.",
    "transliteration": "Allāhumma bi-ʿilmika-l-ghayb, wa qudratika ʿala-l-khalq, aḥyinī mā kānati-l-ḥayātu khayra-l-lī, wa tawaffanī idhā kānati-l-wafātu khayra-l-lī, Allāhumma innī as’aluka khashyataka fi-l-ghaybi wa-sh-shahādah, wa as’aluka kalimata-l-ḥaqqi fi-r-riḍā wa-l-ghaḍab, wa as’aluka-l-qaṣda fi-l-faqr wa-l-ghinā, wa as’aluka naʿīma-l-lā yanfad, wa as’aluka qurrata ʿayni-l-lā tanqaṭiʿ, wa as’aluka-r-riḍā baʿda-l-qaḍā, wa as’aluka barda-l-ʿayshi baʿda-l-mawt, wa as’aluka ladh-dhata-n-naẓari ilā wajhik, wa-sh-shawqa ilā liqā’ik, fī ghayri ḍarrā’a muḍirrah, wa lā fitnati-m-muḍillah, Allāhumma zayyinnā bi-zīnati-l-īmān, wa-jʿalnā hudāta-m-muhtadīn.",
    "reference": "ʿAtā b. As-Sā’ib narrated that his father said: “ʿAmmār b. Yāsir (raḍiy Allāhu ‘anhu) led us in prayer and he made it brief. Some of the people said to him: ‘You made the prayer short (or brief).’ He said: ‘Nevertheless I still recited supplications that I heard from the Messenger of Allah ﷺ.’ When he got up and left, a man- he was my father but he did not name himself- followed him and asked him about that supplication, then he came and told the people [the above].” (Nasā’ī 1305)",
    "virtue": ""
  },
  {
    "id": 5,
    "title": "Hawqalah: A Treasure From the Treasures of Paradise",
    "categories": "Anxious",
    "arabic": "لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللّٰهِ",
    "translation": "There is no power (in averting evil) or strength (in attaining good) except through Allah",
    "transliteration": "Lā ḥawla wa lā quwwata illā bi-llāh",
    "reference": "",
    "virtue": "The Messenger of Allah ﷺ said: “Shall I not teach you a statement which lies beneath the Throne and is from the treasures of Paradise? Say لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِالله upon which Allah says: ‘My slave has submitted and surrendered himself.’” (Hākim)\n\nHe ﷺ also said: “It is a gate from the gates of Paradise.” (Tirmidhī)"
  },
  {
    "id": 6,
    "title": "When One is in a Difficult Situation",
    "categories": "Anxious",
    "arabic": "اَللّٰهُمَّ لَا سَهْلَ إِلَّا مَا جَعَلْتَهُ سَهْلًا ، وَأَنْتَ تَجْعَلُ الْحَزْنَ إِذَا شِئْتَ سَهْلًا",
    "translation": "O Allah, there is no ease except in that which You have made easy, and You make the difficulty easy when You wish.",
    "transliteration": "Allāhumma lā sahla illā mā jaʿaltahū sahlā, wa anta tajʿalu-l-ḥazna idhā shi’ta sahlā.",
    "reference": "Anas b. Malik (raḍiy Allāhu ‘anhu) ﷺ narrates that the Messenger of Allah said [the above]. (Ibn Hibbān 2427, Ibn al-Sunnī 351)",
    "virtue": ""
  },
  {
    "id": 7,
    "title": "Grief & Anxiety #1",
    "categories": "Anxious",
    "arabic": "اَللّٰهُمَّ إِنِّيْ عَبْدُكَ ، وَابْنُ عَبْدِكَ ، وَابْنُ أَمَتِكَ ، نَاصِيَتِيْ بِيَدِكَ ، مَاضٍ فِيَّ حُكْمُكَ ، عَدْلٌ فِيَّ قَضَاؤُكَ ، أَسْأَلُكَ بِكُلِّ اسْمٍ هُوَ لَكَ ، سَمَّيْتَ بِهِ نَفْسَكَ ، أَوْ عَلَّمْتَهُ أَحَدًا مِنْ خَلْقِكَ ، أَوْ أَنْزَلْتَهُ فِيْ كِتَابِكَ ، أَوِ اسْتَأْثَرْتَ بِهِ فِيْ عِلْمِ الْغَيْبِ عِنْدَكَ ، أَنْ تَجْعَلَ الْقُرْآنَ رَبِيْعَ قَلْبِيْ ، وَنُوْرَ صَدْرِيْ وَجَلَاءَ حُزْنِيْ ، وَذَهَابَ هَمِّيْ",
    "translation": "O Allah, I am Your slave and the son of Your male slave and the son of Your female slave. My forehead is in Your Hand (i.e. you have control over me). I am subject to Your judgement and Your decree concerning me is just. I ask You – by every name that is Yours, by which You have named Yourself, or taught any one of Your creation, or revealed in Your Book, or kept unto Yourself in the knowledge of the unseen that is with You – to make the Qur’ān the spring of my heart, the light of my chest, the banisher of my grief and the reliever of my anxiety.",
    "transliteration": "Allāhumma innī ʿabduk, wa-bnu ʿabdik, wa-bnu amatik, nāṣiyatī bi-yadik, māḍin fiyya ḥukmuk, ʿadlun fiyya qaḍā’uk, as’aluka bi-kulli-smin huwa lak, sammayta bihi nafsak, aw ʿallamtahū aḥadam-min khalqik, aw anzaltahū fī Kitābik, awi-sta’tharta bihī fī ʿilmi-l-ghaybi ʿindak, an tajʿala-l-Qur’āna rabīʿa qalbī, wa nūra ṣadrī wa jalā’a ḥuznī, wa dhahāba hammī.",
    "reference": "",
    "virtue": "The Messenger of Allah ﷺ said: “There is no one amongst you who, when he is stricken with grief and anxiety, says [the above] except that Allah will remove his grief and anxiety, and will give him joy instead.” The companions said, ‘O Messenger of Allah, should we not learn these words?’ He ﷺ replied, ‘Of course! One who hears it should learn it.’” (Ahmad 3712)"
  },
  {
    "id": 8,
    "title": "Grief & Anxiety #2",
    "categories": "Anxious",
    "arabic": "لَا إِلٰهَ إِلَّا اللّٰهُ الْعَظِيْمُ الْحَلِيْمُ ، لَا إِلٰهَ إِلَّا اللّٰهُ رَبُّ الْعَرْشِ الْعَظِيْمِ ، لَا إِلٰهَ إِلَّا اللّٰهُ رَبُّ السَّمٰـوٰتِ وَرَبُّ الْأَرْضِ وَرَبُّ الْعَرْشِ الْكَرِيْمِ",
    "translation": "There is no god but Allah, the Supreme, The Forbearing. There is no god but Allah, Lord of the Magnificent Throne. There is no god but Allah, Lord of the heavens, Lord of the earth, Lord of the Noble Throne.",
    "transliteration": "Lā ilāha illā-llāhu-l-ʿĀẓīmu-l-Ḥalīm, lā ilāha illā-llāhu Rabbu-l-ʿĀrshi-l-ʿAẓīm, lā ilāha illā-llāhu Rabbu-s-samāwāti wa Rabbu-l-arḍi wa Rabbu-l-ʿĀrshi-l-karīm.",
    "reference": "The Messenger of Allah ﷺ would invoke Allah at the time of distress with [the above]. (Bukhārī 6345, Muslim 2730)",
    "virtue": ""
  },
  {
    "id": 9,
    "title": "When One Feels Frightened",
    "categories": "Anxious",
    "arabic": "لَا إِلٰهَ إِلَّا اللّٰهُ",
    "translation": "There is no god but Allah.",
    "transliteration": "Lā ilāha illā-llāh.",
    "reference": "Zaynab bint Jaḥsh (raḍiy Allāhu ʿanhā) said that the Messenger of Allah ﷺ once came to her in a state of fear and said, [the above] Woe unto the Arabs from a danger that has come near. An opening has been made in the wall of Yājūj and Mājūj like this, making a circle with his thumb and index finger. Zaynab bint Jaḥsh said, “O Messenger of Allah ﷺ! Shall we be destroyed even though there are pious persons among us?” He said, “Yes, when evil (people) will increase.” (Bukhārī 3346)",
    "virtue": ""
  },
  {
    "id": 10,
    "title": "When One is Distressed",
    "categories": "Anxious",
    "arabic": "اَللّٰهُمَّ رَحْمَتَكَ أَرْجُوْ فَلَا تَكِلْنِيْ إِلٰى نَفْسِيْ طَرْفَةَ عَيْنٍ ، وَأَصْلِحْ لِي شَأْنِيْ كُلَّهُ لَا إِلٰهَ إِلَّا أَنْتَ",
    "translation": "O Allah! Your Mercy is what I hope for so do not entrust me to myself for the blink of an eye, rectify all of my affairs. There is no god worthy of worship but You.",
    "transliteration": "Allāhumma raḥmataka arjū fa-lā takilnī ilā nafsī ṭarfata ʿayn, wa aṣliḥ lī sha’nī kullah lā ilāha illā Ant.",
    "reference": "The Messenger of Allah ﷺ said: “The supplications for the one who is distressed are [the above].” (Abu Dāwud 5090)",
    "virtue": ""
  },
  {
    "id": 11,
    "title": "When One is Afraid of People #2",
    "categories": "Anxious",
    "arabic": "حَسْبُنَا اللّٰهُ وَنِعْمَ الْوَكِيْلُ",
    "translation": "Allah is enough for us and He is the Best Protector.",
    "transliteration": "Ḥasbunallāhu wa niʿmal Wakīl.",
    "reference": "Ibn ʿAbbās (radiy Allāhū ‘anhumā) narrated: \"[the above] was said by Ibrāhīm (‘alayhis-salām) when he was thrown into the fire; and it was said by Muhammad ﷺ when they (i.e. the hypocrites) said, “A great army is gathering against you, therefore, fear them,” but it only increased their faith and they said: “Allah is Sufficient for us, and He is the Best Disposer (of affairs, for us).” (3.173) (Bukhārī 4563)",
    "virtue": ""
  },
  {
    "id": 12,
    "title": "Duʿa for Seeking Protection from Shaytan",
    "categories": "Anxious",
    "arabic": "رَبِّ أَعُوْذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِيْنِ ، وَأَعُوذُ بِكَ رَبِّ أَنْ يَّحْضُرُوْنِ",
    "translation": "My Lord, I seek protection with You from the promptings of the devils; and I seek protection in You, my Lord, from their coming near me. (23:97-98)",
    "transliteration": "Rabbi aʿūdhu bika min hamazāti-sh-shayāṭīn. Wa aʿūdhu bika Rabbi ay-yaḥḍurūn.",
    "reference": "",
    "virtue": ""
  },
  {
    "id": 13,
    "title": "Allah Will Suffice You in Everything",
    "categories": "Anxious",
    "arabic": "حَسْبِيَ اللّٰهُ لَا إِلٰهَ إِلَّا هُوَ ، عَلَيْهِ تَوَكَّلْتُ ، وَهُوَ رَبُّ الْعَرْشِ الْعَظِيْمِ.",
    "translation": "Allah is sufficient for me. There is no god worthy of worship except Him. I have placed my trust in Him only and He is the Lord of the Magnificent Throne.",
    "transliteration": "Ḥasbiya-Allāhu lā ilāha illā Huwa, ʿalayhi tawakkaltu, wa Huwa Rabbu-l-ʿArshi-l-ʿaẓīm.",
    "reference": "",
    "virtue": "Abū al-Dardā’ (raḍiy Allāhu ʿanhu) narrates from the Messenger of Allah ﷺ that he said: “Whoever recites [the above] seven times in the morning and in the evening, Allah will suffice him in everything that concerns him in matters of this world and the next.” (Ibn al-Sunnī 71)"
  },
  {
    "id": 14,
    "title": "Duʿa of Prophet Musa ﷺ Expressing His Dire Need",
    "categories": "Anxious",
    "arabic": "رَبِّ إِنِّيْ لِمَآ أَنْزَلْتَ إِلَيَّ مِنْ خَيْرٍ فَقِيْرٌ",
    "translation": "My Lord, truly I am in dire need of any good which You may send me. (28:24)",
    "transliteration": "Rabbi innī limā anzalta illayya min khayrin faqīr.",
    "reference": "",
    "virtue": ""
  },
  {
    "id": 15,
    "title": "Duʿa of Prophet Ayyub ﷺ for Times of Distress",
    "categories": "Anxious",
    "arabic": "-رَبِّ- أَنِّيْ مَسَّنِيَ الضُّرُّ وَأَنْتَ أَرْحَمُ الرّٰحِمِيْنَ",
    "translation": "(My Lord), indeed adversity has touched me, and you are the Most Merciful of the merciful. (21:83)",
    "transliteration": "(Rabbi) Annī massaniya-ḍ-ḍurru wa Anta Arḥamu-r-raḥimīn.",
    "reference": "",
    "virtue": ""
  },
  {
    "id": 16,
    "title": "Protect Yourself From Anxiety, Laziness, Debt etc",
    "categories": "Anxious",
    "arabic": "اَللّٰهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ ، وَأَعُوْذُ بِكَ مِنَ الْعَجْزِ وَالْكَسَلِ، وَأَعُوْذُ بِكَ مِنَ الْجُبْنِ وَالْبُخْلِ ، وَأَعُوْذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ وَقَهْرِ الرِّجَالِ.",
    "translation": "O Allah, I seek Your protection from anxiety and grief. I seek Your protection from inability and laziness. I seek Your protection from cowardice and miserliness, and I seek Your protection from being overcome by debt and being overpowered by men.",
    "transliteration": "Allāhumma innī aʿūdhu bika min-l-hammi wa-l-ḥazan, wa aʿūdhu bika min-l-ʿajzi wa-l-kasal, wa aʿūdhu bika min-l-jubni wa-l-bukhl, wa aʿūdhu bika min ghalabati-d-dayni wa qahri-r-rijāl.",
    "reference": "",
    "virtue": "Abū Saʿīd al-Khudrī (raḍiy Allāhu ʿanhu) narrated that one day, the Messenger of Allah ﷺ entered the masjid. He saw a man from the Anṣār called Abū Umāmah (raḍiy Allāhu ʿanhu). He ﷺ asked, “What is the matter? Why are you sitting in the mosque when it is not the time for prayer?” He replied, “Never-ending worries and debts, O Messenger of Allah.” The Messenger of Allah ﷺ then asked, “Shall I not teach you words by which, when you say them, Allah will remove your worries, and settle your debts?” He replied, “Yes of course, O Messenger of Allah.” He ﷺ said, “Say in the morning and evening [the above].” Abū Umāmah (raḍiy Allāhu ʿanhu) said, “Then I did that, and Allah removed my worries and settled my debts.” (Abū Dāwūd 1555)"
  },
  {
    "id": 17,
    "title": "Well-being in this World and the Hereafter",
    "categories": "Anxious",
    "arabic": "اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَ الْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ ، اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِيْ دِيْنِيْ وَدُنْيَايَ وَأَهْلِيْ وَمَالِيْ ، اَللّٰهُمَّ اسْتُرْ عَوْرَاتِيْ وَآمِنْ رَوْعَاتِيْ ، اَللّٰهُمَّ احْفَظْنِيْ مِنْ بَيْنِ يَدَيَّ ، وَمِنْ خَلْفِيْ ، وَعَنْ يَّمِيْنِيْ ، وَعَنْ شِمَالِيْ ، وَمِنْ فَوْقِيْ ، وَأَعُوْذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِيْ.",
    "translation": "O Allah, I ask You for well-being in this world and the next. O Allah, I ask You for forgiveness and well-being in my religion, in my worldly affairs, in my family and in my wealth. O Allah, conceal my faults and calm my fears. O Allah, guard me from in front of me and behind me, from my right, and from my left, and from above me. I seek protection in Your Greatness from being unexpectedly destroyed from beneath me.",
    "transliteration": "Allāhumma innī as’aluka-l-ʿāfiyata fi-d-dunyā wa-l-ākhirah. Allāhumma innī as’aluka-l-ʿafwa wa-l-ʿāfiyata fī dīnī wa dunyāya wa ahlī wa mālī, Allāhumma-stur ʿawrātī wa āmin rawʿātī. Allāhumma-ḥfaẓnī mim bayni yadayya wa min khalfī, wa ʿay-yamīnī wa ʿan shimālī wa min fawqī, wa aʿūdhu bi-ʿaẓamatika an ughtāla min taḥtī.",
    "reference": "",
    "virtue": "ʿAbdullāh b. ʿUmar (raḍiy Allāhu ʿanhumā) narrated: “The Messenger of Allah ﷺ never failed to say these words in the morning and in the evening.” (Abū Dāwūd 5074)"
  },
  {
    "id": 18,
    "title": "Duʿa of Prophet Musa ﷺ Expressing His Dire Need",
    "categories": "Bored",
    "arabic": "رَبِّ إِنِّيْ لِمَآ أَنْزَلْتَ إِلَيَّ مِنْ خَيْرٍ فَقِيْرٌ",
    "translation": "My Lord, truly I am in dire need of any good which You may send me. (28:24)",
    "transliteration": "Rabbi innī limā anzalta illayya min khayrin faqīr.",
    "reference": "",
    "virtue": ""
  },
  {
    "id": 19,
    "title": "Attainment of Every Good",
    "categories": "Bored",
    "arabic": "اَللّٰهُمَّ إنَّا نَسْأَلُكَ مُوْجِبَاتِ رَحْمَتِكَ ، وَعَزَائِمَ مَغْفِرَتِكَ ، وَالسَّلَامَةَ مِنْ كُلِّ إِثْمٍ ، وَالْغَنِِيْمَةَ مِنْ كُلِّ بِرٍّ ، وَالْفَوْزَ بِالْجَنَّةِ ، وَالنَّجَاةَ مِنَ النَّارِ.",
    "translation": "O Allah, we beg You for all that which will necessitate Your mercy and the determination to do all that which will necessitate Your forgiveness; for protection from every sin and accomplishment of every good; for attainment of Paradise and for freedom from Hell-fire.",
    "transliteration": "Allāhumma innā nas’aluka mūjibāti raḥmatik, wa ʿazā’ima maghfiratik, wa-s-salāmata min kulli ithm, wal-ghanīmata min kulli birr, wal-fawza bil-Jannah, wa-n-najāta mina-n-nār.",
    "reference": "Abdullah b. Mas’ūd (raḍiy Allāhu ‘anhu) says: “From the supplication of the Messenger of Allah ﷺ was: [the above]. (Hākim 1/525)",
    "virtue": ""
  },
  {
    "id": 20,
    "title": "Steadfastness on Obedience",
    "categories": "Bored",
    "arabic": "اَللّٰهُمَّ مُصَرِّفَ الْقُلُوْبِ صَرِّفْ قُلُوْبَنَا عَلَىٰ طَاعَتِكَ",
    "translation": "O Allah, Changer of hearts, direct our hearts to Your obedience.",
    "transliteration": "Allāhumma Muṣarrifa-l-qulūbi ṣarrif qulūbanā ʿalā ṭāʿatik.",
    "reference": "ʿAbdullāh b. ʿAmr (raḍiy Allāhu ‘anhuma) reported that the Messenger of Allah ﷺ said: “Verily, the hearts of the children of Adam, all of them, are between the two fingers of the Merciful as one heart. He directs them wherever He wills.” (Muslim 2654)",
    "virtue": ""
  },
  {
    "id": 21,
    "title": "Seeking Help For Excellence In Worship",
    "categories": "Bored",
    "arabic": "اَللّٰهُمَّ أَعِنِّيْ عَلَىٰ ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ",
    "translation": "O Allah, help me in remembering You, in being grateful to You, and in worshipping You in an excellent manner.",
    "transliteration": "Allāhumma aʿinnī ʿalā dhikrika wa shukrika wa ḥusni ʿibādatik.",
    "reference": "Mu’ādh b. Jabal (raḍiy Allāhu ‘anhu) reported that the Messenger of Allah ﷺ took me by the hand and he said, “O Mu’ādh, I swear by Allah that I love you. I swear by Allah that I love you. O Mu’ādh, I advise you not to forget supplicating after every prayer by saying: [the above]. (Abū Dāwūd 1522)",
    "virtue": ""
  },
  {
    "id": 22,
    "title": "Duʿa for Allah’s Love & Protection From Trials",
    "categories": "Bored",
    "arabic": "اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَ فِعْلَ الْخَيْرَاتِ ، وَتَرْكَ الْمُنْكَرَاتِ ، وَحُبَّ الْمَسَاكِيْنِ ، وَأَنْ تَغْفِرَ لِيْ وَتَرْحَمَنِيْ ، وَإِذَا أَرَدْتَ فِتْنَةَ قَوْمٍ فَتَوَفَّنِيْ غَيْرَ مَفْتُوْنٍ ، وَأَسْأَلُكَ حُبَّكَ ، وَحُبَّ مَنْ يُّحِبُّكَ ، وَحُبَّ عَمَلٍ يُّقَرِّبُنِيْ إِلَىٰ حُبِّكَ",
    "translation": "O Allah, I beg You to enable me to do good deeds, abstain from evil acts, and love the poor; and that You forgive me and have mercy upon me. When You intend to test a people, then grant me death without being tested. I ask You for Your love, the love of those whom You love, and the love of deeds which will bring me closer to Your love.",
    "transliteration": "Allāhumma innī as’aluka fiʿla-l-khayrāt, wa tarka-l-munkarāt, wa ḥubba-l-masākīn, wa an taghfira lī wa tarḥamanī, wa idhā arad-ta fitnata qawmin fa-tawaffanī ghayra maftūn, wa as’aluka ḥubbak, wa ḥubba ma-y-yuḥibbuk, wa ḥubba ʿamali-y-yuqarribunī ilā ḥubbik.",
    "reference": "Mu’ādh b. Jabl (raḍiy Allāhu ‘anhu) narrates: “One morning, the Messenger of Allah ﷺ was prevented from coming to us for the Fajr Salāh, until we were just about to look for the eye of the sun (meaning sunrise). Then he came out quickly and the Salāh was prepared for. \n\nThe Messenger of Allah ﷺ performed the Salah, and he performed his Salah in a relatively quick manner. When he said the salām, he called out to us saying: ‘Stay in your rows as you are.’ Then he turned to us and said: ‘I am going to narrate to you what kept me from you this morning: I got up during the night, I performed wudhu and prayed as much as I was able to, and I dozed off during my Salāh, and fell in a deep asleep. Then I saw my Lord, Blessed and Most High, in the best of appearances. He said: ‘O Muhammad!’ I said: ‘My Lord here I am my Lord!’ He said: ‘What is it that the most exalted group busy themselves with?’ I said: ‘I do not know Lord.’ And He said it three times.” He said: “So I saw Him place His Palm between my shoulders, and I sensed the coolness of His Fingertips between my breast. Then everything was disclosed for me, and I became aware. So He said: ‘O Muhammad!’ I said: ‘Here I am my Lord!’ He said: ‘What is it that the most exalted group busy themselves with?’ I said: ‘In the acts that atone.’ He said: ‘And what are they?’ I said: ‘The footsteps to the congregation, the gatherings in the Masājid after the Salāh, doing wudhu perfectly during difficulties.’ He said: ‘Then what else?’ I said: ‘Feeding others, being lenient in speech, and Salāh during the night while the people are sleeping.’ He said: ‘Ask.’ I said: [the above]'” The Messenger of Allah ﷺ said: “Indeed it is true, so study it and learn it.” (Tirmidhī 3235)",
    "virtue": ""
  },
  {
    "id": 23,
    "title": "A Comprehensive Duʿa",
    "categories": "Bored",
    "arabic": "اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَ خَيْرَ الْمَسْأَلَةِ ، وَخَيْرَ الدُّعَاءِ ، وَخَيْرَ النَّجَاحِ ، وَخَيْرَ الْعَمَلِ ، وَخَيْرَ الثَّوَابِ ، وَخَيْرَ الْحَيَاةِ ، وَخَيْرَ الْمَمَاتِ ، وَثَبِّتْنِيْ ، وَثَقِّلْ مَوَازِيْنِيْ ، وَحَقِّقْ إِيْمَانِيْ ، وَارْفَعْ دَرَجَاتِيْ ، وَتَقَبَّلْ صَلَاتِيْ ، وَاغْفِرْ خَطِيْئَتِيْ ، وَأَسْأَلُكَ الدَّرَجَاتِ الْعُلَا مِنَ الْجَنَّةِ ، اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَ فَوَاتِحَ الْخَيْرِ ، وَخَوَاتِمَهُ ، وَجَوَامِعَهُ ، وَأَوَّلَهُ ، وَظَاهِرَهُ ، وَبَاطِنَهُ ، وَالدَّرَجَاتِ الْعُلَا مِنَ الْجَنَّةِ آمِيْن ، اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَ خَيْرَ مَا آتِيْ ، وَخَيْرَ مَا أَفْعَلُ ، وَخَيْرَ مَا أَعْمَلُ ، وَخَيْرَ مَا بَطَنَ ، وَخَيْرَ مَا ظَهَرَ ، وَالدَّرَجَاتِ الْعُلَا مِنَ الْجَنَّةِ آمِيْن ، اَللّٰهُمَّ إنِّيْ أَسْأَلُكَ أنْ تَرْفَعَ ذِكْرِيْ ، وَتَضَعَ وِزْرِيْ ، وَتُصْلِحَ أَمْرِيْ ، وَتُطَهِّرَ قَلْبِيْ ، وَتُحَصِّنَ فَرْجِيْ ، وَتُنَوِّرَ لِيْ قَلْبِيْ ، وَتَغْفِرَ لِيْ ذَنْبِيْ ، وَأَسْأَلُكَ الدَّرَجَاتِ الْعُلَا مِنَ الْجَنَّةِ آمِيْن ، اَللّٰهُمَّ إنِّيْ أَسْأَلُكَ أنْ تُبَارِكَ لِيْ فِيْ نَفْسِيْ ، وَفِيْ سَمْعِيْ ، وَفِيْ بَصَرِيْ ، وَفِيْ رُوْحِيْ ، وَفِيْ خَلْقِيْ ، وَفِيْ خُلُقِيْ ، وَفِيْ أَهْلِيْ ، وَفِيْ مَحْيَايَ ، وَفِيْ مَمَاتِيْ ، وَفِيْ عَمَلِيْ ، فَتَقَبَّلْ حَسَنَاتِيْ ، وَأَسْأَلُكَ الدَّرَجَاتِ الْعُلَا مِنَ الْجَنَّةِ ، آمِيْن",
    "translation": "O Allah, I beg You for the best of what can be asked for, the best supplication, the ultimate success, the best deeds, the best reward, the best life, and the best death. Keep me steadfast, make my scales heavy, establish my belief, elevate my ranks, accept my salāh, forgive my sins and I ask You for lofty ranks in Paradise. O Allah, I beg you for good beginnings, good endings, good in its entirety, its first, its apparent and its hidden; and lofty ranks in Paradise. Āmīn. O Allah, I beg you for the best of what I can do, perform and accomplish, the best of what is hidden or apparent; and lofty ranks in Paradise. Āmīn. O Allah, I beg you to elevate my mention, remove my burden, rectify my affairs, purify my heart, protect my chastity, enlighten my heart, forgive my sins and I ask You for lofty ranks in Paradise. Āmīn. O Allah, I beg you to bless for me my inner self, my hearing, my sight, my soul, my appearance, my character, my family, my life, my death and my deeds. Accept my good deeds and I ask You for lofty ranks in Paradise. Āmīn.",
    "transliteration": "Allāhumma innī as’aluka khayra-l-mas’alah, wa khayra-d-duʿā’, wa khayra-n-najaḥ, wa khayra-l-ʿamal, wa khayra-th-thawāb, wa khayra-l-ḥayāh, wa khayra-l-mamāt, wa thabbitnī, wa thaqqil mawāzīnī, wa ḥaqqiq īmānī, wa-r-faʿ darajātī, wa taqabbal ṣalātī, wa-ghfir khaṭī’atī, wa as’aluka-d-darajāti-l-ʿulā mina-l-Jannah, Allāhumma innī as’aluka fawātiḥa-l-khayr, wa khawātimah, wa jawāmiʿah, wa awwalah, wa ẓāhirah, wa bāṭinah, wa-d-darajāti-l-ʿulā mina-l-Jannati āmīn, Allāhumma innī as’aluka khayra mā ātī, wa khayra mā afʿal, wa khayra mā aʿmal, wa khayra mā baṭan, wa khayra mā ẓahar, wa-d-darajāti-l-ʿulā mina-l-Jannati, āmīn, Allāhumma innī as’aluka an tarfaʿa dhikrī, wa taḍaʿa wizrī, wa tuṣliḥa amrī, wa tuṭahhira qalbī, wa tuḥaṣṣina farjī, wa tunawwira lī qalbī, wa taghfira lī dhambī, wa as’aluka-d-darajāti-l-ʿulā mina-l-Jannati, āmīn, Allāhumma innī as’aluka an tubārika lī fī nafsī, wa fī samʿī, wa fī baṣarī, wa fī rūḥī, wa fī khalqī, wa fī khuluqī, wa fī ahlī, wa fī maḥyāya, wa fī mamātī, wa fi ʿamalī, fa-taqabbal ḥasanātī, wa as’aluka-d-darajāti-l-ʿulā mina-l-Jannati, āmīn.",
    "reference": "Umm Salamah (raḍiy Allāhu ‘anhā) narrates that the Prophet ﷺ said: “This is what Muhammad asks from His Lord: [the above].”(Hākim 1867)",
    "virtue": ""
  },
  {
    "id": 24,
    "title": "Guidance & Protection from Evil",
    "categories": "Bored",
    "arabic": "اَللّٰهُمَّ أَلْهِمْنِيْ رُشْدِيْ ، وَأَعِذْنِيْ مِنْ شَرِّ نَفْسِيْ.",
    "translation": "O Allah, inspire me with sound guidance and protect me from the evil of my self.",
    "transliteration": "Allāhumma alhimnī rushdī, wa aʿidhnī min sharri nafsī.",
    "reference": "",
    "virtue": "ʿImrān b. Husayn (raḍiy Allāhu ‘anhu) narrated: “The Prophet ﷺ said to my father: ‘O Husayn, how many deities do you worship now?‘ He said: ‘Seven. Six in the earth, and one above the heavens.’ He ﷺ said: ‘So which of them do you take for your ardent requests and fears?’ He said: ‘The one above the heavens.’ He ﷺ said: ‘O Husayn, if you accept Islam, I would teach you two phrases that would benefit you.’” He (the narrator) said: “So when Husayn accepted Islam, he said: ‘O Messenger of Allah, teach me the two phrases you promised me.’ So he ﷺ said: [the above].” (Tirmidhī 3483)"
  },
  {
    "id": 25,
    "title": "Duʿa of Prophet Sulayman ﷺ for Gratitude to Allah & Doing Good Deeds",
    "categories": "Confident",
    "arabic": "رَبِّ أَوْزِعْنِيْٓ أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِيْٓ أَنْعَمْتَ عَلَيَّ وَعَلَىٰ وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ ، وَأَدْخِلْنِيْ بِرَحْمَتِكَ فِيْ عِبَادِكَ الصَّالِحِيْنَ",
    "translation": "My Lord, enable me to be grateful for Your favour which You have bestowed upon me and upon my parents, and to do good deeds that please You. And admit me by Your mercy amongst Your righteous servants. (27:19)",
    "transliteration": "Rabbi awziʿnī an ashkura niʿmataka-l-latī anʿamta ʿalayya wa ʿalā wālidayya wa an aʿmala ṣāliḥan tarḍāh, wa adhkilnī bi-raḥmatika fī ʿibādika-ṣ-ṣāliḥīn.",
    "reference": "",
    "virtue": ""
  },
  {
    "id": 26,
    "title": "Duʿa for Gratitude, Good Deeds & Pious Children",
    "categories": "Confident",
    "arabic": "رَبِّ أَوْزِعْنِيْٓ أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِيْٓ أَنْعَمْتَ عَلَيَّ وَعَلَىٰ وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ ، وَأَصْلِحْ لِيْ فِيْ ذُرِّيَّتِيْ ، إِنِّيْ تُبْتُ إِلَيْكَ وَإِنِّيْ مِنَ الْمُسْلِمِيْنَ.",
    "translation": "My Lord, enable me to be grateful for Your favour which You have bestowed upon me and upon my parents, and to do good deeds that please You. Make my offspring righteous; I truly repent to you, and truly I am of those who submit to You. (46:15)",
    "transliteration": "Rabbi awziʿnī an ashkura niʿmataka-l-latī anʿamta ʿalayya wa ʿalā wālidayya wa an aʿmala ṣāliḥan tarḍāh, wa aṣliḥ lī fī dhuriyyatī, innī tubtu ilayka wa innī mina-l-muslimīn.",
    "reference": "",
    "virtue": ""
  },
  {
    "id": 27,
    "title": "Duʿa of Prophet Yusuf ﷺ for A Good Ending",
    "categories": "Confident",
    "arabic": "-اَللّٰهُمَّ يَا- فَاطِرَ السَّمٰوَاتِ وَالْأَرْضِ ، أَنْتَ وَلِـيِّيْ فِي الدُّنْيَا وَالْآخِرَةِ ، تَوَفَّنِيْ مُسْلِمًا وَّأَلْحِقْنِيْ بِالصَّالِحِيْنَ",
    "translation": "(O Allah), Originator of the heavens and the earth, You are my Protector in this world and in the Hereafter. Make me die a Muslim and join me with the righteous. (12:101)",
    "transliteration": "(Allāhumma yā) Fāṭira-s-samāwāti wa-l-arḍi Anta waliy-yi fi-d-dunyā wal-ākhirah, tawaffanī Muslimaw-wa alḥiqnī bi-ṣ-ṣāliḥīn.",
    "reference": "",
    "virtue": ""
  },
  {
    "id": 28,
    "title": "Surah al-Fatihah: The Greatest Duʿa",
    "categories": "Confused",
    "arabic": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ ، \nاَلْحَمْدُ لِلّٰهِ رَبِّ الْعَالَمِيْنَ ، الرَّحْمٰنِ الرَّحِيْمِ ، مٰلِكِ يَوْمِ الدِّيْنِ ، إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِيْنُ ، اِهْدِنَا الصِّرَاطَ الْمُسْتَقِيْمَ ، صِرَاطَ الَّذِيْنَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوْبِ عَلَيْهِمْ وَلَا الضَّآلِّيْنَ",
    "translation": "In the name of Allah, the All-Merciful, the Very Merciful. All praises and thanks are for Allah, the Lord of all the worlds, The All-Merciful, The Very Merciful, Master of the Day of Judgement. You Alone we worship, You Alone we ask for help. Guide us on the Straight Path, the path of those whom You have favoured, not of those who incur (Your) anger nor of those who have gone astray. (1:1-7)",
    "transliteration": "Bismi-llāhi-r-Raḥmāni-r-Raḥīm. Alḥamdu-lillāhi Rabbi-l-ʿālamīn, ar-Raḥmāni-r-Raḥīm, Māliki yawmi-d-dīn, iyyāka naʿbudu wa iyyāka nastaʿīn, ihdina-ṣ-Ṣirāṭa-l-Mustaqīm, ṣirāṭa-lladhīna anʿamta ʿalayhim ghayri-l-maghḍūbi ʿālayhim wa la-ḍ-ḍāllīn.",
    "reference": "",
    "virtue": ""
  },
  {
    "id": 29,
    "title": "Istikharah (Seeking Allah's Help in Making a Decision)",
    "categories": "Confused",
    "arabic": "اَللّٰهُمَّ إِنِّيْ أَسْتَخِيْرُكَ بِعِلْمِكَ ، وَأَسْتَقْدِرُكَ بِقُدْرَتِكَ ، وَأَسْأَلُكَ مِنْ فَضْلِكَ الْعَظِيْمِ ، فَإِنَّكَ تَقْدِرُ وَلَا أَقْدِرُ ، وَتَعْلَمُ وَلَا أَعْلَمُ ، وَأَنْتَ عَلَّامُ الْغُيُوْبِ . اَللّٰهُمَّ إِنْ كُنْتَ تَعْلَمُ أَنَّ هٰذَا الْأَمْرَ (وَيُسَمِّي حَاجَتَه) خَيْرٌ لِّيْ فِيْ دِيْنِيْ وَمَعَاشِيْ وَعَاقِبَةِ أَمْرِيْ ، فَاقْدُرْهُ لِيْ وَيَسِّرْهُ لِيْ ثُمَّ بَارِكْ لِيْ فِيْهِ ، وَإِنْ كُنْتَ تَعْلَمُ أَنَّ هٰذَا الْأَمْرَ (وَيُسَمِّي حَاجَتَه) شَرٌّ لِّيْ فِيْ دِيْنِيْ وَمَعَاشِيْ وَعَاقِبَةِ أَمْرِيْ ، فَاصْرِفْهُ عَنِّيْ وَاصْرِفْنِيْ عَنْهُ وَاقْدُرْ لِيَ الْخَيْرَ حَيْثُ كَانَ ثُمَّ أَرْضِنِيْ بِهِ",
    "translation": "O Allah, I ask you for the best through Your knowledge, I seek strength through Your power, and I ask You from Your majestic benevolence. For You are fully able whilst I am not, You know everything whilst I do not know anything, and You are the Knower of the unseen. O Allah, if in Your knowledge, this matter (specify the matter) is good for me in my religion, my livelihood and my ultimate destiny, then decree it for me and make it easy it for me, then bless it for me. But if in your knowledge, this matter (specify the matter) is bad for me in my religion, my livelihood and my ultimate destiny, then turn it away from me, and turn me away from it and decree good for me wherever it may be, then make me pleased with it.",
    "transliteration": "Allāhumma innī astakhīruka bi ʿilmik, wa astaqdiruka bi qudratik, wa as’aluka min faḍlika-l-ʿaẓīm, fa innaka taqdiru wa lā aqdir, wa taʿlamu wa lā aʿlam, wa Anta ʿAllāmu-l-ghuyūb. Allāhumma in kunta taʿlamu an-na hādha-l-amra khayrul-lī fī dīnī wa maʿāshī wa ʿāqibati amrī, faqdurhu lī wa yassirhu lī thumma bārik lī fīhī, wa in kunta taʿlamu anna hādha-l-amra sharrul-lī fī dīnī wa maʿāshī wa ʿāqibati amrī, faṣrifhu ʿannī waṣrifnī ʿanhu waqdur liya-l-khayra ḥaythu kāna thumma arḍinī bih.",
    "reference": "Jābir (raḍiy Allāhu ‘anhu) narrated: “The Messenger of Allah ﷺ used to teach us istikhārah (when one seeks Allah’s help in making a decision) for all matters, the same way he taught us Sūrahs from the Qur’ān. He ﷺ said: “When one of you intends to do something, he should offer two rak‘ahs of voluntary Salāh, and then say [the above].” (Bukhārī 1162) \n\nIbn Abī Jamrah (raḥimahullāh) said: ‘The wisdom of preceding Salāh before the du‘ā’ is that the purpose of istikhārah is to combine the good of this world and the Hereafter. A person needs to knock at the door of the King (Allah), and there is nothing more effective for this than salāh, because it combines the glorification and praise of Allah, and expresses one’s need for Him at all times. (Fath al-Bārī)",
    "virtue": ""
  },
  {
    "id": 30,
    "title": "Duʿa of Prophet Musa ﷺ Expressing His Dire Need",
    "categories": "Confused",
    "arabic": "رَبِّ إِنِّيْ لِمَآ أَنْزَلْتَ إِلَيَّ مِنْ خَيْرٍ فَقِيْرٌ",
    "translation": "My Lord, truly I am in dire need of any good which You may send me. (28:24)",
    "transliteration": "Rabbi innī limā anzalta illayya min khayrin faqīr.",
    "reference": "",
    "virtue": ""
  },
  {
    "id": 31,
    "title": "Best Outcomes & Protection from Humiliation",
    "categories": "Confused",
    "arabic": "اَللّٰهُمَّ أَحْسِنْ عَاقِبَتَنَا فِي الْأُمُوْرِ كُلِّهَا ، وَأَجِرْنَا مِنْ خِزْيِ الدُّنْيَا وَعَذَابِ الْآخِرَةِ",
    "translation": "O Allah, grant us the best outcome in all of our affairs, and protect us from the humiliation of this world and the punishment of the hereafter.",
    "transliteration": "Allāhumma aḥsin ʿāqibatanā fi-l-umūri kullihā, wa ajirnā min khizyi-d-dunyā wa ʿadhābi-l-ākhirah.",
    "reference": "Busr b. Abī Artāt (raḍiy Allāhu ‘anhu) narrates that I heard the Messenger of Allah ﷺ supplicate with [the above]. (Aḥmad 17628)",
    "virtue": ""
  },
  {
    "id": 32,
    "title": "A Priceless Treasure",
    "categories": "Confused",
    "arabic": "اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَ الثَّبَاتَ فِي الْأَمْرِ ، وَالْعَزِيْمَةَ عَلَى الرُّشْدِ ، وَأَسْأَلُكَ مُوْجِبَاتِ رَحْمَتِكَ ، وَعَزَائِمَ مَغْفِرَتِكَ ، وَأَسْأَلُكَ شُكْرَ نِعْمَتِكَ ، وَحُسْنَ عِبَادَتِكَ ، وَأَسْأَلُكَ قَلْبًا سَلِيْمًا ، وَلِسَانًا صَادِقًا ، وَأَسْأَلُكَ مِنْ خَيْرِ مَا تَعْلَمُ ، وَأَعُوْذُ بِكَ مِنْ شَرِّ مَا تَعْلَمُ ، وَأَسْتَغْفِرُكَ لِمَا تَعْلَمُ ، إِنَّكَ أَنْتَ عَلَّامُ الْغُيُوْبِ",
    "translation": "O Allah, I beg you for steadfastness in all matters and the determination to take the right course. I ask You for all that which will necessitate Your mercy and the determination to do all that which will necessitate Your forgiveness. I ask You to make me grateful for Your blessings and to worship You in an excellent manner. I ask You for a sound heart and a truthful tongue. I ask You for the good of what You know, I seek Your protection from the evil of what You know, and I seek Your forgiveness for what You know. Indeed, You are the All-Knowing of the unseen.",
    "transliteration": "Allāhumma innī as’aluka-th-thabāta fil-amr, wa-l-ʿazīmata ʿala-r-rushd, wa as’aluka mūjibāti raḥmatik, wa ʿazā’ima maghfiratik, wa as’aluka shukra niʿmatik, wa ḥusna ʿibādatik, wa as’aluka qalban salīmā, wa lisānan ṣādiqā, wa as’aluka min khayri mā taʿlam, wa aʿūdhu bika min sharri mā taʿlam, wa astaghfiruka limā taʿlam, innaka Anta ʿAllāmul-ghuyūb.",
    "reference": "",
    "virtue": "Shaddād b. Aws (raḍiy Allāhu ‘anhu) narrates that the Messenger of Allah ﷺ was teaching this duā to me. he said: “O Shaddād, when you see people collecting gold & silver as their treasures, then consider [the above] as your treasure.” (Ahmad 17155)"
  },
  {
    "id": 33,
    "title": "Asking for Good & Protection From Evil",
    "categories": "Confused",
    "arabic": "اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَ مِنَ الْخَيْرِ كُلِّهِ عَاجِلِهِ وَآجِلِهِ ، مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ ، وَأَعُوْذُ بِكَ مِنَ الشَّرِّ كُلِّهِ عَاجِلِهِ وَآجِلِهِ ، مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ ، اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَ مِنْ خَيْرِ مَا سَأَلَكَ عَبْدُكَ وَنَبِيُّكَ ، وَأَعُوْذُ بِكَ مِنْ شَرِّ مَا عَاذَ مِنْهُ عَبْدُكَ وَنَبِيُّكَ ، اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَ الْجَنَّةَ ، وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ ، وَأَعُوْذُ بِكَ مِنَ النَّارِ ، وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ ، وَأَسْأَلُكَ أَنْ تَجْعَلَ كُلَّ قَضَاءٍ قَضَيْتَهُ لِيْ خَيْرًا",
    "translation": "O Allah, I beg You for all good: the immediate and the delayed, what I know of and what I do not know. I seek Your protection from all evil: the immediate and the delayed, what I know of and what I do not know. O Allah, I beg You for the good which Your slave and Prophet ﷺ asked from You, and I seek Your protection from the evil which Your slave and Prophet ﷺ sought protection for from You. O Allah, I beg You for Paradise, and whatever words or actions lead to it. I seek Your protection from Hell-fire, and whatever words or actions lead to it. I ask You to decree good for me in everything You foreordain for me.",
    "transliteration": "Allāhumma innī as’aluka mina-l-khayri kullihī ʿājilihī wa ājilih, mā ʿalimtu minhu wa mā lam aʿlam, wa aʿūdhu bika mina-sh-sharri kullih ʿājilihī wa ājilih, mā ʿalimtu minhu wa mā lam aʿlam, Allāhumma innī as’aluka min khayri mā sa’alaka ʿabduka wa Nabiyyuk, wa aʿūdhu bika min sharri mā ʿādha minhu ʿabduka wa Nabiyyuk, Allāhumma innī as’aluka-l-Jannah, wa mā qarraba ilayhā min qawlin aw ʿamal, wa aʿūdhu bika mina-n-nār, wa mā qarraba ilayhā min qawlin aw ʿamal, wa as’aluka an tajʿala kulla qaḍā’in qaḍaytahū lī khayrā.",
    "reference": "‘Āishah narrates that the Messenger of Allah ﷺ taught her [the above]. (Ahmad 25019)",
    "virtue": ""
  },
  {
    "id": 34,
    "title": "Guidance to the Truth",
    "categories": "Confused",
    "arabic": "اَللّٰهُمَّ رَبَّ جَبْرَائِيْلَ ، وَمِيْكَائِيْلَ ، وإِسْرَافِيْلَ ، فَاطِرَ السَّمٰوَاتِ وَالْأَرْضِ ، عَالِمَ الْغَيْبِ وَالشَّهَادَةِ ، أَنْتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِيْمَا كَانُوْا فِيْهِ يَخْتَلِفُوْنَ ، اِهْدِنِيْ لِمَا اخْتُلِفَ فِيْهِ مِنَ الْحَقِّ بِإِذْنِكَ ، إِنَّكَ تَهْدِيْ مَنْ تَشَاءُ إِلَىٰ صِرَاطٍ مُّسْتَقِيْمٍ.",
    "translation": "O Allah, Lord of Jabrā’īl, Mīkā’īl and Isrāfīl, Creator of the heavens and the earth, Knower of the unseen and seen; You will judge between Your servants in what they used to differ. Guide me in what is contentious to the truth, by Your will. Indeed, You guide whomsoever You wish to a straight path.",
    "transliteration": "Allāhumma Rabba Jabrā’īla, wa Mīkā’īla, wa Isrāfīl, fāṭira-s-samāwāti wa-l-arḍ, ʿālima-l-ghaybi wa-sh-shahādah, Anta taḥkumu bayna ʿibādika fīmā kānū fīhi yakhtalifūn, ihdinī lima-khtulifa fīhi mina-l-ḥaqqi bi-idhnik, innaka tahdī man tashā’u ilā Ṣirāṭi-m-Mustaqīm.",
    "reference": "ʿAbdur Rahmān b. Awf (raḍiy Allāhu ‘anhu) narrated: I asked ‘Ā’isha (raḍiy Allāhu ‘anhā), the mother of the believers, (to tell me) the words with which the Messenger of Allah ﷺ commenced the Salāh when he got up at night. She said: “When he got up at night he would commence his Salāh with [the above] words. (Muslim 770)",
    "virtue": ""
  },
  {
    "id": 35,
    "title": "Guidance & Steadfastness",
    "categories": "Confused",
    "arabic": "اَللّٰهُمَّ اهْدِنِيْ وَسَدِّدْنِيْ ، اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَ الْهُدَىٰ وَالسَّدَادَ.",
    "translation": "O Allah, guide me and grant me firmness. O Allah, I beg You for guidance and firmness (on the straight path).",
    "transliteration": "Allāhumma-hdinī wa saddidnī, Allāhumma innī as'aluka-l-hudā wa-s-sadād.",
    "reference": "Ali (raḍiy Allāhu ‘anhu) reported that the Messenger of Allah ﷺ said to him: “Say: [the above] and when you make a mention of guidance, keep in mind the (Straight) Path and when you consider the Straight (Path), keep in mind the straightness of the arrow.” (Muslim 2725)",
    "virtue": ""
  },
  {
    "id": 36,
    "title": "Fulfil Your Obligation to Thank Allah",
    "categories": "Content",
    "arabic": "اَللّٰهُمَّ مَا أَمْسَىٰ بِيْ مِنْ نِّعْمَةٍ أَوْ بِأَحَدٍ مِّنْ خَلْقِكَ ، فَمِنْكَ وَحْدَكَ لَا شَرِيْكَ لَكَ ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ.",
    "translation": "O Allah, all the favours that I or anyone from Your creation has received in the evening, are from You Alone. You have no partner. To You Alone belong all praise and all thanks.",
    "transliteration": "Allāhumma mā amsā bī min niʿmatin aw bi-aḥadin min khalqik, fa-minka waḥdaka lā sharīka lak, fa laka-l-ḥamdu wa laka-sh-shukr.",
    "reference": "",
    "virtue": "ʿAbdullāh b. Ghannām (raḍiy Allāhu ʿanhu) narrates that the Messenger of Allah ﷺ said: “Whoever says [the above] in the morning has fulfilled his obligation to thank Allah for that day. And whoever says it in the evening has fulfilled his obligation for that night.” (Abū Dāwūd 5073)"
  },
  {
    "id": 37,
    "title": "Praise Allah with the Praises of the Entire Creation",
    "categories": "Content",
    "arabic": "اَلْحَمْدُ لِلّٰهِ الَّذِيْ كَفَانِيْ وَآوَانِيْ ، اَلْحَمْدُ لِلّٰهِ الَّذِيْ أَطْعَمَنِيْ وَسَقَانِيْ ، اَلْحَمْدُ لِلّٰهِ الَّذِيْ مَنَّ عَلَيَّ فَأَفْضَلَ ، اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَ بِعِزَّتِكَ أَنْ تُنَجِّيَنِيْ مِنَ النَّارِ.",
    "translation": "All praise is for Allah who has sufficed me and given me refuge. All praise is for Allah who has fed me and given me drink. All praise is for Allah who has been gracious to me and showered favours on me. O Allah, I ask You by Your glory to save me from the Hell-Fire.",
    "transliteration": "Al-ḥamdu lillāhi-lladhī kafānī wa āwānī, al-ḥamdu lillāhi-lladhī aṭʿamanī wa saqānī, al-ḥamdu lillāhi-lladhī manna ʿalayya fa-afḍal, Allāhumma innī as’aluka biʿizzatika an tunajjiyanī mina-n-nār.",
    "reference": "",
    "virtue": "The Messenger of Allah ﷺ said: “Whoever says [the above] when retiring to bed has praised Allah with all the praises of His entire creation.” (Hākim 2001)"
  },
  {
    "id": 38,
    "title": "Praise Allah for All His Favours",
    "categories": "Content",
    "arabic": "اَلْحَمْدُ لِلَّهِ الَّذِيْ يُطْعِمُ وَلَا يُطْعَمُ ، مَنَّ عَلَيْنَا فَهَدَانَا وَأَطْعَمَنَا وَسَقَانَا ، وَكُلَّ بَلَاءٍ حَسَنٍ أَبْلَانَا ، اَلْحَمْدُ لِلَّهِ غَيْرَ مُوَدَّعٍ وَّلَا مُكَافَأٍ وَّلَا مَكْفُوْرٍ وَّلَا مُسْتَغْنًى عَنْهُ ، اَلْحَمْدُ لِلَّهِ الَّذِيْ أَطْعَمَ مِنَ الطَّعَامِ ، وَسَقَىٰ مِنَ الشَّرَابِ ، وَكَسَا مِنَ الْعُرْيِ ، وَهَدَىٰ مِنَ الضَّلَالَةِ ، وَبَصَّرَ مِنَ الْعَمَىٰ ، وَفَضَّلَ عَلَىٰ كَثِيْرٍ مِّنْ خَلْقِهِ تَفْضِيْلًا ، اَلْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِيْنَ",
    "translation": "All praise is for Allah who feeds and is not fed. He favoured us, and thus guided us, blessed us with food and drink, and bestowed upon us every favour. All praise is for Allah, a praise which we will never bid farewell to, a never-ending praise, an accepted praise and an indispensable praise. All praise is for Allah who provided food and drink; who clothed us, guided us from error, removed our blindness and favoured us greatly over many of His creation. All praise is for Allah, Lord of the worlds.",
    "transliteration": "Al-ḥamdu lillāhi-lladhī yuṭʿiumu wa lā yuṭʿam, manna ʿalaynā fa-hadānā wa aṭʿamanā wa saqānā, wa kulla balā’in ḥasanin ablānā, al-ḥamdu lillāhi ghayra muwaddaʿin wa lā mukāfa’iw-wa lā makfūrin wa lā mustaghnan ʿanh, al-ḥamdu lillāhi-lladhī aṭʿama mina-ṭ-ṭaʿām, wa saqā mina-sh-sharāb, wa kasā minal-ʿurā, wa hadā mina-ḍ-ḍalālah, wa baṣṣara mina-l-ʿamā, wa faḍḍala ʿalā kathīrim-min-khalqihī tafḍīlā, alḥamdu-lillāhi Rabbi-l-ʿālamīn.",
    "reference": "Abū Hurayrah (raḍiy Allāhu ‘anhu) narrates: “A man from the Anṣār from the people of Qubā invited the Prophet ﷺ for a meal. When he ﷺ had finished eating and had washed his hands, he said [the above].” (Nasā’ī in Sunan al-Kubrā 10060, Ibn Ḥibbān 5219)",
    "virtue": ""
  },
  {
    "id": 39,
    "title": "Duʿa of Prophet Yusuf ﷺ for A Good Ending",
    "categories": "Content",
    "arabic": "-اَللّٰهُمَّ يَا- فَاطِرَ السَّمٰوَاتِ وَالْأَرْضِ ، أَنْتَ وَلِـيِّيْ فِي الدُّنْيَا وَالْآخِرَةِ ، تَوَفَّنِيْ مُسْلِمًا وَّأَلْحِقْنِيْ بِالصَّالِحِيْنَ",
    "translation": "(O Allah), Originator of the heavens and the earth, You are my Protector in this world and in the Hereafter. Make me die a Muslim and join me with the righteous. (12:101)",
    "transliteration": "(Allāhumma yā) Fāṭira-s-samāwāti wa-l-arḍi Anta waliy-yi fi-d-dunyā wal-ākhirah, tawaffanī Muslimaw-wa alḥiqnī bi-ṣ-ṣāliḥīn.",
    "reference": "",
    "virtue": ""
  },
  {
    "id": 40,
    "title": "Protection from Allah’s Anger & Removal of Blessings",
    "categories": "Content",
    "arabic": "اَللّٰهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنْ زَوَالِ نِعْمَتِكَ ، وَتَحَوُّلِ عَافِيَتِكَ ، وَفُجَاءَةِ نِقْمَتِكَ ، وَجَمِيْعِ سَخَطِكَ.",
    "translation": "O Allah, I seek Your protection from the loss of Your favours, the removal of Your complete protection, Your sudden punishment and all that which may incur Your displeasure.",
    "transliteration": "Allāhumma innī aʿūdhu bika min zawāli niʿmatik, wa taḥawwuli ʿāfiyatik, wa fujā’ati niqmatik, wa jamīʿi sakhaṭik.",
    "reference": "ʿAbdullah b. ʿUmar (radiy Allāhū ‘anhumā) reported that from the supplication of the Messenger of Allah ﷺ was [the above]. (Muslim 2739, Abū Dāwūd 1545)",
    "virtue": ""
  },
  {
    "id": 41,
    "title": "Surah al-Fatihah: The Greatest Duʿa",
    "categories": "Depressed",
    "arabic": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ ، \nاَلْحَمْدُ لِلّٰهِ رَبِّ الْعَالَمِيْنَ ، الرَّحْمٰنِ الرَّحِيْمِ ، مٰلِكِ يَوْمِ الدِّيْنِ ، إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِيْنُ ، اِهْدِنَا الصِّرَاطَ الْمُسْتَقِيْمَ ، صِرَاطَ الَّذِيْنَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوْبِ عَلَيْهِمْ وَلَا الضَّآلِّيْنَ",
    "translation": "In the name of Allah, the All-Merciful, the Very Merciful. All praises and thanks are for Allah, the Lord of all the worlds, The All-Merciful, The Very Merciful, Master of the Day of Judgement. You Alone we worship, You Alone we ask for help. Guide us on the Straight Path, the path of those whom You have favoured, not of those who incur (Your) anger nor of those who have gone astray. (1:1-7)",
    "transliteration": "Bismi-llāhi-r-Raḥmāni-r-Raḥīm. Alḥamdu-lillāhi Rabbi-l-ʿālamīn, ar-Raḥmāni-r-Raḥīm, Māliki yawmi-d-dīn, iyyāka naʿbudu wa iyyāka nastaʿīn, ihdina-ṣ-Ṣirāṭa-l-Mustaqīm, ṣirāṭa-lladhīna anʿamta ʿalayhim ghayri-l-maghḍūbi ʿālayhim wa la-ḍ-ḍāllīn.",
    "reference": "",
    "virtue": ""
  },
  {
    "id": 42,
    "title": "When Difficulties Make You Yearn for Death",
    "categories": "Depressed",
    "arabic": "اَللّٰهُمَّ أَحْيِنِيْ مَا كَانَتِ الْحَيَاةُ خَيْرًا لِيْ ، وَتَوَفَّنِيْ إِذَا كَانَتِ الْوَفَاةُ خَيْرًا لِيْ",
    "translation": "O Allah, let me live as long as life is better for me; and give me death when death is better for me.",
    "transliteration": "Allāhumma aḥyinī mā kānati-l-ḥayātu khayral-lī, wa tawaffanī idhā kānati-l-wafātu khayral-lī.",
    "reference": "The Messenger of Allah ﷺ said: “None of you should wish for death because of a difficulty that befalls him. Rather he should say [the above].” (Bukhārī 5671, Muslim 2680)",
    "virtue": ""
  },
  {
    "id": 43,
    "title": "When One is in a Difficult Situation",
    "categories": "Depressed",
    "arabic": "اَللّٰهُمَّ لَا سَهْلَ إِلَّا مَا جَعَلْتَهُ سَهْلًا ، وَأَنْتَ تَجْعَلُ الْحَزْنَ إِذَا شِئْتَ سَهْلًا",
    "translation": "O Allah, there is no ease except in that which You have made easy, and You make the difficulty easy when You wish.",
    "transliteration": "Allāhumma lā sahla illā mā jaʿaltahū sahlā, wa anta tajʿalu-l-ḥazna idhā shi’ta sahlā.",
    "reference": "Anas b. Malik (raḍiy Allāhu ‘anhu) ﷺ narrates that the Messenger of Allah said [the above]. (Ibn Hibbān 2427, Ibn al-Sunnī 351)",
    "virtue": ""
  },
  {
    "id": 44,
    "title": "Protect Yourself From Anxiety, Laziness, Debt etc",
    "categories": "Depressed",
    "arabic": "اَللّٰهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ ، وَأَعُوْذُ بِكَ مِنَ الْعَجْزِ وَالْكَسَلِ، وَأَعُوْذُ بِكَ مِنَ الْجُبْنِ وَالْبُخْلِ ، وَأَعُوْذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ وَقَهْرِ الرِّجَالِ.",
    "translation": "O Allah, I seek Your protection from anxiety and grief. I seek Your protection from inability and laziness. I seek Your protection from cowardice and miserliness, and I seek Your protection from being overcome by debt and being overpowered by men.",
    "transliteration": "Allāhumma innī aʿūdhu bika min-l-hammi wa-l-ḥazan, wa aʿūdhu bika min-l-ʿajzi wa-l-kasal, wa aʿūdhu bika min-l-jubni wa-l-bukhl, wa aʿūdhu bika min ghalabati-d-dayni wa qahri-r-rijāl.",
    "reference": "",
    "virtue": "Abū Saʿīd al-Khudrī (raḍiy Allāhu ʿanhu) narrated that one day, the Messenger of Allah ﷺ entered the masjid. He saw a man from the Anṣār called Abū Umāmah (raḍiy Allāhu ʿanhu). He ﷺ asked, “What is the matter? Why are you sitting in the mosque when it is not the time for prayer?” He replied, “Never-ending worries and debts, O Messenger of Allah.” The Messenger of Allah ﷺ then asked, “Shall I not teach you words by which, when you say them, Allah will remove your worries, and settle your debts?” He replied, “Yes of course, O Messenger of Allah.” He ﷺ said, “Say in the morning and evening [the above].” Abū Umāmah (raḍiy Allāhu ʿanhu) said, “Then I did that, and Allah removed my worries and settled my debts.” (Abū Dāwūd 1555)"
  },
  {
    "id": 45,
    "title": "When Struck by a Calamity",
    "categories": "Depressed",
    "arabic": "إِنَّا لِلّٰهِ وَإِنَّا إِلَيْهِ رَاجِعُوْنَ ، اَللّٰهُمَّ اْجُرْنِيْ فِيْ مُصِيْبَتِيْ ، وَأَخْلِفْ لِيْ خَيْرًا مِنْهَا",
    "translation": "To Allah we belong and unto Him is our return. O Allah, recompense me for my affliction and replace it for me with something better.",
    "transliteration": "Innā lillāhi wa innā ilayhi rājiʿūn, Allāhumma-‘jurnī fī muṣībatī, wa akhlif lī khayram-minha.",
    "reference": "",
    "virtue": "Umm Salamah (raḍiy Allāhu ‘anhā) said: I heard the Messenger of Allah ﷺ say, “There is no Muslim who is afflicted with a calamity, and then says what Allah has commanded him [the above supplication], except that Allah will recompense him with something better than it.” She says: “When Abū Salamah (her first husband) passed away, I said, ‘Which Muslim is better than Abū Salamah – the first household to migrate to the Messenger of Allah?’ I then said (the above duʿā’), and Allah recompensed me (by marrying me to) the Messenger of Allah ﷺ.” (Muslim 918)"
  },
  {
    "id": 46,
    "title": "Well-being in this World and the Hereafter",
    "categories": "Depressed",
    "arabic": "اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَ الْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ ، اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِيْ دِيْنِيْ وَدُنْيَايَ وَأَهْلِيْ وَمَالِيْ ، اَللّٰهُمَّ اسْتُرْ عَوْرَاتِيْ وَآمِنْ رَوْعَاتِيْ ، اَللّٰهُمَّ احْفَظْنِيْ مِنْ بَيْنِ يَدَيَّ ، وَمِنْ خَلْفِيْ ، وَعَنْ يَّمِيْنِيْ ، وَعَنْ شِمَالِيْ ، وَمِنْ فَوْقِيْ ، وَأَعُوْذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِيْ.",
    "translation": "O Allah, I ask You for well-being in this world and the next. O Allah, I ask You for forgiveness and well-being in my religion, in my worldly affairs, in my family and in my wealth. O Allah, conceal my faults and calm my fears. O Allah, guard me from in front of me and behind me, from my right, and from my left, and from above me. I seek protection in Your Greatness from being unexpectedly destroyed from beneath me.",
    "transliteration": "Allāhumma innī as’aluka-l-ʿāfiyata fi-d-dunyā wa-l-ākhirah. Allāhumma innī as’aluka-l-ʿafwa wa-l-ʿāfiyata fī dīnī wa dunyāya wa ahlī wa mālī, Allāhumma-stur ʿawrātī wa āmin rawʿātī. Allāhumma-ḥfaẓnī mim bayni yadayya wa min khalfī, wa ʿay-yamīnī wa ʿan shimālī wa min fawqī, wa aʿūdhu bi-ʿaẓamatika an ughtāla min taḥtī.",
    "reference": "",
    "virtue": "ʿAbdullāh b. ʿUmar (raḍiy Allāhu ʿanhumā) narrated: “The Messenger of Allah ﷺ never failed to say these words in the morning and in the evening.” (Abū Dāwūd 5074)"
  },
  {
    "id": 47,
    "title": "Grief & Anxiety #1",
    "categories": "Depressed",
    "arabic": "اَللّٰهُمَّ إِنِّيْ عَبْدُكَ ، وَابْنُ عَبْدِكَ ، وَابْنُ أَمَتِكَ ، نَاصِيَتِيْ بِيَدِكَ ، مَاضٍ فِيَّ حُكْمُكَ ، عَدْلٌ فِيَّ قَضَاؤُكَ ، أَسْأَلُكَ بِكُلِّ اسْمٍ هُوَ لَكَ ، سَمَّيْتَ بِهِ نَفْسَكَ ، أَوْ عَلَّمْتَهُ أَحَدًا مِنْ خَلْقِكَ ، أَوْ أَنْزَلْتَهُ فِيْ كِتَابِكَ ، أَوِ اسْتَأْثَرْتَ بِهِ فِيْ عِلْمِ الْغَيْبِ عِنْدَكَ ، أَنْ تَجْعَلَ الْقُرْآنَ رَبِيْعَ قَلْبِيْ ، وَنُوْرَ صَدْرِيْ وَجَلَاءَ حُزْنِيْ ، وَذَهَابَ هَمِّيْ",
    "translation": "O Allah, I am Your slave and the son of Your male slave and the son of Your female slave. My forehead is in Your Hand (i.e. you have control over me). I am subject to Your judgement and Your decree concerning me is just. I ask You – by every name that is Yours, by which You have named Yourself, or taught any one of Your creation, or revealed in Your Book, or kept unto Yourself in the knowledge of the unseen that is with You – to make the Qur’ān the spring of my heart, the light of my chest, the banisher of my grief and the reliever of my anxiety.",
    "transliteration": "Allāhumma innī ʿabduk, wa-bnu ʿabdik, wa-bnu amatik, nāṣiyatī bi-yadik, māḍin fiyya ḥukmuk, ʿadlun fiyya qaḍā’uk, as’aluka bi-kulli-smin huwa lak, sammayta bihi nafsak, aw ʿallamtahū aḥadam-min khalqik, aw anzaltahū fī Kitābik, awi-sta’tharta bihī fī ʿilmi-l-ghaybi ʿindak, an tajʿala-l-Qur’āna rabīʿa qalbī, wa nūra ṣadrī wa jalā’a ḥuznī, wa dhahāba hammī.",
    "reference": "",
    "virtue": "The Messenger of Allah ﷺ said: “There is no one amongst you who, when he is stricken with grief and anxiety, says [the above] except that Allah will remove his grief and anxiety, and will give him joy instead.” The companions said, ‘O Messenger of Allah, should we not learn these words?’ He ﷺ replied, ‘Of course! One who hears it should learn it.’” (Ahmad 3712)"
  },
  {
    "id": 48,
    "title": "Grief & Anxiety #2",
    "categories": "Depressed",
    "arabic": "لَا إِلٰهَ إِلَّا اللّٰهُ الْعَظِيْمُ الْحَلِيْمُ ، لَا إِلٰهَ إِلَّا اللّٰهُ رَبُّ الْعَرْشِ الْعَظِيْمِ ، لَا إِلٰهَ إِلَّا اللّٰهُ رَبُّ السَّمٰـوٰتِ وَرَبُّ الْأَرْضِ وَرَبُّ الْعَرْشِ الْكَرِيْمِ",
    "translation": "There is no god but Allah, the Supreme, The Forbearing. There is no god but Allah, Lord of the Magnificent Throne. There is no god but Allah, Lord of the heavens, Lord of the earth, Lord of the Noble Throne.",
    "transliteration": "Lā ilāha illā-llāhu-l-ʿĀẓīmu-l-Ḥalīm, lā ilāha illā-llāhu Rabbu-l-ʿĀrshi-l-ʿAẓīm, lā ilāha illā-llāhu Rabbu-s-samāwāti wa Rabbu-l-arḍi wa Rabbu-l-ʿĀrshi-l-karīm.",
    "reference": "The Messenger of Allah ﷺ would invoke Allah at the time of distress with [the above]. (Bukhārī 6345, Muslim 2730)",
    "virtue": ""
  },
  {
    "id": 49,
    "title": "When One is Afraid of People #2",
    "categories": "Depressed",
    "arabic": "حَسْبُنَا اللّٰهُ وَنِعْمَ الْوَكِيْلُ",
    "translation": "Allah is enough for us and He is the Best Protector.",
    "transliteration": "Ḥasbunallāhu wa niʿmal Wakīl.",
    "reference": "Ibn ʿAbbās (radiy Allāhū ‘anhumā) narrated: \"[the above] was said by Ibrāhīm (‘alayhis-salām) when he was thrown into the fire; and it was said by Muhammad ﷺ when they (i.e. the hypocrites) said, “A great army is gathering against you, therefore, fear them,” but it only increased their faith and they said: “Allah is Sufficient for us, and He is the Best Disposer (of affairs, for us).” (3.173) (Bukhārī 4563)",
    "virtue": ""
  },
  {
    "id": 50,
    "title": "When One Feels Frightened",
    "categories": "Depressed",
    "arabic": "لَا إِلٰهَ إِلَّا اللّٰهُ",
    "translation": "There is no god but Allah.",
    "transliteration": "Lā ilāha illā-llāh.",
    "reference": "Zaynab bint Jaḥsh (raḍiy Allāhu ʿanhā) said that the Messenger of Allah ﷺ once came to her in a state of fear and said, [the above] Woe unto the Arabs from a danger that has come near. An opening has been made in the wall of Yājūj and Mājūj like this, making a circle with his thumb and index finger. Zaynab bint Jaḥsh said, “O Messenger of Allah ﷺ! Shall we be destroyed even though there are pious persons among us?” He said, “Yes, when evil (people) will increase.” (Bukhārī 3346)",
    "virtue": ""
  },
  {
    "id": 51,
    "title": "Protection From The Anguish of the World & Hereafter",
    "categories": "Depressed",
    "arabic": "اَللّٰهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنْ ضِيْقِ الدُّنْيَا وَضِيْقِ يَوْمِ الْقِيَامَةِ.",
    "translation": "O Allah, I seek Your protection from the anguish of the world and the anguish of the Day of Judgement.",
    "transliteration": "Allāhumma innī aʿūdhu bika min ḍīqi-d-dunyā wa ḍīqi yawmi-l-qiyāmah.",
    "reference": "Sharīq al-Hawzānī (raḥimahullāh) narrates that I entered upon Aisha (raḍiy Allāhu ‘anhā) and I asked her: “With which supplication did the Messenger of Allah ﷺ begin his Salāh when he woke up at night?” She replied: “You have asked me regarding something which no one has asked me before.” When he woke up at night, he uttered: Allāhu Akbar (Allah is the Greatest) ten times, and uttered Alḥamdullillāh (All praise be to Allah) ten times, and said Subḥāna-llāhi wa bi ḥamdih. (Allah is free from imperfection, and all praise is due to Him.) ten times, and said: Subḥānal Malik al-Quddūs (How perfect is the Sovereign, the Most Holy) ten times, and asked Allah’s forgiveness ten times, and said: “There is no god but Allah” ten times, and then said: [the above] ten times. He then began the Salāh. (Abū Dāwūd 5085)",
    "virtue": ""
  },
  {
    "id": 52,
    "title": "Allah Will Suffice You in Everything",
    "categories": "Depressed",
    "arabic": "حَسْبِيَ اللّٰهُ لَا إِلٰهَ إِلَّا هُوَ ، عَلَيْهِ تَوَكَّلْتُ ، وَهُوَ رَبُّ الْعَرْشِ الْعَظِيْمِ.",
    "translation": "Allah is sufficient for me. There is no god worthy of worship except Him. I have placed my trust in Him only and He is the Lord of the Magnificent Throne.",
    "transliteration": "Ḥasbiya-Allāhu lā ilāha illā Huwa, ʿalayhi tawakkaltu, wa Huwa Rabbu-l-ʿArshi-l-ʿaẓīm.",
    "reference": "",
    "virtue": "Abū al-Dardā’ (raḍiy Allāhu ʿanhu) narrates from the Messenger of Allah ﷺ that he said: “Whoever recites [the above] seven times in the morning and in the evening, Allah will suffice him in everything that concerns him in matters of this world and the next.” (Ibn al-Sunnī 71)"
  },
  {
    "id": 53,
    "title": "Duʿa of Prophet Musa ﷺ Expressing His Dire Need",
    "categories": "Depressed",
    "arabic": "رَبِّ إِنِّيْ لِمَآ أَنْزَلْتَ إِلَيَّ مِنْ خَيْرٍ فَقِيْرٌ",
    "translation": "My Lord, truly I am in dire need of any good which You may send me. (28:24)",
    "transliteration": "Rabbi innī limā anzalta illayya min khayrin faqīr.",
    "reference": "",
    "virtue": ""
  },
  {
    "id": 54,
    "title": "For Difficult Times: All Your Prayers Answered",
    "categories": "Depressed",
    "arabic": "لَآ إِلٰهَ إِلَّآ أَنْتَ سُبْحَانَكَ إِنِّيْ كُنْتُ مِنَ الظَّالِمِيْنَ",
    "translation": "There is no god worthy of worship except You; You are free from all imperfection. Indeed, I have been of the wrongdoers. (21:87)",
    "transliteration": "Lā ilāha illā Anta subḥānaka innī kuntu mina-ẓ-ẓālimīn.",
    "reference": "",
    "virtue": "The Messenger of Allah ﷺ said: “The supplication of Dhun-Nūn (Prophet Yūnus) when he supplicated, while in the belly of the whale was: [the above]. ”No Muslim man ever supplicates with [the above] except that Allah answers his supplication.” (Tirmidhī 3505)"
  },
  {
    "id": 55,
    "title": "When One is Distressed",
    "categories": "Depressed",
    "arabic": "اَللّٰهُمَّ رَحْمَتَكَ أَرْجُوْ فَلَا تَكِلْنِيْ إِلٰى نَفْسِيْ طَرْفَةَ عَيْنٍ ، وَأَصْلِحْ لِي شَأْنِيْ كُلَّهُ لَا إِلٰهَ إِلَّا أَنْتَ",
    "translation": "O Allah! Your Mercy is what I hope for so do not entrust me to myself for the blink of an eye, rectify all of my affairs. There is no god worthy of worship but You.",
    "transliteration": "Allāhumma raḥmataka arjū fa-lā takilnī ilā nafsī ṭarfata ʿayn, wa aṣliḥ lī sha’nī kullah lā ilāha illā Ant.",
    "reference": "The Messenger of Allah ﷺ said: “The supplications for the one who is distressed are [the above].” (Abu Dāwud 5090)",
    "virtue": ""
  },
  {
    "id": 56,
    "title": "Entrust All Your Matters to Allah",
    "categories": "Depressed",
    "arabic": "يَا حَيُّ يَا قَيُّوْمُ ، بِرَحْمَتِكَ أَسْتَغِيْثُ ، أَصْلِحْ لِيْ شَأْنِيْ كُلَّهُ ، وَلَا تَكِلْنِيْ إِلَىٰ نَفْسِيْ طَرْفَةَ عَيْنٍ.",
    "translation": "O The Ever Living, The Sustainer of all. ; I seek assistance through Your mercy. Rectify all of my affairs and do not entrust me to myself for the blink of an eye.",
    "transliteration": "Yā Ḥayyu yā Qayyūm, bi-raḥmatika astaghīth, aṣliḥ lī sha’nī kullah, wa lā takilnī ilā nafsī ṭarfata ʿayn.",
    "reference": "Anas b. Mālik (raḍiy Allāhu ʿanhu) narrates that the Prophet ﷺ said to Fāṭimah (raḍiy Allāhu ʿanhā), “What is preventing you from (doing) what I am advising you; that you say [the above] in the morning and evening?” (Nasā’ī in ʿAmal al-Yawm wa-l-Laylah 570)",
    "virtue": ""
  },
  {
    "id": 57,
    "title": "Duʿa for Seeking Protection from Shaytan",
    "categories": "Depressed",
    "arabic": "رَبِّ أَعُوْذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِيْنِ ، وَأَعُوذُ بِكَ رَبِّ أَنْ يَّحْضُرُوْنِ",
    "translation": "My Lord, I seek protection with You from the promptings of the devils; and I seek protection in You, my Lord, from their coming near me. (23:97-98)",
    "transliteration": "Rabbi aʿūdhu bika min hamazāti-sh-shayāṭīn. Wa aʿūdhu bika Rabbi ay-yaḥḍurūn.",
    "reference": "",
    "virtue": ""
  },
  {
    "id": 58,
    "title": "Duʿa of Prophet Ayyub ﷺ for Times of Distress",
    "categories": "Depressed",
    "arabic": "-رَبِّ- أَنِّيْ مَسَّنِيَ الضُّرُّ وَأَنْتَ أَرْحَمُ الرّٰحِمِيْنَ",
    "translation": "(My Lord), indeed adversity has touched me, and you are the Most Merciful of the merciful. (21:83)",
    "transliteration": "(Rabbi) Annī massaniya-ḍ-ḍurru wa Anta Arḥamu-r-raḥimīn.",
    "reference": "",
    "virtue": ""
  },
  {
    "id": 59,
    "title": "Protection from Trials, Wretchedness, Bad Fate & the Gloating of Enemies",
    "categories": "Depressed",
    "arabic": "اَللّٰهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنْ جَهْدِ الْبَلَاءِ ، وَدَرَكِ الشَّقَاءِ ، وَسُوْءِ الْقَضَاءِ ، وَشَمَاتَةِ الْأَعْدَاءِ.",
    "translation": "O Allah, I seek Your protection from severe trials, wretchedness, bad fate and that my enemies rejoice in my misery.",
    "transliteration": "Allāhumma innī aʿūdhu bika min jahdi-l-balā’, wa daraki-sh-shaqā’, wa sūi’-l-qaḍā’, wa shamātati-l-aʿdā’.",
    "reference": "Abū Hurayrah (raḍiy Allāhu ‘anhu) narrates that the Messenger of Allah ﷺ used to seek refuge with Allah from [the above]. (Bukhārī 6347)",
    "virtue": ""
  },
  {
    "id": 60,
    "title": "Surah al-Fatihah: The Greatest Duʿa",
    "categories": "Doubtful",
    "arabic": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ ، \nاَلْحَمْدُ لِلّٰهِ رَبِّ الْعَالَمِيْنَ ، الرَّحْمٰنِ الرَّحِيْمِ ، مٰلِكِ يَوْمِ الدِّيْنِ ، إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِيْنُ ، اِهْدِنَا الصِّرَاطَ الْمُسْتَقِيْمَ ، صِرَاطَ الَّذِيْنَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوْبِ عَلَيْهِمْ وَلَا الضَّآلِّيْنَ",
    "translation": "In the name of Allah, the All-Merciful, the Very Merciful. All praises and thanks are for Allah, the Lord of all the worlds, The All-Merciful, The Very Merciful, Master of the Day of Judgement. You Alone we worship, You Alone we ask for help. Guide us on the Straight Path, the path of those whom You have favoured, not of those who incur (Your) anger nor of those who have gone astray. (1:1-7)",
    "transliteration": "Bismi-llāhi-r-Raḥmāni-r-Raḥīm. Alḥamdu-lillāhi Rabbi-l-ʿālamīn, ar-Raḥmāni-r-Raḥīm, Māliki yawmi-d-dīn, iyyāka naʿbudu wa iyyāka nastaʿīn, ihdina-ṣ-Ṣirāṭa-l-Mustaqīm, ṣirāṭa-lladhīna anʿamta ʿalayhim ghayri-l-maghḍūbi ʿālayhim wa la-ḍ-ḍāllīn.",
    "reference": "",
    "virtue": ""
  },
  {
    "id": 61,
    "title": "For Firmness of the Heart",
    "categories": "Doubtful",
    "arabic": "يَا مُقَلِّبَ الْقُلُوْبِ ثَبِّتْ قَلْبِيْ عَلَىٰ دِيْنِكَ",
    "translation": "O Changer of the hearts, make my heart firm upon Your religion.",
    "transliteration": "Yā Muqalliba-l-qulūbi thabbit qalbī ʿalā dīnik.",
    "reference": "Anas (raḍiy Allāhu ‘anhu) said: “The Messenger of Allah ﷺ would often say [the above]. So I asked: ‘O Messenger of Allah, we believe in you and what you have come with, but do you fear for us?’ He replied: ‘Yes. Indeed the hearts are in between the two Fingers of Allah’s Fingers. He changes them as He wills.”’ (Tirmidhī 3522)",
    "virtue": ""
  },
  {
    "id": 62,
    "title": "When One Experiences Doubt in Faith #1",
    "categories": "Doubtful",
    "arabic": "آمَنْتُ بِاللهِ وَرُسُلِهِ",
    "translation": "I believe in Allah and His Messengers.",
    "transliteration": "Āmantu bi-llāhi wa rusulih.",
    "reference": "",
    "virtue": "The Messenger of Allah ﷺ said: “Shaytān comes to one of you and says: ‘Who created you?’ He replies: ‘Allah.’ Then Shaytān says: ‘Who created Allah?’ If that happens to any one of you, let him say [the above]. Indeed it will go away from him.” (Ahmad 25671)\n\nThe Messenger of Allah ﷺ said: “Whoever experiences any of these insinuations should say [the above] thrice, and it will leave him. (Ibn al-Sunnī 629)"
  },
  {
    "id": 63,
    "title": "When One Experiences Doubt in Faith #2",
    "categories": "Doubtful",
    "arabic": "آمَنْتُ بِاللهِ وَرُسُلِهِ",
    "translation": "I believe in Allah and His Messengers.",
    "transliteration": "Āmantu bi-llāhi wa rusulih.",
    "reference": "",
    "virtue": "The Messenger of Allah ﷺ said: “Shaytān comes to one of you and says: ‘Who created you?’ He replies: ‘Allah.’ Then Shaytān says: ‘Who created Allah?’ If that happens to any one of you, let him say [the above]. Indeed it will go away from him.” (Ahmad 25671)\n\nThe Messenger of Allah ﷺ said: “Whoever experiences any of these insinuations should say [the above] thrice, and it will leave him. (Ibn al-Sunnī 629)"
  },
  {
    "id": 64,
    "title": "When One Fears Shirk & Riya'",
    "categories": "Doubtful",
    "arabic": "اَللّٰهُمَّ إِنِّيْ أَعُوْذُ بِكَ أَنْ أُشْرِكَ بِكَ وَأَنَا أَعْلَمُ ، وَأَسْتَغْفِرُكَ لِمَا لَا أَعْلَمُ",
    "translation": "O Allah, I seek Your protection from knowingly committing shirk and seek Your forgiveness for unknowingly (committing it).",
    "transliteration": "Allāhumma innī aʿūdhu bika an ushrika bika wa-ana aʿlam, wa astaghfiruka limā lā aʿlam.",
    "reference": "",
    "virtue": "The Messenger of Allah ﷺ said: “O people, beware of this shirk, for it is more subtle than the footsteps of an ant.” The one whom Allah willed should speak asked him: “How can we beware of it when it is more subtle than the footsteps of an ant, O Messenger of Allah?” He replied: “Say [the above].” (Ahmad 3731)\n\nMa’qil bin Yasār (raḍiy Allāhu ‘anhu) narrated: “I walked with Abū Bakr Siddīq (raḍiy Allāhu ‘anhu) to the Messenger of Allah ﷺ. He ﷺ said: “O Abū Bakr! This shirk is more subtle than the footsteps of an ant.” Abū Bakr asked, “Is shirk not only when a person ascribes a partner with Allah?” The Messenger of Allah ﷺ replied: By the One in whose hands my life is, shirk is more subtle than the footsteps of an ant. Shall I not guide you towards something which if you say, it will remove it’s minor and major? He ﷺ said: “Say [the above].” (Al-Adab al-Mufrad 716)"
  },
  {
    "id": 65,
    "title": "Forgiveness, Anger and Trials",
    "categories": "Doubtful",
    "arabic": "اَللّٰهُمَّ رَبَّ مُحَمَّدٍ اغْفِرْ لِيْ ذَنْبِيْ ، وَأَذْهِبْ غَيْظَ قَلْبِيْ ، وَأَعِذْنِيْ مِنْ مُضِلَّاتِ الْفِتَنِ.",
    "translation": "O Allah, Lord of Muḥammad forgive my sins, remove the anger of my heart and protect me from misleading trials.",
    "transliteration": "Allāhumma Rabba Muḥammad, ighfir lī dhambī, wa adh-hib ghayẓa qalbī, wa aʿidhnī min muḍillāti-l-fitan.",
    "reference": "Muhammad b. Abī Bakr (raḥimahullāh) narrates that when ʿĀ'isha (raḍiy Allāhu ‘anhā) would become angry, the Messenger of Allah ﷺ would stroke her nose and then say (to her): “O ʿUwaysh! Say: [the above].” (Ibn al-Sunnī 456)",
    "virtue": ""
  },
  {
    "id": 66,
    "title": "Unwavering Iman, Blessings & The Prophet’s Company in Paradise",
    "categories": "Doubtful",
    "arabic": "اَللّٰهُمَّ إنِّيْ أَسْأَلُكَ إِيْمَانًا لَّا يَرْتَدُّ ، وَنَعِيْمًا لَّا يَنْفَدُ ، وَمُرَافَقَةَ نَبِيِّنَا مُحَمَّدٍ فِيْ أَعْلَىٰ جَنَّةِ الْخُلْدِ.",
    "translation": "O Allah, I beg you for faith which does not waver, blessings which do not cease, and the company of our Prophet Muhammad ﷺ in the loftiest abode of the Eternal Garden.",
    "transliteration": "Allāhumma innī as’aluka īmāna-l-lā yartad, wa naʿīma-l-lā yanfad, wa murāfaqata Nabiyyanā Muḥammadin fī aʿlā Jannati-l-khuld.",
    "reference": "(Ahmad 4340)",
    "virtue": ""
  },
  {
    "id": 67,
    "title": "The Prophet’s Comprehensive Duʿa After the Battle of Uhud",
    "categories": "Doubtful",
    "arabic": "اَللّٰهُمَّ ابْسُطْ عَلَيْنَا مِنْ بَرَكَاتِكَ وَرَحْمَتِكَ وَفَضْلِكَ وَرِزْقِكَ ، اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَ النَّعِيْمَ الْمُقِيْمَ الَّذِيْ لَا يَحُوْلُ وَلَا يَزُوْلُ ، اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَ النَّعِيْمَ يَوْمَ الْعَيْلَةِ ، وَالْأَمْنَ يَوْمَ الْخَوْفِ ، اَللّٰهُمَّ إِنِّيْ عَائِذٌ بِكَ مِنْ شَرِّ مَا أَعْطَيْتَنَا وَشَرِّ مَا مَنَعْتَنَا ، اَللّٰهُمَّ حَبِّبْ إِلَيْنَا الْإِيْمَانَ وَزَيِّنْهُ فِيْ قُلُوْبِنَا ، وَكَرِّهْ إِلَيْنَا الْكُفْرَ وَالْفُسُوْقَ وَالْعِصْيَانَ ، وَاجْعَلْنَا مِنَ الرَّاشِدِيْنَ ، اَللّٰهُمَّ تَوَفَّنَا مُسْلِمِيْنَ ، وَأَحْيِنَا مُسْلِمِيْنَ ، وَأَلْحِقْنَا بِالصَّالِحِيْنَ ، غَيْرَ خَزَايَا وَلَا مَفْتُوْنِيْنَ ، اَللّٰهُمَّ قَاتِلِ الْكَفَرَةَ الَّذِيْنَ يُكَذِّبُوْنَ رُسُلَكَ ، وَيَصُدُّوْنَ عَنْ سَبِيْلِكَ ، وَاجْعَلْ عَلَيْهِمْ رِجْزَكَ وَعَذَابَكَ ، اَللّٰهُمَّ قَاتِلِ الْكَفَرَةَ الَّذِيْنَ أُوْتُوا الْكِتَابَ ، إِلٰهَ الْحَقِّ.",
    "translation": "O Allah, grant us Your blessings, Your mercy, Your grace and Your sustenance in abundance. O Allah, I beg you for eternal blessings which do not change nor disappear. O Allah, I beg you for blessings on the day of intense need and safety on the day of fear (i.e. Day of Judgement). O Allah, I seek Your protection from the evil of what You have granted us and the evil of what You have withheld from us. O Allah, endear faith to us and beautify it in our hearts. Make disbelief, sins and disobedience hateful to us, and make us of the rightly guided ones. O Allah, grant us death as Muslims, make us live as Muslims and join us with the righteous without being humiliated or tested. O Allah, fight the disbelievers who reject Your Messengers and avert from Your path. Inflict upon them Your punishment and vengeance. O Allah, fight the disbelievers who were given the Book, O the True God.",
    "transliteration": "Allāhumma-b-suṭ ʿalaynā min barakātika wa raḥmatika wa faḍlika wa rizqik, Allāhumma innī as’aluka-n-naʿīmal-muqīma-l-ladhī lā yaḥūlu wa lā yazūl, Allāhumma innī as’aluka-n-naʿīma yawmal-ʿaylah, wa-l-amna yawma-l-khawf, Allāhumma innī ʿā’idhu-m-bika min sharri mā aʿṭaytanā wa sharri mā manaʿtanā, Allāhumma ḥab-bib ilaynal-īmāna wa zay-yinhu fī qulūbinā, wa kar-rih ilayna-l-kufra wal-fusūqa wa-l-ʿiṣyān, waj-ʿalnā mina-r-rāshidīn, Allāhumma tawaf-fanā Muslimīn, wa aḥyinā Muslimīn, wa alḥiqnā bi-ṣ-ṣāliḥīn, ghayra khazāyā wa lā maftūnīn, Allāhumma qātili-l-kafarata-l-ladhīna yukadh-dhibūna rusulak, wa yaṣuddūna ʿan sabīlik, waj-ʿal ʿalayhim rijzaka wa ʿadhābak, Allāhumma qātilil-kafarata-l-ladhīna ūtu-l-kitāb, ilāha-l-ḥaqq.",
    "reference": "Rifā’ah az-Zuraqī (raḍiy Allāhu ‘anhu) narrates: “When it was the day of (the battle of) Uhud and the polytheists retreated, the Messenger of Allah ﷺ said: ‘Arrange yourselves (in rows) so I can praise my Lord.’ So the Companions (radiy Allāhū ‘anhum) stood behind him in rows. Then the Messenger of Allah ﷺ said: “O Allah, for You Alone is all praise. O Allah, none can restrict what You expand and none can expand what You have restricted. None can guide whom You have left astray, and none can mislead whom You have guided. None can give what You withhold, and none can withhold what You bestow. None can bring near what You have distanced and none can distance what You have brought near.” Then he said: [the above].” (Aḥmad 15066)",
    "virtue": ""
  },
  {
    "id": 68,
    "title": "Entrust All Your Matters to Allah",
    "categories": "Doubtful",
    "arabic": "يَا حَيُّ يَا قَيُّوْمُ ، بِرَحْمَتِكَ أَسْتَغِيْثُ ، أَصْلِحْ لِيْ شَأْنِيْ كُلَّهُ ، وَلَا تَكِلْنِيْ إِلَىٰ نَفْسِيْ طَرْفَةَ عَيْنٍ.",
    "translation": "O The Ever Living, The Sustainer of all. ; I seek assistance through Your mercy. Rectify all of my affairs and do not entrust me to myself for the blink of an eye.",
    "transliteration": "Yā Ḥayyu yā Qayyūm, bi-raḥmatika astaghīth, aṣliḥ lī sha’nī kullah, wa lā takilnī ilā nafsī ṭarfata ʿayn.",
    "reference": "Anas b. Mālik (raḍiy Allāhu ʿanhu) narrates that the Prophet ﷺ said to Fāṭimah (raḍiy Allāhu ʿanhā), “What is preventing you from (doing) what I am advising you; that you say [the above] in the morning and evening?” (Nasā’ī in ʿAmal al-Yawm wa-l-Laylah 570)",
    "virtue": ""
  },
  {
    "id": 69,
    "title": "Renewal of Iman",
    "categories": "Doubtful",
    "arabic": "اَللّٰهُمَّ جَدِّدِ الْإِيْمَانَ فِيْ قَلْبِيْ",
    "translation": "O Allah, keep faith rejuvenated in my heart.",
    "transliteration": "Allāhumma jaddidi-l-īmāna fī qalbī.",
    "reference": "ʿAbdullāh b. ʿUmar (radiy Allāhū ‘anhumā) narrates that the Messenger of Allah ﷺ said: “Indeed, īmān (faith) wears out in your hearts the way a piece of cloth wears out. So ask Allah to rejuvenate īmān (faith) in your hearts.” (Hākim 1/4)",
    "virtue": ""
  },
  {
    "id": 70,
    "title": "Steadfastness on Din",
    "categories": "Doubtful",
    "arabic": "يَا مُقَلِّبَ الْقُلُوْبِ ثَبِّتْ قَلْبِيْ عَلَىٰ دِيْنِكَ",
    "translation": "O Allah, Turner of hearts, make my heart firm upon Your religion.",
    "transliteration": "Yā Muqalliba-l-qulūbi thabbit qalbī ʿalā dīnik.",
    "reference": "Shahr bin Hawshab (raḥimahullāh) said: “I said to Umm Salamah (raḍiy Allāhu ‘anhā): ‘O Mother of the Believers! What was the supplication that the Messenger of Allah ﷺ said most frequently when he was with you?” She said: ‘The supplication he said most frequently was: ’[the above]’” She said: ‘So I said: “O Messenger of Allah, why do you supplicate [the above] so frequently [the above]? He said: ‘O Umm Salamah! Verily, there is no human being except that his heart is between Two Fingers of the Fingers of Allah, so whomsoever He wills He makes steadfast, and whomever He wills He causes to deviate.’” (Tirmidhī 3522)",
    "virtue": ""
  },
  {
    "id": 71,
    "title": "Steadfastness on Islam",
    "categories": "Doubtful",
    "arabic": "يَا وَلِيَّ الْإسْلَامِ وَأَهْلِهِ ، ثَبِّتْنِيْ بِهِ حَتَّىٰ أَلْقَاكَ",
    "translation": "O Guardian of Islam and its followers, keep me firm on it (Islam) until I meet You.",
    "transliteration": "Yā Waliyyal-Islāmi wa ahlih, thab-bitnī bihī ḥattā alqāk.",
    "reference": "Anas b. Mālik (raḍiy Allāhu ‘anhu) narrates that the Messenger of Allah ﷺ would say [the above]. (Tabarānī in Mu’jam al-Awsat 653)",
    "virtue": ""
  },
  {
    "id": 72,
    "title": "Guidance & Steadfastness",
    "categories": "Doubtful",
    "arabic": "اَللّٰهُمَّ اهْدِنِيْ وَسَدِّدْنِيْ ، اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَ الْهُدَىٰ وَالسَّدَادَ.",
    "translation": "O Allah, guide me and grant me firmness. O Allah, I beg You for guidance and firmness (on the straight path).",
    "transliteration": "Allāhumma-hdinī wa saddidnī, Allāhumma innī as'aluka-l-hudā wa-s-sadād.",
    "reference": "Ali (raḍiy Allāhu ‘anhu) reported that the Messenger of Allah ﷺ said to him: “Say: [the above] and when you make a mention of guidance, keep in mind the (Straight) Path and when you consider the Straight (Path), keep in mind the straightness of the arrow.” (Muslim 2725)",
    "virtue": ""
  },
  {
    "id": 73,
    "title": "Protection from Shirk & Riya",
    "categories": "Doubtful",
    "arabic": "اَللّٰهُمَّ إِنِّيْ أَعُوْذُ بِكَ أَنْ أُشْرِكَ بِكَ وَأَنَا أَعْلَمُ ، وَأَسْتَغْفِرُكَ لِمَا لَا أَعْلَمُ.",
    "translation": "O Allah, I seek Your protection from knowingly associating partners with You and seek Your forgiveness for unknowingly (doing so).",
    "transliteration": "Allāhumma innī aʿūdhu bika an ushrika bika wa ana aʿlam, wa astaghfiruka limā lā aʿlam.",
    "reference": "",
    "virtue": "The Messenger of Allah ﷺ said: “O people, beware of this shirk, for it is more subtle than the footsteps of an ant.” The one whom Allah willed should speak asked him: “How can we beware of it when it is more subtle than the footsteps of an ant, O Messenger of Allah?” He replied: “Say [the above].” (Ahmad 3731) \n\nMa’qil b. Yasār (raḍiy Allāhu ‘anhu) narrated: “I walked with Abū Bakr Siddīq (raḍiy Allāhu ‘anhu) to the Messenger of Allah ﷺ. He ﷺ said: “O Abū Bakr! This shirk is more subtle than the footsteps of an ant.” Abū Bakr asked, “Is shirk not only when a person ascribes a partner with Allah?” The Messenger of Allah ﷺ replied: By the One in whose hands my life is, shirk is more subtle than the footsteps of an ant. Shall I not guide you towards something which if you say, it will remove it’s minor and major? He ﷺ said: “Say [the above].” (Al-Adab al-Mufrad 716, Ibn al-Sunnī 258)"
  },
  {
    "id": 74,
    "title": "Protection from Evil Traits & Endings",
    "categories": "Doubtful",
    "arabic": "اَللّٰهُمَّ إِنّيْ أَعُوْذُ بِكَ مِنَ الْبُخْلِ ، وَأَعُوْذُ بِكَ مِنَ الْجُبْنِ ، وَأَعُوْذُ بِكَ أَنْ أُرَدَّ إِلَىٰ أَرْذَلِ الْعُمُرِ ، وَأَعُوْذُ بِكَ مِنْ فِتْنَةِ الدُّنْيَا ، وَأَعُوْذُ بِكَ مِنْ عَذَابِ الْقَبْرِ.",
    "translation": "O Allah, I seek Your protection from miserliness and I seek Your protection from cowardice. I seek Your protection from being returned to the worst part of life (old age), I seek Your protection from the trials of the world, and I seek Your protection from the punishment of the grave.",
    "transliteration": "Allāhumma innī aʿūdhu bika mina-l-bukhl, wa aʿūdhu bika mina-l-jubn, wa aʿūdhu bika an uradda ilā ardhali-l-ʿumur, wa aʿūdhu bika min fitnati-d-dunyā, wa aʿūdhu bika min ʿadhābi-l-qabr.",
    "reference": "Saʿd b. Abī Waqqās (radiy Allāhū ‘anhu) would instruct (to seek refuge) about five things [the above] and he would narrate it from the Messenger of Allah ﷺ . (Bukhārī 6370)",
    "virtue": ""
  },
  {
    "id": 75,
    "title": "Surah al-Fatihah: The Greatest Duʿa",
    "categories": "Grateful",
    "arabic": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ ، \nاَلْحَمْدُ لِلّٰهِ رَبِّ الْعَالَمِيْنَ ، الرَّحْمٰنِ الرَّحِيْمِ ، مٰلِكِ يَوْمِ الدِّيْنِ ، إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِيْنُ ، اِهْدِنَا الصِّرَاطَ الْمُسْتَقِيْمَ ، صِرَاطَ الَّذِيْنَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوْبِ عَلَيْهِمْ وَلَا الضَّآلِّيْنَ",
    "translation": "In the name of Allah, the All-Merciful, the Very Merciful. All praises and thanks are for Allah, the Lord of all the worlds, The All-Merciful, The Very Merciful, Master of the Day of Judgement. You Alone we worship, You Alone we ask for help. Guide us on the Straight Path, the path of those whom You have favoured, not of those who incur (Your) anger nor of those who have gone astray. (1:1-7)",
    "transliteration": "Bismi-llāhi-r-Raḥmāni-r-Raḥīm. Alḥamdu-lillāhi Rabbi-l-ʿālamīn, ar-Raḥmāni-r-Raḥīm, Māliki yawmi-d-dīn, iyyāka naʿbudu wa iyyāka nastaʿīn, ihdina-ṣ-Ṣirāṭa-l-Mustaqīm, ṣirāṭa-lladhīna anʿamta ʿalayhim ghayri-l-maghḍūbi ʿālayhim wa la-ḍ-ḍāllīn.",
    "reference": "",
    "virtue": ""
  },
  {
    "id": 76,
    "title": "When Thanking Another Person",
    "categories": "Grateful",
    "arabic": "جَزَاكَ اللَّهُ خَيْرًا",
    "translation": "May Allah reward you with goodness.",
    "transliteration": "Jazāk-Allāhu khayrā.",
    "reference": "Usāmah b. Zayd (raḍiy Allāhu ‘anhu) narrated that the Messenger of Allah ﷺ said: “Whoever is treated well and says [the above] has expressed praise to the fullest. (Tirmidhī 2036)",
    "virtue": ""
  },
  {
    "id": 77,
    "title": "Fulfil Your Obligation to Thank Allah",
    "categories": "Grateful",
    "arabic": "اَللّٰهُمَّ مَا أَمْسَىٰ بِيْ مِنْ نِّعْمَةٍ أَوْ بِأَحَدٍ مِّنْ خَلْقِكَ ، فَمِنْكَ وَحْدَكَ لَا شَرِيْكَ لَكَ ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ.",
    "translation": "O Allah, all the favours that I or anyone from Your creation has received in the evening, are from You Alone. You have no partner. To You Alone belong all praise and all thanks.",
    "transliteration": "Allāhumma mā amsā bī min niʿmatin aw bi-aḥadin min khalqik, fa-minka waḥdaka lā sharīka lak, fa laka-l-ḥamdu wa laka-sh-shukr.",
    "reference": "",
    "virtue": "ʿAbdullāh b. Ghannām (raḍiy Allāhu ʿanhu) narrates that the Messenger of Allah ﷺ said: “Whoever says [the above] in the morning has fulfilled his obligation to thank Allah for that day. And whoever says it in the evening has fulfilled his obligation for that night.” (Abū Dāwūd 5073)"
  },
  {
    "id": 78,
    "title": "Thank Allah for Blessing You",
    "categories": "Grateful",
    "arabic": "اَلْحَمْدُ لِلّٰهِ الَّذِيْ أَطْعَمَنَا وَسَقَانَا ، وَكَفَانَا ، وَآوَانَا ، فَكَمْ مِّمَّنْ لَا كَافِيَ لَهُ وَلَا مُؤْوِيَ.",
    "translation": "All praise is for Allah, Who provided us food and drink and Who sufficed us and has sheltered us; for how many have none to suffice them or shelter them.",
    "transliteration": "Al-ḥamdu li-llāhi-l-ladhī aṭʿamanā wa saqānā, wa kafānā, wa āwānā, fakam-mim-man lā kāfīya lahū walā mu’wiy.",
    "reference": "Anas (raḍiy Allāhu ‘anhu) narrates that when the Messenger of Allah ﷺ would retire to bed, he would say [the above]. (Muslim 2715)",
    "virtue": ""
  },
  {
    "id": 79,
    "title": "Praise Allah With the Praises of the Entire Creation",
    "categories": "Grateful",
    "arabic": "اَلْحَمْدُ لِلّٰهِ الَّذِيْ كَفَانِيْ وَآوَانِيْ ، اَلْحَمْدُ لِلّٰهِ الَّذِيْ أَطْعَمَنِيْ وَسَقَانِيْ ، اَلْحَمْدُ لِلّٰهِ الَّذِيْ مَنَّ عَلَيَّ فَأَفْضَلَ ، اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَ بِعِزَّتِكَ أَنْ تُنَجِّيَنِيْ مِنَ النَّارِ.",
    "translation": "All praise is for Allah Who has sufficed me and given me refuge. All praise is for Allah Who has fed me and given me drink. All praise is for Allah Who has been gracious to me and showered favours on me. O Allah, I ask You by Your Glory, save me from the Hell-Fire. (Ḥākim)",
    "transliteration": "Al-ḥamdu li-llāhi-lladhī kafānī wa āwānī, al-ḥamdu li-llāhi-lladhī aṭʿamanī wa saqānī, al-ḥamdu li-llāhi-l-ladhī manna ʿalayya fa-afḍal, allāhumma innī as’aluka bi ʿizzatika an tunajjiyanī min-an-nār.",
    "reference": "",
    "virtue": "The Messenger of Allah ﷺ said: “Whoever says [the above] when retiring to bed has praised Allah with all the praises of His entire creation.” (Hākim 2001)"
  },
  {
    "id": 80,
    "title": "Praise Allah for All His Favours",
    "categories": "Grateful",
    "arabic": "اَلْحَمْدُ لِلَّهِ الَّذِيْ يُطْعِمُ وَلَا يُطْعَمُ ، مَنَّ عَلَيْنَا فَهَدَانَا وَأَطْعَمَنَا وَسَقَانَا ، وَكُلَّ بَلَاءٍ حَسَنٍ أَبْلَانَا ، اَلْحَمْدُ لِلَّهِ غَيْرَ مُوَدَّعٍ وَّلَا مُكَافَأٍ وَّلَا مَكْفُوْرٍ وَّلَا مُسْتَغْنًى عَنْهُ ، اَلْحَمْدُ لِلَّهِ الَّذِيْ أَطْعَمَ مِنَ الطَّعَامِ ، وَسَقَىٰ مِنَ الشَّرَابِ ، وَكَسَا مِنَ الْعُرْيِ ، وَهَدَىٰ مِنَ الضَّلَالَةِ ، وَبَصَّرَ مِنَ الْعَمَىٰ ، وَفَضَّلَ عَلَىٰ كَثِيْرٍ مِّنْ خَلْقِهِ تَفْضِيْلًا ، اَلْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِيْنَ",
    "translation": "All praise is for Allah who feeds and is not fed. He favoured us, and thus guided us, blessed us with food and drink, and bestowed upon us every favour. All praise is for Allah, a praise which we will never bid farewell to, a never-ending praise, an accepted praise and an indispensable praise. All praise is for Allah who provided food and drink; who clothed us, guided us from error, removed our blindness and favoured us greatly over many of His creation. All praise is for Allah, Lord of the worlds.",
    "transliteration": "Al-ḥamdu lillāhi-lladhī yuṭʿiumu wa lā yuṭʿam, manna ʿalaynā fa-hadānā wa aṭʿamanā wa saqānā, wa kulla balā’in ḥasanin ablānā, al-ḥamdu lillāhi ghayra muwaddaʿin wa lā mukāfa’iw-wa lā makfūrin wa lā mustaghnan ʿanh, al-ḥamdu lillāhi-lladhī aṭʿama mina-ṭ-ṭaʿām, wa saqā mina-sh-sharāb, wa kasā minal-ʿurā, wa hadā mina-ḍ-ḍalālah, wa baṣṣara mina-l-ʿamā, wa faḍḍala ʿalā kathīrim-min-khalqihī tafḍīlā, alḥamdu-lillāhi Rabbi-l-ʿālamīn.",
    "reference": "Abū Hurayrah (raḍiy Allāhu ‘anhu) narrates: “A man from the Anṣār from the people of Qubā invited the Prophet ﷺ for a meal. When he ﷺ had finished eating and had washed his hands, he said [the above].” (Nasā’ī in Sunan al-Kubrā 10060, Ibn Ḥibbān 5219)",
    "virtue": ""
  },
  {
    "id": 81,
    "title": "Duʿa of Prophet Sulayman ﷺ for Gratitude to Allah & Doing Good Deeds",
    "categories": "Grateful",
    "arabic": "رَبِّ أَوْزِعْنِيْٓ أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِيْٓ أَنْعَمْتَ عَلَيَّ وَعَلَىٰ وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ ، وَأَدْخِلْنِيْ بِرَحْمَتِكَ فِيْ عِبَادِكَ الصَّالِحِيْنَ",
    "translation": "My Lord, enable me to be grateful for Your favour which You have bestowed upon me and upon my parents, and to do good deeds that please You. And admit me by Your mercy amongst Your righteous servants. (27:19)",
    "transliteration": "Rabbi awziʿnī an ashkura niʿmataka-l-latī anʿamta ʿalayya wa ʿalā wālidayya wa an aʿmala ṣāliḥan tarḍāh, wa adhkilnī bi-raḥmatika fī ʿibādika-ṣ-ṣāliḥīn.",
    "reference": "",
    "virtue": ""
  },
  {
    "id": 82,
    "title": "A Priceless Treasure",
    "categories": "Grateful",
    "arabic": "اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَ الثَّبَاتَ فِي الْأَمْرِ ، وَالْعَزِيْمَةَ عَلَى الرُّشْدِ ، وَأَسْأَلُكَ مُوْجِبَاتِ رَحْمَتِكَ ، وَعَزَائِمَ مَغْفِرَتِكَ ، وَأَسْأَلُكَ شُكْرَ نِعْمَتِكَ ، وَحُسْنَ عِبَادَتِكَ ، وَأَسْأَلُكَ قَلْبًا سَلِيْمًا ، وَلِسَانًا صَادِقًا ، وَأَسْأَلُكَ مِنْ خَيْرِ مَا تَعْلَمُ ، وَأَعُوْذُ بِكَ مِنْ شَرِّ مَا تَعْلَمُ ، وَأَسْتَغْفِرُكَ لِمَا تَعْلَمُ ، إِنَّكَ أَنْتَ عَلَّامُ الْغُيُوْبِ",
    "translation": "O Allah, I beg you for steadfastness in all matters and the determination to take the right course. I ask You for all that which will necessitate Your mercy and the determination to do all that which will necessitate Your forgiveness. I ask You to make me grateful for Your blessings and to worship You in an excellent manner. I ask You for a sound heart and a truthful tongue. I ask You for the good of what You know, I seek Your protection from the evil of what You know, and I seek Your forgiveness for what You know. Indeed, You are the All-Knowing of the unseen.",
    "transliteration": "Allāhumma innī as’aluka-th-thabāta fil-amr, wa-l-ʿazīmata ʿala-r-rushd, wa as’aluka mūjibāti raḥmatik, wa ʿazā’ima maghfiratik, wa as’aluka shukra niʿmatik, wa ḥusna ʿibādatik, wa as’aluka qalban salīmā, wa lisānan ṣādiqā, wa as’aluka min khayri mā taʿlam, wa aʿūdhu bika min sharri mā taʿlam, wa astaghfiruka limā taʿlam, innaka Anta ʿAllāmul-ghuyūb.",
    "reference": "",
    "virtue": "Shaddād b. Aws (raḍiy Allāhu ‘anhu) narrates that the Messenger of Allah ﷺ was teaching this duā to me. he said: “O Shaddād, when you see people collecting gold & silver as their treasures, then consider [the above] as your treasure.” (Ahmad 17155)"
  },
  {
    "id": 83,
    "title": "Duʿa for Gratitude, Good Deeds & Pious Children",
    "categories": "Grateful",
    "arabic": "رَبِّ أَوْزِعْنِيْٓ أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِيْٓ أَنْعَمْتَ عَلَيَّ وَعَلَىٰ وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ ، وَأَصْلِحْ لِيْ فِيْ ذُرِّيَّتِيْ ، إِنِّيْ تُبْتُ إِلَيْكَ وَإِنِّيْ مِنَ الْمُسْلِمِيْنَ.",
    "translation": "My Lord, enable me to be grateful for Your favour which You have bestowed upon me and upon my parents, and to do good deeds that please You. Make my offspring righteous; I truly repent to you, and truly I am of those who submit to You. (46:15)",
    "transliteration": "Rabbi awziʿnī an ashkura niʿmataka-l-latī anʿamta ʿalayya wa ʿalā wālidayya wa an aʿmala ṣāliḥan tarḍāh, wa aṣliḥ lī fī dhuriyyatī, innī tubtu ilayka wa innī mina-l-muslimīn.",
    "reference": "",
    "virtue": ""
  },
  {
    "id": 84,
    "title": "Becoming A Godly Person",
    "categories": "Grateful",
    "arabic": "رَبِّ أَعِنِّيْ وَلَا تُعِنْ عَلَيَّ ، وَانْصُرْنِيْ وَلَا تَنْصُرْ عَلَيَّ ، وَامْكُرْ لِيْ وَلَا تَمْكُرْ عَلَيَّ ، وَاهْدِنِيْ وَيَسِّرِ الْهُدَىٰ لِيْ ، وَانْصُرْنِيْ عَلَىٰ مَنْ بَغَىٰ عَلَيَّ ، رَبِّ اجْعَلْنِيْ لَكَ شَكَّارًا ، لَكَ ذَكَّارًا ، لَكَ رَهَّابًا ، لَكَ مِطْوَاعًا ، لَكَ مُخْبِتًا ، إِلَيْكَ أَوَّاهًا مُّنِيْبًا ، رَبِّ تَقَبَّلْ تَوْبَتِيْ ، وَاغْسِلْ حَوْبَتِيْ ، وَأَجِبْ دَعْوَتِيْ ، وَثَبِّتْ حُجَّتِيْ ، وَسَدِّدْ لِسَانِيْ ، وَاهْدِ قَلْبِيْ ، وَاسْلُلْ سَخِيْمَةَ صَدْرِيْ",
    "translation": "My Lord, help me and do not help others against me. Grant me victory and do not grant victory to others over me. Plan in my favour and do not plan for others against me. Guide me and ease guidance for me. Help me against those who oppress me. My Lord, make me one who is extremely grateful to You, who remembers you always, who perpetually fears You, who is fully obedient to You, who is humble before You, who constantly cries and pleads with You, and who repeatedly turns to You in repentance. My Lord, accept my repentance, wash away my sins, accept my supplications, strengthen my case, rectify my speech, guide my heart, and remove the malice from my heart.",
    "transliteration": "Rabbi aʿinnī wa lā tuʿin ʿalayya, wan-ṣurnī wa lā tanṣur ʿalayya, wa-mkur lī wa lā tamkur ʿalayya, wa-hdinī wa yas-siri-l-hudā lī, wan-ṣurnī ʿalā ma-m-baghā ʿalayya, Rabbi-j-ʿalnī laka shakkārā, laka dhak- kārā, laka rahhābā, laka miṭwāʿā, laka mukhbitā, ilayka aw-wāha-m-munībā, Rabbi taqabbal tawbatī, wa-ghsil ḥawbatī, wa ajib daʿwatī, wa thab-bit ḥujjatī, wa saddid lisānī, wahdi qalbī, waslul sakhīmata ṣadrī.",
    "reference": "Ibn ʿAbbās (raḍiy Allāhu ‘anhu) narrates that the Messenger of Allah ﷺ would supplicate with [the above]. (Tirmidhī 3551)",
    "virtue": ""
  },
  {
    "id": 85,
    "title": "Protection from Allah’s Anger & Removal of Blessings",
    "categories": "Grateful",
    "arabic": "اَللّٰهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنْ زَوَالِ نِعْمَتِكَ ، وَتَحَوُّلِ عَافِيَتِكَ ، وَفُجَاءَةِ نِقْمَتِكَ ، وَجَمِيْعِ سَخَطِكَ.",
    "translation": "O Allah, I seek Your protection from the loss of Your favours, the removal of Your complete protection, Your sudden punishment and all that which may incur Your displeasure.",
    "transliteration": "Allāhumma innī aʿūdhu bika min zawāli niʿmatik, wa taḥawwuli ʿāfiyatik, wa fujā’ati niqmatik, wa jamīʿi sakhaṭik.",
    "reference": "ʿAbdullah b. ʿUmar (radiy Allāhū ‘anhumā) reported that from the supplication of the Messenger of Allah ﷺ was [the above]. (Muslim 2739, Abū Dāwūd 1545)",
    "virtue": ""
  },
  {
    "id": 86,
    "title": "Protect Yourself From Anxiety, Laziness, Debt etc",
    "categories": "Greedy",
    "arabic": "اَللّٰهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ ، وَأَعُوْذُ بِكَ مِنَ الْعَجْزِ وَالْكَسَلِ، وَأَعُوْذُ بِكَ مِنَ الْجُبْنِ وَالْبُخْلِ ، وَأَعُوْذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ وَقَهْرِ الرِّجَالِ.",
    "translation": "O Allah, I seek Your protection from anxiety and grief. I seek Your protection from inability and laziness. I seek Your protection from cowardice and miserliness, and I seek Your protection from being overcome by debt and being overpowered by men.",
    "transliteration": "Allāhumma innī aʿūdhu bika min-l-hammi wa-l-ḥazan, wa aʿūdhu bika min-l-ʿajzi wa-l-kasal, wa aʿūdhu bika min-l-jubni wa-l-bukhl, wa aʿūdhu bika min ghalabati-d-dayni wa qahri-r-rijāl.",
    "reference": "",
    "virtue": "Abū Saʿīd al-Khudrī (raḍiy Allāhu ʿanhu) narrated that one day, the Messenger of Allah ﷺ entered the masjid. He saw a man from the Anṣār called Abū Umāmah (raḍiy Allāhu ʿanhu). He ﷺ asked, “What is the matter? Why are you sitting in the mosque when it is not the time for prayer?” He replied, “Never-ending worries and debts, O Messenger of Allah.” The Messenger of Allah ﷺ then asked, “Shall I not teach you words by which, when you say them, Allah will remove your worries, and settle your debts?” He replied, “Yes of course, O Messenger of Allah.” He ﷺ said, “Say in the morning and evening [the above].” Abū Umāmah (raḍiy Allāhu ʿanhu) said, “Then I did that, and Allah removed my worries and settled my debts.” (Abū Dāwūd 1555)"
  },
  {
    "id": 87,
    "title": "Contentment & Allah’s Protection",
    "categories": "Greedy",
    "arabic": "اَللّٰهُمَّ قَنِّعْنِيْ بِمَا رَزَقْتَنِيْ ، وَبَارِكْ لِيْ فِيْهِ ، وَاخْلُفْ عَلَيٰ كُلِّ غَائِبَةٍ لِّيْ بِخَيْرٍ",
    "translation": "O Allah, make me content with what You have granted me, bless me in it and be a protector for me in that which is absent from me (i.e. family and wealth).",
    "transliteration": "Allāhumma qanniʿnī bimā razaqtanī, wa bārik lī fīhī, wa-khluf ʿalā kulli ghā’ibati-l-lī bi-khayr.",
    "reference": "Ibn ʿAbbās (radiy Allāhū ‘anhumā) narrates that the Prophet ﷺ would supplicate with [the above]. (Hākim 1/455)",
    "virtue": ""
  },
  {
    "id": 88,
    "title": "Sayyid al-Istighfar: The Best Way of Seeking Forgiveness",
    "categories": "Guilty",
    "arabic": "(سيد الاستغفار) اَللّٰهُمَّ أَنْتَ رَبِّيْ لَا إِلٰهَ إِلَّا أَنْتَ ، خَلَقْتَنِيْ وَأَنَا عَبْدُكَ ، وَأَنَا عَلَىٰ عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ ، أَعُوْذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ ، أَبُوْءُ لَكَ بِنِعْمَتِكَ عَلَيَّ وَأَبُوْءُ بِذَنْبِيْ ، فَاغْفِرْ لِيْ فَإِنَّهُ لَا يَغْفِرُ الذُّنُوْبَ إِلَّا أَنْتَ.",
    "translation": "(Sayyid al-Istighfār) O Allah, You are my Lord. There is no god worthy of worship except You. You have created me, and I am Your slave, and I am under Your covenant and pledge (to fulfil it) to the best of my ability. I seek Your protection from the evil that I have done. I acknowledge the favours that You have bestowed upon me, and I admit my sins. Forgive me, for none forgives sins but You.",
    "transliteration": "Allāhumma Anta Rabbī, lā ilāha illā Ant, khalaqtanī wa ana ʿabduk, wa ana ʿalā ʿahdika wa waʿdika mā’staṭaʿt, aʿūdhu bika min sharri mā ṣanaʿt, abū’u laka bi niʿmatika ʿalayya wa abū’u bidhambī fa-ghfir lī fa-innahū lā yaghfiru-dh-dhunūba illā Ant.",
    "reference": "",
    "virtue": "Shaddād b. Aws (raḍiy Allāhu ʿanhu) narrates that the Messenger of Allah ﷺ said: “The most superior manner of seeking forgiveness is that you say [the above]. Whoever says it during the day with firm belief in it and dies on the same day before the evening, he will be from the people of Paradise. And whoever says it during the night with firm belief in it and dies before the morning, he will be from the people of Paradise.” (Bukhārī 6306)"
  },
  {
    "id": 89,
    "title": "Duʿa of the Grief-stricken Prophet Yunus ﷺ",
    "categories": "Guilty",
    "arabic": "لَآ إِلٰهَ إِلَّآ أَنْتَ سُبْحَانَكَ إِنِّيْ كُنْتُ مِنَ الظَّالِمِيْنَ",
    "translation": "There is no god worthy of worship except You. You are free from imperfection. Indeed, I have been of the wrongdoers. (21:87)",
    "transliteration": "Lā ilāha illā Anta subḥānaka innī kuntu mina-ẓ-ẓālimīn.",
    "reference": "",
    "virtue": ""
  },
  {
    "id": 90,
    "title": "Praising Allah, Forgiveness and Good Character",
    "categories": "Guilty",
    "arabic": "اَللّٰهُمَّ أَنْتَ الْمَلِكُ لَا إِلٰهَ إِلَّا أَنْتَ ، أَنْتَ رَبِّيْ وَأَنَا عَبْدُكَ ، ظَلَمْتُ نَفْسِيْ وَاعْتَرَفْتُ بِذَنْبِيْ ، فَاغْفِرْ لِيْ ذُنُوْبِيْ جَمِيْعًا ، إِنَّهُ لَا يَغْفِرُ الذُّنُوْبَ إِلَّا أَنْتَ ، وَاهْدِنِيْ لِأَحْسَنِ الْأَخْلَاقِ لَا يَهْدِيْ لِأَحْسَنِهَا إِلَّا أَنْتَ ، وَاصْرِفْ عَنِّيْ سَيِّئَهَا لَا يَصْرِفُ عَنِّيْ سَيِّئَهَا إِلَّا أَنْتَ ، لَبَّيْكَ وَسَعْدَيْكَ ، وَالْخَيْرُ كُلُّهُ فِيْ يَدَيْكَ ، وَالشَّرُّ لَيْسَ إِلَيْكَ ، أَنَا بِكَ وَإِلَيْكَ ، تَبَارَكْتَ وَتَعَالَيْتَ ، أَسْتَغْفِرُكَ وَأَتُوْبُ إِلَيْكَ.",
    "translation": "O Allah, You are the King, there is no god worthy of worship except You. You are my Lord and I am Your slave. I have wronged myself and I confess my sins. Forgive all of my sins; indeed no one forgives sins except You. Guide me to the best of character, for no one guides to the best of it except You; and turn the evil of it away from me, for no one turns it away except You. Here I am at Your service, seeking Your pleasure; all good is in Your hands and no evil is attributed to You. I am from You and I am returning to You. You are Most Blessed and You are Most Exalted. I seek Your forgiveness and repent to You.",
    "transliteration": "Allāhumma Antal-Maliku lā ilāha illā Ant, Anta Rabbī wa ana ʿabduk, ẓalamtu nafsī waʿtaraftu bi-dhambī, fa-ghfir lī dhunūbī jamīʿā, innahū lā yaghfiru-dh-dhunūba illā Ant, wa-hdinī li-aḥsani-l-akhlāqi lā yahdī li-aḥsanihā illā Ant, wa-ṣrif ʿannī sayyi’ahā lā yaṣrifu ʿannī sayyi’ahā illā Ant, labbayka wa saʿdayk, wal-khayru kulluhū fī yadayk, wa-sh-sharru laysa ilayk, ana bika wa ilayk, tabārakta wa taʿālayt, astaghfiruka wa atūbu ilayk.",
    "reference": "ʿAlī b. Abī Ṭālib (raḍiy Allāhu ‘anhu) narrates: “When the Messenger of Allah ﷺ would stand for prayer, he would say: \n\nوَجَّهْتُ وَجْهِيَ لِلَّذِي فَطَرَ السَّمَوَاتِ وَالأَرْضَ حَنِيفًا وَمَا أَنَا مِنَ الْمُشْرِكِينَ إِنَّ صَلاَتِي وَنُسُكِي وَمَحْيَاىَ وَمَمَاتِي لِلَّهِ رَبِّ الْعَالَمِينَ لاَ شَرِيكَ لَهُ وَبِذَلِكَ أُمِرْتُ وَأَنَا مِنَ الْمُسْلِمِينَ \n(I have turned my face towards the One who created the heavens and the earth, turned away from all that is false having surrendered to Allah, and I am not of the polytheists. My ṣalāh, my sacrifice, my life and my death are all for Allah, Lord of the worlds, who has no partners. I have been commanded of this, and I am of those who submit.) \n\nHe would then say [the above]. \n\nWhen he would do rukū, he would say: \nاللَّهُمَّ لَكَ رَكَعْتُ وَبِكَ آمَنْتُ وَلَكَ أَسْلَمْتُ خَشَعَ لَكَ سَمْعِي وَبَصَرِي وَمُخِّي وَعَظْمِي وَعَصَبِي \n(O Allah, for You Alone I have bowed in prayer, in You Alone I have believed, and to You Alone I have submitted. My hearing, sight, mind, bones and nerves are humble to You.) \n\nWhen he would raise his head from rukū, he would say: \nاللَّهُمَّ رَبَّنَا لَكَ الْحَمْدُ مِلْءَ السَّمَوَاتِ وَمِلْءَ الأَرْضِ وَمِلْءَ مَا بَيْنَهُمَا وَمِلْءَ مَا شِئْتَ مِنْ شَىْءٍ بَعْدُ \n(O Allah, Our Lord, for You Alone is all praise; praise which fills the heavens, which fills the earth, which fills whatever is in between them, and which fills whatever You wish after that.) \n\nWhen he would do sajdah, he would say: \nاللَّهُمَّ لَكَ سَجَدْتُ وَبِكَ آمَنْتُ وَلَكَ أَسْلَمْتُ سَجَدَ وَجْهِي لِلَّذِي خَلَقَهُ وَصَوَّرَهُ وَشَقَّ سَمْعَهُ وَبَصَرَهُ تَبَارَكَ اللَّهُ أَحْسَنُ الْخَالِقِينَ \n(O Allah, for You Alone I have prostrated, in You Alone I have believed, and to You Alone I have submitted. My face has prostrated to the One who created and fashioned it, and who formed its hearing and sight. Blessed is Allah, the Best of Creators.) \n\nThe last thing he would say after the tashahhud and the salām would be:\nاللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ وَمَا أَسْرَفْتُ وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي أَنْتَ الْمُقَدِّمُ وَأَنْتَ الْمُؤَخِّرُ لاَ إِلَهَ إِلاَّ أَنْتَ \n(O Allah, forgive me for what I have done in the past and for what I am yet to do, for what I have done privately and for what I have done publicly, for my excesses and for that which You know more than me. You are the One who brings forward and the One who puts behind, and there is no god worthy of worship except You.) \n\n(Muslim 771)",
    "virtue": ""
  },
  {
    "id": 91,
    "title": "Duʿa of Prophet Musa ﷺ for Forgiveness",
    "categories": "Guilty",
    "arabic": "أَنْتَ وَلِيُّنَا فَاغْفِرْ لَنَا وَارْحَمْنَا ۖ وَأَنْتَ خَيْرُ الْغَافِرِيْنَ",
    "translation": "You are our Protector, so forgive us and have mercy upon us. You are the best of those who forgive. (7:155)",
    "transliteration": "Anta Walliyyunā fa-ghfir lanā war-ḥamnā wa Anta khayrul-ghāfirīn.",
    "reference": "",
    "virtue": ""
  },
  {
    "id": 92,
    "title": "Comprehensive Forgiveness",
    "categories": "Guilty",
    "arabic": "اَللّٰهُمَّ اغْفِرْ لِيْ خَطِيْئَتِيْ وَجَهْلِيْ وَإِسْرَافِيْ فِيْ أَمْرِيْ ، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّيْ ، اَللّٰهُمَّ اغْفِرْ لِيْ جِدِّيْ وَهَزْلِيْ وَخَطَئِيْ وَعَمْدِيْ وَكُلُّ ذٰلِكَ عِنْدِيْ ، اَللّٰهُمَّ اغْفِرْ لِيْ مَا قَدَّمْتُ وَمَا أَخَّرْتُ ، وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ ، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّـيْ ، أَنْتَ الْمُقَدِّمُ وَأَنْتَ الْمُؤَخِّرُ ، وَأَنْتَ عَلَىٰ كُلِّ شَيْءٍ قَدِيْرٌ.",
    "translation": "O Allah, forgive my mistakes, ignorance, transgression in my matters, and what You are more Knowledgeable of than me. O Allah, forgive me for what I did in earnestness and in jest; unintentionally or intentionally; as I have committed all of these (types of sins). O Allah, forgive me for what I have already done, what I am yet to do, what I did publicly, what I did privately, and what You are more Knowledgeable of than me. You are the One who brings forward and You are the One who defers. You are All-Powerful over everything.",
    "transliteration": "Allāhumma-ghfirlī khaṭī’atī wa jahlī wa isrāfī fī amrī, wa mā Anta aʿlamu bihī minnī, Allāhumma-ghfir lī jiddī wa hazlī wa khaṭa’ī wa ʿamdī wa kullu dhālika ʿindī, Allāhumma-ghfirlī mā qaddamtu wa mā akh-khart, wa mā asrartu wa mā aʿlant, wa mā Anta aʿlamu bihī minnī, Anta-l-Muqaddimu wa Anta-l-Muakh-khir, wa Anta ʿalā kulli shay’in Qadīr.",
    "reference": "Abū Mūsā al-‘Ashʿarī (raḍiy Allāhu ‘anhu) reported from his father that the Messenger of Allah ﷺ would supplicate with [the above]. (Muslim 2719)",
    "virtue": ""
  },
  {
    "id": 93,
    "title": "Protect Yourself From Anxiety, Laziness, Debt etc",
    "categories": "Guilty",
    "arabic": "اَللّٰهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ ، وَأَعُوْذُ بِكَ مِنَ الْعَجْزِ وَالْكَسَلِ، وَأَعُوْذُ بِكَ مِنَ الْجُبْنِ وَالْبُخْلِ ، وَأَعُوْذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ وَقَهْرِ الرِّجَالِ.",
    "translation": "O Allah, I seek Your protection from anxiety and grief. I seek Your protection from inability and laziness. I seek Your protection from cowardice and miserliness, and I seek Your protection from being overcome by debt and being overpowered by men.",
    "transliteration": "Allāhumma innī aʿūdhu bika min-l-hammi wa-l-ḥazan, wa aʿūdhu bika min-l-ʿajzi wa-l-kasal, wa aʿūdhu bika min-l-jubni wa-l-bukhl, wa aʿūdhu bika min ghalabati-d-dayni wa qahri-r-rijāl.",
    "reference": "",
    "virtue": "Abū Saʿīd al-Khudrī (raḍiy Allāhu ʿanhu) narrated that one day, the Messenger of Allah ﷺ entered the masjid. He saw a man from the Anṣār called Abū Umāmah (raḍiy Allāhu ʿanhu). He ﷺ asked, “What is the matter? Why are you sitting in the mosque when it is not the time for prayer?” He replied, “Never-ending worries and debts, O Messenger of Allah.” The Messenger of Allah ﷺ then asked, “Shall I not teach you words by which, when you say them, Allah will remove your worries, and settle your debts?” He replied, “Yes of course, O Messenger of Allah.” He ﷺ said, “Say in the morning and evening [the above].” Abū Umāmah (raḍiy Allāhu ʿanhu) said, “Then I did that, and Allah removed my worries and settled my debts.” (Abū Dāwūd 1555)"
  },
  {
    "id": 94,
    "title": "Duʿa of Prophet Adam ﷺ and Hawwa for Forgiveness",
    "categories": "Guilty",
    "arabic": "رَبَّنَا ظَلَمْنَآ أَنْفُسَنَا وَإِنْ لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُوْنَنَّ مِنَ الْخٰسِرِيْنَ",
    "translation": "Our Lord, we have wronged ourselves. If You do not forgive us and have mercy upon us, we will surely be amongst the losers. (7:23)",
    "transliteration": "Rabbanā ẓalamnā anfusanā wa il-lam taghfir lanā wa tarḥamnā la-nakūnanna minal-khāsīrīn.",
    "reference": "",
    "virtue": ""
  },
  {
    "id": 95,
    "title": "Forgiveness",
    "categories": "Guilty",
    "arabic": "اَللّٰهُمَّ إِنَّكَ عَفُوٌّ كَرِيْمٌ تُحِبُّ الْعَفْوَ فَاعْفُ عَنِّيْ.",
    "translation": "O Allah, You are the Ever-Pardoning, the Generous; You love to pardon so pardon me.",
    "transliteration": "Allāhumma innaka ʿAffuwwun Karīmun tuḥibb-ul-ʿafwa faʿfu ʿannī.",
    "reference": "ʿĀ'isha (raḍiy Allāhu ‘anhā) narrated: “I said: ‘O Messenger of Allah ﷺ, if I know when the Night of al-Qadr is, then what should I say in it?” He said: ‘Say: [the above].'” (Tirmidhī 3513)",
    "virtue": ""
  },
  {
    "id": 96,
    "title": "Duʿa of Prophet Musa ﷺ for Forgiveness",
    "categories": "Guilty",
    "arabic": "أَنْتَ وَلِيُّنَا فَاغْفِرْ لَنَا وَارْحَمْنَا ۖ وَأَنْتَ خَيْرُ الْغَافِرِيْنَ",
    "translation": "You are our Protector, so forgive us and have mercy upon us. You are the best of those who forgive. (7:155)",
    "transliteration": "Anta Walliyyunā fa-ghfir lanā war-ḥamnā wa Anta khayrul-ghāfirīn.",
    "reference": "",
    "virtue": ""
  },
  {
    "id": 97,
    "title": "Forgiveness, Anger and Trials",
    "categories": "Guilty",
    "arabic": "اَللّٰهُمَّ رَبَّ مُحَمَّدٍ اغْفِرْ لِيْ ذَنْبِيْ ، وَأَذْهِبْ غَيْظَ قَلْبِيْ ، وَأَعِذْنِيْ مِنْ مُضِلَّاتِ الْفِتَنِ.",
    "translation": "O Allah, Lord of Muḥammad forgive my sins, remove the anger of my heart and protect me from misleading trials.",
    "transliteration": "Allāhumma Rabba Muḥammad, ighfir lī dhambī, wa adh-hib ghayẓa qalbī, wa aʿidhnī min muḍillāti-l-fitan.",
    "reference": "Muhammad b. Abī Bakr (raḥimahullāh) narrates that when ʿĀ'isha (raḍiy Allāhu ‘anhā) would become angry, the Messenger of Allah ﷺ would stroke her nose and then say (to her): “O ʿUwaysh! Say: [the above].” (Ibn al-Sunnī 456)",
    "virtue": ""
  },
  {
    "id": 98,
    "title": "Duʿa of the Pious for Forgiveness & Protection From the Hell-fire",
    "categories": "Guilty",
    "arabic": "رَبَّنَآ إِنَّنَآ اٰمَنَّا فَاغْفِرْ لَنَا ذُنُوْبَنَا وَقِنَا عَذَابَ النَّارِ",
    "translation": "Our Lord, indeed we have believed, so forgive us our sins and protect us from the punishment of the Fire. (3:16)",
    "transliteration": "Rabbanā in-nanā āmannā fa-ghfir lanā dhunūbanā wa qinā ʿadhāba-n-nār.",
    "reference": "",
    "virtue": ""
  },
  {
    "id": 99,
    "title": "Duʿa of the Slaves of Allah for Forgiveness & Mercy",
    "categories": "Guilty",
    "arabic": "رَبَّنَآ اٰمَنَّا فَاغْفِرْ لَنَا وَارْحَمْنَا وَأَنْتَ خَيْرُ الرّٰحِمِيْنَ",
    "translation": "Our Lord, we have believed, so forgive us and have mercy upon us: You are the Best of those who are merciful. (23:109)",
    "transliteration": "Rabbanā āmannā fa-ghfir lanā war-ḥamnā wa Anta khayru-r-rāḥimīn.",
    "reference": "",
    "virtue": ""
  },
  {
    "id": 100,
    "title": "Acknowledgement of Your Sins, Forgiveness & Mercy",
    "categories": "Guilty",
    "arabic": "اَللّٰهُمَّ إِنّيْ ظَلَمْتُ نَفْسِيْ ظُلْمًا كَثِيْرًا ، وَلَا يَغْفِرُ الذُّنُوْبَ إِلَّا أَنْتَ ، فَاغْفِرْ لِيْ مَغْفِرَةً مِّنْ عِنْدِكَ ، وَارْحَمْنِيْ ، إِنَّكَ أَنْتَ الْغَفُوْرُ الرَّحِيْمُ.",
    "translation": "O Allah, I have wronged myself greatly and no one forgives sins except You; so grant me forgiveness from You and have mercy upon me. You are the Most Forgiving, the Most Merciful.",
    "transliteration": "Allāhumma innī ẓalamtu nafsī ẓulman kathīrā, wa lā yaghfiru-dh-dhunūba illā Ant, fa-ghfir lī maghfirata-m-min ʿindik, war-ḥamnī, innaka Anta-l-Ghafūru-r-Raḥīm.",
    "reference": "Abū Bakr al-Ṣiddīq (raḍiy Allāhu ‘anhu) narrates: “I asked the Messenger of Allah ﷺ to teach me a du’ā so that I may invoke Allah with it in my salāh. He told me to say: [the above].” (Bukhārī 834)",
    "virtue": ""
  },
  {
    "id": 101,
    "title": "Duʿa for Forgiveness & Mercy",
    "categories": "Guilty",
    "arabic": "رَبِّ اغْفِرْ وَارْحَمْ وَأَنْتَ خَيْرُ الرّٰحِمِيْنَ",
    "translation": "My Lord, forgive and have mercy. You are the Best of those who are merciful. (23:118)",
    "transliteration": "Rabbi-ghfir wa-rḥam wa Anta khayru-r-rāḥimīn.",
    "reference": "",
    "virtue": ""
  },
  {
    "id": 102,
    "title": "Forgiveness, Mercy & Guidance",
    "categories": "Guilty",
    "arabic": "اَللّٰهُمَّ اغْفِرْ لِيْ ، وَارْحَمْنِيْ ، وَعَافِنيْ ، وَاهْدِنِيْ وَارْزُقْنِيْ.",
    "translation": "O Allah, forgive me, have mercy on me, grant me wellbeing, guide me and grant me sustenance.",
    "transliteration": "Allāhumma-ghfir lī, war-ḥamnī, wa ʿāfinī, wah-dinī war-zuqnī.",
    "reference": "ʿAbdullāh b. ʿAbbās (radiy Allāhū ‘anhumā): “The Prophet ﷺ used to say [the above] between the two prostrations.” (Abū Dāwūd 850)",
    "virtue": ""
  },
  {
    "id": 103,
    "title": "A Deep Cleansing of Sins",
    "categories": "Guilty",
    "arabic": "اَللّٰهُمَّ بَاعِدْ بَيْنِيْ وَبَيْنَ خَطَايَاىَ كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ ، اللَّهُمَّ نَقِّنِيْ مِنَ الْخَطَايَا كَمَا يُنَقَّى الثَّوْبُ الأَبْيَضُ مِنَ الدَّنَسِ ، اللَّهُمَّ اغْسِلْنِيْ خَطَايَاىَ بِالْمَاءِ وَالثَّلْجِ وَالْبَرَدِ.",
    "translation": "O Allah, distance me from my sins as You have distanced the East from the West. O Allah, purify me from my sins as white cloth is purified from dirt. O Allah, wash away my sins with snow, water and hail.",
    "transliteration": "Allāhumma bāʿid baynī wa bayna khaṭāyāya kamā bāʿadta bayna-l-mashriqi wa-l-maghrib, Allāhumma naq-qinī min khaṭāyāya kamā yunaq-qa-th-thawbul-abyaḍu mina-d-danas, Allāhumma-ghsilnī min khaṭāyāya bil-māi’ wa-th-thalji wal-barad.",
    "reference": "Abū Hurayrah (raḍiy Allāhu ‘anhu) narrates: “The Messenger of Allah ﷺ would pause between the opening takbīr and the recitation. said: ‘May my father and mother be sacrificed for you, the pause between the opening takbir and the recitation, what do you say?’ He replied: ‘I say [the above].’ (Bukhārī 744, Muslim 598)",
    "virtue": ""
  },
  {
    "id": 104,
    "title": "When One is Afraid of People #6",
    "categories": "Guilty",
    "arabic": "اَللّٰهُمَّ اسْتُرْ عَوْرَاتِنَا وَاٰمِنْ رَوْعَاتِنَا",
    "translation": "O Allah, conceal our faults and assuage my fears.",
    "transliteration": "Allāhumma-stur ‘awrātinā wa āmin raw‘ātinā.",
    "reference": "Abū Sa‘īd al-Khuḍrī (raḍiy Allāhu ‘anhu) narrates: “We (the Companions) said on the Day of Khandaq (Trenches): ‘O Messenger of Allah, is there anything we can say? For the hearts have reached the throats (out of fear).’ He ﷺ replied: ‘Yes! (Say) [the above].’ Abū Sa‘īd al-Khuḍrī says: ‘Allah, Mighty and Majestic destroyed the faces of the enemy with wind and Allah made them face defeat through wind.’” (Ahmad 10613)",
    "virtue": ""
  },
  {
    "id": 105,
    "title": "Entrust All Your Matters to Allah",
    "categories": "Guilty",
    "arabic": "يَا حَيُّ يَا قَيُّوْمُ ، بِرَحْمَتِكَ أَسْتَغِيْثُ ، أَصْلِحْ لِيْ شَأْنِيْ كُلَّهُ ، وَلَا تَكِلْنِيْ إِلَىٰ نَفْسِيْ طَرْفَةَ عَيْنٍ.",
    "translation": "O The Ever Living, The Sustainer of all. ; I seek assistance through Your mercy. Rectify all of my affairs and do not entrust me to myself for the blink of an eye.",
    "transliteration": "Yā Ḥayyu yā Qayyūm, bi-raḥmatika astaghīth, aṣliḥ lī sha’nī kullah, wa lā takilnī ilā nafsī ṭarfata ʿayn.",
    "reference": "Anas b. Mālik (raḍiy Allāhu ʿanhu) narrates that the Prophet ﷺ said to Fāṭimah (raḍiy Allāhu ʿanhā), “What is preventing you from (doing) what I am advising you; that you say [the above] in the morning and evening?” (Nasā’ī in ʿAmal al-Yawm wa-l-Laylah 570)",
    "virtue": ""
  },
  {
    "id": 106,
    "title": "Atonement for Hurting Another Muslim",
    "categories": "Guilty",
    "arabic": "اَللّٰهُمَّ فَأَيُّمَا عَبْدٍ مُّؤْمِنٍ سَبَبْتُهُ فَاجْعَلْ ذٰلِكَ لَهُ قُرْبَةً إِلَيْكَ يَوْمَ الْقِيَامَةِ.",
    "translation": "O Allah, any believing servant whom I have cursed, make that a source of nearness to You on the Day of Judgement.",
    "transliteration": "Allāhumma fa-ayyumā ʿabdi-m-mu’minin sababtuhū fa-jʿal dhālika lahū qurbatan ilayka yawma-l-qiyāmah.",
    "reference": "Abū Hurayrah (raḍiy Allāhu ‘anhu) narrates that he heard the Messenger of Allah ﷺ say [the above]. (Muslim 2601) \n\nIn another narration Abū Hurayrah (raḍiy Allāhu ‘anhu) narrates that the Messenger of Allah ﷺ said, “O Allah, I am only a human being. Whenever I scold, curse, or punish a Muslim man, then turn it into purification and mercy for him.” (Bukhārī 6000)",
    "virtue": ""
  },
  {
    "id": 107,
    "title": "When Something Pleases You #1",
    "categories": "Happy",
    "arabic": "اَلْحَمْدُ لِلّٰهِ الَّذِيْ بِنِعْمَتِهِ تَتِمُّ الصَّالِحَاتُ",
    "translation": "All praise is for Allah through whose blessing righteous actions are accomplished.",
    "transliteration": "Al-ḥamdu li-llāh-ladhī bi-niʿmatihī tattimmu-ṣ-ṣāliḥāt.",
    "reference": "When the Messenger of Allah ﷺ saw anything which pleased him, he used to say [the above]. (Ibn Mājah 3803, Ibn al-Sunnī 378)",
    "virtue": ""
  },
  {
    "id": 108,
    "title": "When Something Pleases You #2",
    "categories": "Happy",
    "arabic": "لَبَّيْكَ ، إِنَّ الْعَيْشَ عَيْشُ الْآخِرَةِ",
    "translation": "At Your service (O Allah!), the real life is the life of the Hereafter.",
    "transliteration": "Labbayk, inna-l-‘aysha ‘ayshu-l-ākhirah.",
    "reference": "Anas b. Mālik (raḍiy Allāhu ‘anhu) narrated: “The Messenger of Allah ﷺ went out towards the Khandaq (Trench) and saw the Muhajirīn (Emigrants) and the Ansar (Helpers) digging the trench in the cold morning. They had no slaves to do that (work) for them. When the Prophet ﷺ saw their hardship and hunger, he said, 'O Allah! The real life is the life of the Hereafter, so please forgive Ansar (Helpers) and the Muhajirīn (Emigrants).\" They said in reply to him, \"We are those who have given the Pledge of allegiances to Muhammad to observe Jihād as long as we live.\" (Bukhārī 4099, Muslim 1805)\n\nIbn ‘Abbās (raḍiy Allāhu ‘anhumā) narrated that the Messenger of Allah stood on (the plains of) Arafat and when he said: “Labbayk Allahumma labbayk (At Your service, O Allah, at Your service)”, he said: “Labbayk, innama-l-khayru khayru-l-ākhirah (At Your service (O Allah!), the real goodness is the goodness of the Hereafter).” (Ibn Khuzaymah 4/260)",
    "virtue": ""
  },
  {
    "id": 109,
    "title": "Duʿa of Prophet Yusuf ﷺ for A Good Ending",
    "categories": "Happy",
    "arabic": "-اَللّٰهُمَّ يَا- فَاطِرَ السَّمٰوَاتِ وَالْأَرْضِ ، أَنْتَ وَلِـيِّيْ فِي الدُّنْيَا وَالْآخِرَةِ ، تَوَفَّنِيْ مُسْلِمًا وَّأَلْحِقْنِيْ بِالصَّالِحِيْنَ",
    "translation": "(O Allah), Originator of the heavens and the earth, You are my Protector in this world and in the Hereafter. Make me die a Muslim and join me with the righteous. (12:101)",
    "transliteration": "(Allāhumma yā) Fāṭira-s-samāwāti wa-l-arḍi Anta waliy-yi fi-d-dunyā wal-ākhirah, tawaffanī Muslimaw-wa alḥiqnī bi-ṣ-ṣāliḥīn.",
    "reference": "",
    "virtue": ""
  },
  {
    "id": 110,
    "title": "Protection from Allah’s Anger & Removal of Blessings",
    "categories": "Happy",
    "arabic": "اَللّٰهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنْ زَوَالِ نِعْمَتِكَ ، وَتَحَوُّلِ عَافِيَتِكَ ، وَفُجَاءَةِ نِقْمَتِكَ ، وَجَمِيْعِ سَخَطِكَ.",
    "translation": "O Allah, I seek Your protection from the loss of Your favours, the removal of Your complete protection, Your sudden punishment and all that which may incur Your displeasure.",
    "transliteration": "Allāhumma innī aʿūdhu bika min zawāli niʿmatik, wa taḥawwuli ʿāfiyatik, wa fujā’ati niqmatik, wa jamīʿi sakhaṭik.",
    "reference": "ʿAbdullah b. ʿUmar (radiy Allāhū ‘anhumā) reported that from the supplication of the Messenger of Allah ﷺ was [the above]. (Muslim 2739, Abū Dāwūd 1545)",
    "virtue": ""
  },
  {
    "id": 111,
    "title": "When Difficulties Make You Yearn for Death",
    "categories": "Hurt",
    "arabic": "اَللّٰهُمَّ أَحْيِنِيْ مَا كَانَتِ الْحَيَاةُ خَيْرًا لِيْ ، وَتَوَفَّنِيْ إِذَا كَانَتِ الْوَفَاةُ خَيْرًا لِيْ",
    "translation": "O Allah, let me live as long as life is better for me; and give me death when death is better for me.",
    "transliteration": "Allāhumma aḥyinī mā kānati-l-ḥayātu khayral-lī, wa tawaffanī idhā kānati-l-wafātu khayral-lī.",
    "reference": "The Messenger of Allah ﷺ said: “None of you should wish for death because of a difficulty that befalls him. Rather he should say [the above].” (Bukhārī 5671, Muslim 2680)",
    "virtue": ""
  },
  {
    "id": 112,
    "title": "Protect Yourself From Anxiety, Laziness, Debt etc",
    "categories": "Hurt",
    "arabic": "اَللّٰهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ ، وَأَعُوْذُ بِكَ مِنَ الْعَجْزِ وَالْكَسَلِ، وَأَعُوْذُ بِكَ مِنَ الْجُبْنِ وَالْبُخْلِ ، وَأَعُوْذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ وَقَهْرِ الرِّجَالِ.",
    "translation": "O Allah, I seek Your protection from anxiety and grief. I seek Your protection from inability and laziness. I seek Your protection from cowardice and miserliness, and I seek Your protection from being overcome by debt and being overpowered by men.",
    "transliteration": "Allāhumma innī aʿūdhu bika min-l-hammi wa-l-ḥazan, wa aʿūdhu bika min-l-ʿajzi wa-l-kasal, wa aʿūdhu bika min-l-jubni wa-l-bukhl, wa aʿūdhu bika min ghalabati-d-dayni wa qahri-r-rijāl.",
    "reference": "",
    "virtue": "Abū Saʿīd al-Khudrī (raḍiy Allāhu ʿanhu) narrated that one day, the Messenger of Allah ﷺ entered the masjid. He saw a man from the Anṣār called Abū Umāmah (raḍiy Allāhu ʿanhu). He ﷺ asked, “What is the matter? Why are you sitting in the mosque when it is not the time for prayer?” He replied, “Never-ending worries and debts, O Messenger of Allah.” The Messenger of Allah ﷺ then asked, “Shall I not teach you words by which, when you say them, Allah will remove your worries, and settle your debts?” He replied, “Yes of course, O Messenger of Allah.” He ﷺ said, “Say in the morning and evening [the above].” Abū Umāmah (raḍiy Allāhu ʿanhu) said, “Then I did that, and Allah removed my worries and settled my debts.” (Abū Dāwūd 1555)"
  },
  {
    "id": 113,
    "title": "When Struck by a Calamity",
    "categories": "Hurt",
    "arabic": "إِنَّا لِلّٰهِ وَإِنَّا إِلَيْهِ رَاجِعُوْنَ ، اَللّٰهُمَّ اْجُرْنِيْ فِيْ مُصِيْبَتِيْ ، وَأَخْلِفْ لِيْ خَيْرًا مِنْهَا",
    "translation": "To Allah we belong and unto Him is our return. O Allah, recompense me for my affliction and replace it for me with something better.",
    "transliteration": "Innā lillāhi wa innā ilayhi rājiʿūn, Allāhumma-‘jurnī fī muṣībatī, wa akhlif lī khayram-minha.",
    "reference": "",
    "virtue": "Umm Salamah (raḍiy Allāhu ‘anhā) said: I heard the Messenger of Allah ﷺ say, “There is no Muslim who is afflicted with a calamity, and then says what Allah has commanded him [the above supplication], except that Allah will recompense him with something better than it.” She says: “When Abū Salamah (her first husband) passed away, I said, ‘Which Muslim is better than Abū Salamah – the first household to migrate to the Messenger of Allah?’ I then said (the above duʿā’), and Allah recompensed me (by marrying me to) the Messenger of Allah ﷺ.” (Muslim 918)"
  },
  {
    "id": 114,
    "title": "Well-being in this World and the Hereafter",
    "categories": "Hurt",
    "arabic": "اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَ الْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ ، اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِيْ دِيْنِيْ وَدُنْيَايَ وَأَهْلِيْ وَمَالِيْ ، اَللّٰهُمَّ اسْتُرْ عَوْرَاتِيْ وَآمِنْ رَوْعَاتِيْ ، اَللّٰهُمَّ احْفَظْنِيْ مِنْ بَيْنِ يَدَيَّ ، وَمِنْ خَلْفِيْ ، وَعَنْ يَّمِيْنِيْ ، وَعَنْ شِمَالِيْ ، وَمِنْ فَوْقِيْ ، وَأَعُوْذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِيْ.",
    "translation": "O Allah, I ask You for well-being in this world and the next. O Allah, I ask You for forgiveness and well-being in my religion, in my worldly affairs, in my family and in my wealth. O Allah, conceal my faults and calm my fears. O Allah, guard me from in front of me and behind me, from my right, and from my left, and from above me. I seek protection in Your Greatness from being unexpectedly destroyed from beneath me.",
    "transliteration": "Allāhumma innī as’aluka-l-ʿāfiyata fi-d-dunyā wa-l-ākhirah. Allāhumma innī as’aluka-l-ʿafwa wa-l-ʿāfiyata fī dīnī wa dunyāya wa ahlī wa mālī, Allāhumma-stur ʿawrātī wa āmin rawʿātī. Allāhumma-ḥfaẓnī mim bayni yadayya wa min khalfī, wa ʿay-yamīnī wa ʿan shimālī wa min fawqī, wa aʿūdhu bi-ʿaẓamatika an ughtāla min taḥtī.",
    "reference": "",
    "virtue": "ʿAbdullāh b. ʿUmar (raḍiy Allāhu ʿanhumā) narrated: “The Messenger of Allah ﷺ never failed to say these words in the morning and in the evening.” (Abū Dāwūd 5074)"
  },
  {
    "id": 115,
    "title": "Grief & Anxiety #1",
    "categories": "Hurt",
    "arabic": "اَللّٰهُمَّ إِنِّيْ عَبْدُكَ ، وَابْنُ عَبْدِكَ ، وَابْنُ أَمَتِكَ ، نَاصِيَتِيْ بِيَدِكَ ، مَاضٍ فِيَّ حُكْمُكَ ، عَدْلٌ فِيَّ قَضَاؤُكَ ، أَسْأَلُكَ بِكُلِّ اسْمٍ هُوَ لَكَ ، سَمَّيْتَ بِهِ نَفْسَكَ ، أَوْ عَلَّمْتَهُ أَحَدًا مِنْ خَلْقِكَ ، أَوْ أَنْزَلْتَهُ فِيْ كِتَابِكَ ، أَوِ اسْتَأْثَرْتَ بِهِ فِيْ عِلْمِ الْغَيْبِ عِنْدَكَ ، أَنْ تَجْعَلَ الْقُرْآنَ رَبِيْعَ قَلْبِيْ ، وَنُوْرَ صَدْرِيْ وَجَلَاءَ حُزْنِيْ ، وَذَهَابَ هَمِّيْ",
    "translation": "O Allah, I am Your slave and the son of Your male slave and the son of Your female slave. My forehead is in Your Hand (i.e. you have control over me). I am subject to Your judgement and Your decree concerning me is just. I ask You – by every name that is Yours, by which You have named Yourself, or taught any one of Your creation, or revealed in Your Book, or kept unto Yourself in the knowledge of the unseen that is with You – to make the Qur’ān the spring of my heart, the light of my chest, the banisher of my grief and the reliever of my anxiety.",
    "transliteration": "Allāhumma innī ʿabduk, wa-bnu ʿabdik, wa-bnu amatik, nāṣiyatī bi-yadik, māḍin fiyya ḥukmuk, ʿadlun fiyya qaḍā’uk, as’aluka bi-kulli-smin huwa lak, sammayta bihi nafsak, aw ʿallamtahū aḥadam-min khalqik, aw anzaltahū fī Kitābik, awi-sta’tharta bihī fī ʿilmi-l-ghaybi ʿindak, an tajʿala-l-Qur’āna rabīʿa qalbī, wa nūra ṣadrī wa jalā’a ḥuznī, wa dhahāba hammī.",
    "reference": "",
    "virtue": "The Messenger of Allah ﷺ said: “There is no one amongst you who, when he is stricken with grief and anxiety, says [the above] except that Allah will remove his grief and anxiety, and will give him joy instead.” The companions said, ‘O Messenger of Allah, should we not learn these words?’ He ﷺ replied, ‘Of course! One who hears it should learn it.’” (Ahmad 3712)"
  },
  {
    "id": 116,
    "title": "Grief & Anxiety #2",
    "categories": "Hurt",
    "arabic": "لَا إِلٰهَ إِلَّا اللّٰهُ الْعَظِيْمُ الْحَلِيْمُ ، لَا إِلٰهَ إِلَّا اللّٰهُ رَبُّ الْعَرْشِ الْعَظِيْمِ ، لَا إِلٰهَ إِلَّا اللّٰهُ رَبُّ السَّمٰـوٰتِ وَرَبُّ الْأَرْضِ وَرَبُّ الْعَرْشِ الْكَرِيْمِ",
    "translation": "There is no god but Allah, the Supreme, The Forbearing. There is no god but Allah, Lord of the Magnificent Throne. There is no god but Allah, Lord of the heavens, Lord of the earth, Lord of the Noble Throne.",
    "transliteration": "Lā ilāha illā-llāhu-l-ʿĀẓīmu-l-Ḥalīm, lā ilāha illā-llāhu Rabbu-l-ʿĀrshi-l-ʿAẓīm, lā ilāha illā-llāhu Rabbu-s-samāwāti wa Rabbu-l-arḍi wa Rabbu-l-ʿĀrshi-l-karīm.",
    "reference": "The Messenger of Allah ﷺ would invoke Allah at the time of distress with [the above]. (Bukhārī 6345, Muslim 2730)",
    "virtue": ""
  },
  {
    "id": 117,
    "title": "Allah Will Suffice You in Everything",
    "categories": "Hurt",
    "arabic": "حَسْبِيَ اللّٰهُ لَا إِلٰهَ إِلَّا هُوَ ، عَلَيْهِ تَوَكَّلْتُ ، وَهُوَ رَبُّ الْعَرْشِ الْعَظِيْمِ.",
    "translation": "Allah is sufficient for me. There is no god worthy of worship except Him. I have placed my trust in Him only and He is the Lord of the Magnificent Throne.",
    "transliteration": "Ḥasbiya-Allāhu lā ilāha illā Huwa, ʿalayhi tawakkaltu, wa Huwa Rabbu-l-ʿArshi-l-ʿaẓīm.",
    "reference": "",
    "virtue": "Abū al-Dardā’ (raḍiy Allāhu ʿanhu) narrates from the Messenger of Allah ﷺ that he said: “Whoever recites [the above] seven times in the morning and in the evening, Allah will suffice him in everything that concerns him in matters of this world and the next.” (Ibn al-Sunnī 71)"
  },
  {
    "id": 118,
    "title": "For Difficult Times: All Your Prayers Answered",
    "categories": "Hurt",
    "arabic": "لَآ إِلٰهَ إِلَّآ أَنْتَ سُبْحَانَكَ إِنِّيْ كُنْتُ مِنَ الظَّالِمِيْنَ",
    "translation": "There is no god worthy of worship except You; You are free from all imperfection. Indeed, I have been of the wrongdoers. (21:87)",
    "transliteration": "Lā ilāha illā Anta subḥānaka innī kuntu mina-ẓ-ẓālimīn.",
    "reference": "",
    "virtue": "The Messenger of Allah ﷺ said: “The supplication of Dhun-Nūn (Prophet Yūnus) when he supplicated, while in the belly of the whale was: [the above]. ”No Muslim man ever supplicates with [the above] except that Allah answers his supplication.” (Tirmidhī 3505)"
  },
  {
    "id": 119,
    "title": "When One is Distressed",
    "categories": "Hurt",
    "arabic": "اَللّٰهُمَّ رَحْمَتَكَ أَرْجُوْ فَلَا تَكِلْنِيْ إِلٰى نَفْسِيْ طَرْفَةَ عَيْنٍ ، وَأَصْلِحْ لِي شَأْنِيْ كُلَّهُ لَا إِلٰهَ إِلَّا أَنْتَ",
    "translation": "O Allah! Your Mercy is what I hope for so do not entrust me to myself for the blink of an eye, rectify all of my affairs. There is no god worthy of worship but You.",
    "transliteration": "Allāhumma raḥmataka arjū fa-lā takilnī ilā nafsī ṭarfata ʿayn, wa aṣliḥ lī sha’nī kullah lā ilāha illā Ant.",
    "reference": "The Messenger of Allah ﷺ said: “The supplications for the one who is distressed are [the above].” (Abu Dāwud 5090)",
    "virtue": ""
  },
  {
    "id": 120,
    "title": "Entrust All Your Matters to Allah",
    "categories": "Hurt",
    "arabic": "يَا حَيُّ يَا قَيُّوْمُ ، بِرَحْمَتِكَ أَسْتَغِيْثُ ، أَصْلِحْ لِيْ شَأْنِيْ كُلَّهُ ، وَلَا تَكِلْنِيْ إِلَىٰ نَفْسِيْ طَرْفَةَ عَيْنٍ.",
    "translation": "O The Ever Living, The Sustainer of all. ; I seek assistance through Your mercy. Rectify all of my affairs and do not entrust me to myself for the blink of an eye.",
    "transliteration": "Yā Ḥayyu yā Qayyūm, bi-raḥmatika astaghīth, aṣliḥ lī sha’nī kullah, wa lā takilnī ilā nafsī ṭarfata ʿayn.",
    "reference": "Anas b. Mālik (raḍiy Allāhu ʿanhu) narrates that the Prophet ﷺ said to Fāṭimah (raḍiy Allāhu ʿanhā), “What is preventing you from (doing) what I am advising you; that you say [the above] in the morning and evening?” (Nasā’ī in ʿAmal al-Yawm wa-l-Laylah 570)",
    "virtue": ""
  },
  {
    "id": 121,
    "title": "A Comprehensive Duʿa",
    "categories": "Hurt",
    "arabic": "اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَ خَيْرَ الْمَسْأَلَةِ ، وَخَيْرَ الدُّعَاءِ ، وَخَيْرَ النَّجَاحِ ، وَخَيْرَ الْعَمَلِ ، وَخَيْرَ الثَّوَابِ ، وَخَيْرَ الْحَيَاةِ ، وَخَيْرَ الْمَمَاتِ ، وَثَبِّتْنِيْ ، وَثَقِّلْ مَوَازِيْنِيْ ، وَحَقِّقْ إِيْمَانِيْ ، وَارْفَعْ دَرَجَاتِيْ ، وَتَقَبَّلْ صَلَاتِيْ ، وَاغْفِرْ خَطِيْئَتِيْ ، وَأَسْأَلُكَ الدَّرَجَاتِ الْعُلَا مِنَ الْجَنَّةِ ، اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَ فَوَاتِحَ الْخَيْرِ ، وَخَوَاتِمَهُ ، وَجَوَامِعَهُ ، وَأَوَّلَهُ ، وَظَاهِرَهُ ، وَبَاطِنَهُ ، وَالدَّرَجَاتِ الْعُلَا مِنَ الْجَنَّةِ آمِيْن ، اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَ خَيْرَ مَا آتِيْ ، وَخَيْرَ مَا أَفْعَلُ ، وَخَيْرَ مَا أَعْمَلُ ، وَخَيْرَ مَا بَطَنَ ، وَخَيْرَ مَا ظَهَرَ ، وَالدَّرَجَاتِ الْعُلَا مِنَ الْجَنَّةِ آمِيْن ، اَللّٰهُمَّ إنِّيْ أَسْأَلُكَ أنْ تَرْفَعَ ذِكْرِيْ ، وَتَضَعَ وِزْرِيْ ، وَتُصْلِحَ أَمْرِيْ ، وَتُطَهِّرَ قَلْبِيْ ، وَتُحَصِّنَ فَرْجِيْ ، وَتُنَوِّرَ لِيْ قَلْبِيْ ، وَتَغْفِرَ لِيْ ذَنْبِيْ ، وَأَسْأَلُكَ الدَّرَجَاتِ الْعُلَا مِنَ الْجَنَّةِ آمِيْن ، اَللّٰهُمَّ إنِّيْ أَسْأَلُكَ أنْ تُبَارِكَ لِيْ فِيْ نَفْسِيْ ، وَفِيْ سَمْعِيْ ، وَفِيْ بَصَرِيْ ، وَفِيْ رُوْحِيْ ، وَفِيْ خَلْقِيْ ، وَفِيْ خُلُقِيْ ، وَفِيْ أَهْلِيْ ، وَفِيْ مَحْيَايَ ، وَفِيْ مَمَاتِيْ ، وَفِيْ عَمَلِيْ ، فَتَقَبَّلْ حَسَنَاتِيْ ، وَأَسْأَلُكَ الدَّرَجَاتِ الْعُلَا مِنَ الْجَنَّةِ ، آمِيْن",
    "translation": "O Allah, I beg You for the best of what can be asked for, the best supplication, the ultimate success, the best deeds, the best reward, the best life, and the best death. Keep me steadfast, make my scales heavy, establish my belief, elevate my ranks, accept my salāh, forgive my sins and I ask You for lofty ranks in Paradise. O Allah, I beg you for good beginnings, good endings, good in its entirety, its first, its apparent and its hidden; and lofty ranks in Paradise. Āmīn. O Allah, I beg you for the best of what I can do, perform and accomplish, the best of what is hidden or apparent; and lofty ranks in Paradise. Āmīn. O Allah, I beg you to elevate my mention, remove my burden, rectify my affairs, purify my heart, protect my chastity, enlighten my heart, forgive my sins and I ask You for lofty ranks in Paradise. Āmīn. O Allah, I beg you to bless for me my inner self, my hearing, my sight, my soul, my appearance, my character, my family, my life, my death and my deeds. Accept my good deeds and I ask You for lofty ranks in Paradise. Āmīn.",
    "transliteration": "Allāhumma innī as’aluka khayra-l-mas’alah, wa khayra-d-duʿā’, wa khayra-n-najaḥ, wa khayra-l-ʿamal, wa khayra-th-thawāb, wa khayra-l-ḥayāh, wa khayra-l-mamāt, wa thabbitnī, wa thaqqil mawāzīnī, wa ḥaqqiq īmānī, wa-r-faʿ darajātī, wa taqabbal ṣalātī, wa-ghfir khaṭī’atī, wa as’aluka-d-darajāti-l-ʿulā mina-l-Jannah, Allāhumma innī as’aluka fawātiḥa-l-khayr, wa khawātimah, wa jawāmiʿah, wa awwalah, wa ẓāhirah, wa bāṭinah, wa-d-darajāti-l-ʿulā mina-l-Jannati āmīn, Allāhumma innī as’aluka khayra mā ātī, wa khayra mā afʿal, wa khayra mā aʿmal, wa khayra mā baṭan, wa khayra mā ẓahar, wa-d-darajāti-l-ʿulā mina-l-Jannati, āmīn, Allāhumma innī as’aluka an tarfaʿa dhikrī, wa taḍaʿa wizrī, wa tuṣliḥa amrī, wa tuṭahhira qalbī, wa tuḥaṣṣina farjī, wa tunawwira lī qalbī, wa taghfira lī dhambī, wa as’aluka-d-darajāti-l-ʿulā mina-l-Jannati, āmīn, Allāhumma innī as’aluka an tubārika lī fī nafsī, wa fī samʿī, wa fī baṣarī, wa fī rūḥī, wa fī khalqī, wa fī khuluqī, wa fī ahlī, wa fī maḥyāya, wa fī mamātī, wa fi ʿamalī, fa-taqabbal ḥasanātī, wa as’aluka-d-darajāti-l-ʿulā mina-l-Jannati, āmīn.",
    "reference": "Umm Salamah (raḍiy Allāhu ‘anhā) narrates that the Prophet ﷺ said: “This is what Muhammad asks from His Lord: [the above].”(Hākim 1867)",
    "virtue": ""
  },
  {
    "id": 122,
    "title": "Guidance & Protection from Evil",
    "categories": "Hurt",
    "arabic": "اَللّٰهُمَّ أَلْهِمْنِيْ رُشْدِيْ ، وَأَعِذْنِيْ مِنْ شَرِّ نَفْسِيْ.",
    "translation": "O Allah, inspire me with sound guidance and protect me from the evil of my self.",
    "transliteration": "Allāhumma alhimnī rushdī, wa aʿidhnī min sharri nafsī.",
    "reference": "",
    "virtue": "ʿImrān b. Husayn (raḍiy Allāhu ‘anhu) narrated: “The Prophet ﷺ said to my father: ‘O Husayn, how many deities do you worship now?‘ He said: ‘Seven. Six in the earth, and one above the heavens.’ He ﷺ said: ‘So which of them do you take for your ardent requests and fears?’ He said: ‘The one above the heavens.’ He ﷺ said: ‘O Husayn, if you accept Islam, I would teach you two phrases that would benefit you.’” He (the narrator) said: “So when Husayn accepted Islam, he said: ‘O Messenger of Allah, teach me the two phrases you promised me.’ So he ﷺ said: [the above].” (Tirmidhī 3483)"
  },
  {
    "id": 123,
    "title": "Protection from Hunger & Treachery",
    "categories": "Hurt",
    "arabic": "اَللّٰهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنَ الْجُوْعِ ، فَإِنَّهُ بِئْسَ الضَّجِيْعُ ، وَأَعُوْذُ بِكَ مِنَ الْخِيَانَةِ ، فَإِنَّهَا بِئْسَتِ الْبِطَانَةُ.",
    "translation": "O Allah, I seek Your protection from hunger, as it is indeed an evil companion and I seek Your protection from treachery, as it is an evil confidante.",
    "transliteration": "Allāhumma innī aʿūdhu bika mina-l-jūʿ, fa-innahū bi’sa-ḍ-ḍajīʿ, wa aʿūdhu bika mina-l-khiyānah, fa-innahā bi’sati-l-biṭānah.",
    "reference": "‘Urwah b. Maymūn said: “I heard ‘Umar b. Al-Khaṭṭab (raḍiy Allāhu ‘anhu) say: ‘The Messenger of Allah ﷺ used to seek refuge with Allah from five things and say: [the above].'” (Nasā’ī 5483)",
    "virtue": ""
  },
  {
    "id": 124,
    "title": "Protection from Bad Neighbours & Family Members",
    "categories": "Hurt",
    "arabic": "اَللّٰهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنْ جَارِ السُّوْءِ ، وَمِنْ زَوْجٍ تُشَيِّبُنِيْ قَبْلَ المَشِيْبِ ، وَمِنْ وَّلَدٍ يَّكُوْنُ عَليَّ رَبًّا ، وَمِنْ مَّالٍ يَّكُوْنُ عَلَيَّ عَذَابًا ، وَمِنْ خَلِيْلٍ مَّاكِرٍ عَيْنُهُ تَرَانِيْ ، وَقَلْبُهُ يَرْعَانِيْ ، إِنْ رَأَىٰ حَسَنَةً دَفَنَهَا ، وَإِذَا رَأَىٰ سَيِّئَةً أَذَاعَهَا.",
    "translation": "O Allah, I seek Your protection from an evil neighbour; from a spouse who will age me ahead of time; from a child who will rule over me; from wealth that will become a punishment for me; from a cunning friend whose eyes see me yet his heart keeps guard over me: if he sees any good, he conceals it and if he sees any bad, he announces it.",
    "transliteration": "Allāhumma innī aʿūdhu bika min jāri-s-sū’, wa min zawjin tushayyibunī qabla-l-mashīb, wa min waladi-y-yakūnu ʿalayya rabbā, wa mi-m-māli-y-yakūnu ʿalayya ʿadhābā, wa min khalīli-m-mākir, ʿaynuhu tarānī, wa qalbuhū yarʿānī, ir-ra’ā ḥasanatan dafanahā wa idhā ra’ā sayyi’atan adhāʿahā.",
    "reference": "Abū Hurayrah (raḍiy Allāhu ‘anhu) narrates that [the above] was from the supplication of the Messenger of Allah ﷺ. (Tabarānī in al-Du’ā 1339)",
    "virtue": ""
  },
  {
    "id": 125,
    "title": "Unity, Guidance & Repentance",
    "categories": "Hurt",
    "arabic": "اَللّٰهُمَّ أَلِّفْ بَيْنَ قُلُوْبِنَا ، وَأَصْلِحْ ذَاتَ بَيْنِنَا ، وَاهْدِنَا سُبُلَ السَّلَامِ ، وَنَجِّنَا مِنَ الظُّلُمَاتِ إِلَى النُّوْرِ ، وَجَنِّبْنَا الْفَوَاحِشَ مَا ظَهَرَ مِنْهَا وَمَا بَطَنَ ، وَبَارِكْ لَنَا فِيْ أَسْمَاعِنَا ، وَأَبْصَارِنَا ، وَقُلُوْبِنَا ، وَأَزْوَاجِنَا ، وَذُرِّيَّاتِنَا ، وَتُبْ عَلَيْنَا إِنَّكَ أَنْتَ التَّوَّابُ الرَّحِيْمُ ، وَاجْعَلْنَا شَاكِرِيْنَ لِنِعَمِكَ مُثْنِيْنَ بِهَا عَلَيْكَ ، قَابِلِيْنَ لَهَا ، وَأَتِمِمْهَا عَلَيْنَا.",
    "translation": "O Allah, unite our hearts, set aright our relationships, and guide us to the paths of peace. Bring us out of darknesses into light and protect us from evident and hidden obscenities. Bless us in our hearing, our sight, our hearts, our spouses and our children. Accept our repentance. Indeed, You truly are the Acceptor of repentance, the Ever-Merciful. Make us of those who are grateful for Your blessings, who praise You for them and acknowledge them. Perfect (the blessings) and make them last forever for us.",
    "transliteration": "Allāhumma allif bayna qulūbinā, wa aṣliḥ dhāta bayninā, wa-hdinā subula-s-sālām, wa najjinā mina-ẓ-ẓulumāti ila-n-nūr, wa jannibna-l-fawāḥisha mā ẓahara minhā wa mā baṭan, wa bārik lanā fī asmāʿinā, wa abṣārinā, wa qulūbinā, wa azwājinā, wa dhurriyyātinā, wa tub ʿalaynā innaka Anta-t-Tawwābu-r-Raḥīm, wa-jʿalnā shākirīna li-niʿamik muthnīna bihā ʿalayk, qābilīna lahā, wa atmimhā ʿalaynā.",
    "reference": "Ibn Mas’ūd (raḍiy Allāhu ‘anhu) narrates that the Messenger of Allah ﷺ said [the above]. (Hākim 977)",
    "virtue": ""
  },
  {
    "id": 126,
    "title": "Istikharah (Seeking Allah's Help in Making a Decision)",
    "categories": "Indecisive",
    "arabic": "اَللّٰهُمَّ إِنِّيْ أَسْتَخِيْرُكَ بِعِلْمِكَ ، وَأَسْتَقْدِرُكَ بِقُدْرَتِكَ ، وَأَسْأَلُكَ مِنْ فَضْلِكَ الْعَظِيْمِ ، فَإِنَّكَ تَقْدِرُ وَلَا أَقْدِرُ ، وَتَعْلَمُ وَلَا أَعْلَمُ ، وَأَنْتَ عَلَّامُ الْغُيُوْبِ . اَللّٰهُمَّ إِنْ كُنْتَ تَعْلَمُ أَنَّ هٰذَا الْأَمْرَ (وَيُسَمِّي حَاجَتَه) خَيْرٌ لِّيْ فِيْ دِيْنِيْ وَمَعَاشِيْ وَعَاقِبَةِ أَمْرِيْ ، فَاقْدُرْهُ لِيْ وَيَسِّرْهُ لِيْ ثُمَّ بَارِكْ لِيْ فِيْهِ ، وَإِنْ كُنْتَ تَعْلَمُ أَنَّ هٰذَا الْأَمْرَ (وَيُسَمِّي حَاجَتَه) شَرٌّ لِّيْ فِيْ دِيْنِيْ وَمَعَاشِيْ وَعَاقِبَةِ أَمْرِيْ ، فَاصْرِفْهُ عَنِّيْ وَاصْرِفْنِيْ عَنْهُ وَاقْدُرْ لِيَ الْخَيْرَ حَيْثُ كَانَ ثُمَّ أَرْضِنِيْ بِهِ",
    "translation": "O Allah, I ask you for the best through Your knowledge, I seek strength through Your power, and I ask You from Your majestic benevolence. For You are fully able whilst I am not, You know everything whilst I do not know anything, and You are the Knower of the unseen. O Allah, if in Your knowledge, this matter (specify the matter) is good for me in my religion, my livelihood and my ultimate destiny, then decree it for me and make it easy it for me, then bless it for me. But if in your knowledge, this matter (specify the matter) is bad for me in my religion, my livelihood and my ultimate destiny, then turn it away from me, and turn me away from it and decree good for me wherever it may be, then make me pleased with it.",
    "transliteration": "Allāhumma innī astakhīruka bi ʿilmik, wa astaqdiruka bi qudratik, wa as’aluka min faḍlika-l-ʿaẓīm, fa innaka taqdiru wa lā aqdir, wa taʿlamu wa lā aʿlam, wa Anta ʿAllāmu-l-ghuyūb. Allāhumma in kunta taʿlamu an-na hādha-l-amra khayrul-lī fī dīnī wa maʿāshī wa ʿāqibati amrī, faqdurhu lī wa yassirhu lī thumma bārik lī fīhī, wa in kunta taʿlamu anna hādha-l-amra sharrul-lī fī dīnī wa maʿāshī wa ʿāqibati amrī, faṣrifhu ʿannī waṣrifnī ʿanhu waqdur liya-l-khayra ḥaythu kāna thumma arḍinī bih.",
    "reference": "Jābir (raḍiy Allāhu ‘anhu) narrated: “The Messenger of Allah ﷺ used to teach us istikhārah (when one seeks Allah’s help in making a decision) for all matters, the same way he taught us Sūrahs from the Qur’ān. He ﷺ said: “When one of you intends to do something, he should offer two rak‘ahs of voluntary Salāh, and then say [the above].” (Bukhārī 1162) \n\nIbn Abī Jamrah (raḥimahullāh) said: ‘The wisdom of preceding Salāh before the du‘ā’ is that the purpose of istikhārah is to combine the good of this world and the Hereafter. A person needs to knock at the door of the King (Allah), and there is nothing more effective for this than salāh, because it combines the glorification and praise of Allah, and expresses one’s need for Him at all times. (Fath al-Bārī)",
    "virtue": ""
  },
  {
    "id": 127,
    "title": "When One Feels Frightened",
    "categories": "Indecisive",
    "arabic": "لَا إِلٰهَ إِلَّا اللّٰهُ",
    "translation": "There is no god but Allah.",
    "transliteration": "Lā ilāha illā-llāh.",
    "reference": "Zaynab bint Jaḥsh (raḍiy Allāhu ʿanhā) said that the Messenger of Allah ﷺ once came to her in a state of fear and said, [the above] Woe unto the Arabs from a danger that has come near. An opening has been made in the wall of Yājūj and Mājūj like this, making a circle with his thumb and index finger. Zaynab bint Jaḥsh said, “O Messenger of Allah ﷺ! Shall we be destroyed even though there are pious persons among us?” He said, “Yes, when evil (people) will increase.” (Bukhārī 3346)",
    "virtue": ""
  },
  {
    "id": 128,
    "title": "Entrust All Your Matters to Allah",
    "categories": "Indecisive",
    "arabic": "يَا حَيُّ يَا قَيُّوْمُ ، بِرَحْمَتِكَ أَسْتَغِيْثُ ، أَصْلِحْ لِيْ شَأْنِيْ كُلَّهُ ، وَلَا تَكِلْنِيْ إِلَىٰ نَفْسِيْ طَرْفَةَ عَيْنٍ.",
    "translation": "O The Ever Living, The Sustainer of all. ; I seek assistance through Your mercy. Rectify all of my affairs and do not entrust me to myself for the blink of an eye.",
    "transliteration": "Yā Ḥayyu yā Qayyūm, bi-raḥmatika astaghīth, aṣliḥ lī sha’nī kullah, wa lā takilnī ilā nafsī ṭarfata ʿayn.",
    "reference": "Anas b. Mālik (raḍiy Allāhu ʿanhu) narrates that the Prophet ﷺ said to Fāṭimah (raḍiy Allāhu ʿanhā), “What is preventing you from (doing) what I am advising you; that you say [the above] in the morning and evening?” (Nasā’ī in ʿAmal al-Yawm wa-l-Laylah 570)",
    "virtue": ""
  },
  {
    "id": 129,
    "title": "Steadfastness on Din",
    "categories": "Indecisive",
    "arabic": "يَا مُقَلِّبَ الْقُلُوْبِ ثَبِّتْ قَلْبِيْ عَلَىٰ دِيْنِكَ",
    "translation": "O Allah, Turner of hearts, make my heart firm upon Your religion.",
    "transliteration": "Yā Muqalliba-l-qulūbi thabbit qalbī ʿalā dīnik.",
    "reference": "Shahr bin Hawshab (raḥimahullāh) said: “I said to Umm Salamah (raḍiy Allāhu ‘anhā): ‘O Mother of the Believers! What was the supplication that the Messenger of Allah ﷺ said most frequently when he was with you?” She said: ‘The supplication he said most frequently was: ’[the above]’” She said: ‘So I said: “O Messenger of Allah, why do you supplicate [the above] so frequently [the above]? He said: ‘O Umm Salamah! Verily, there is no human being except that his heart is between Two Fingers of the Fingers of Allah, so whomsoever He wills He makes steadfast, and whomever He wills He causes to deviate.’” (Tirmidhī 3522)",
    "virtue": ""
  },
  {
    "id": 130,
    "title": "Steadfastness on Islam",
    "categories": "Indecisive",
    "arabic": "يَا وَلِيَّ الْإسْلَامِ وَأَهْلِهِ ، ثَبِّتْنِيْ بِهِ حَتَّىٰ أَلْقَاكَ",
    "translation": "O Guardian of Islam and its followers, keep me firm on it (Islam) until I meet You.",
    "transliteration": "Yā Waliyyal-Islāmi wa ahlih, thab-bitnī bihī ḥattā alqāk.",
    "reference": "Anas b. Mālik (raḍiy Allāhu ‘anhu) narrates that the Messenger of Allah ﷺ would say [the above]. (Tabarānī in Mu’jam al-Awsat 653)",
    "virtue": ""
  },
  {
    "id": 131,
    "title": "Best Outcomes & Protection from Humiliation",
    "categories": "Indecisive",
    "arabic": "اَللّٰهُمَّ أَحْسِنْ عَاقِبَتَنَا فِي الْأُمُوْرِ كُلِّهَا ، وَأَجِرْنَا مِنْ خِزْيِ الدُّنْيَا وَعَذَابِ الْآخِرَةِ",
    "translation": "O Allah, grant us the best outcome in all of our affairs, and protect us from the humiliation of this world and the punishment of the hereafter.",
    "transliteration": "Allāhumma aḥsin ʿāqibatanā fi-l-umūri kullihā, wa ajirnā min khizyi-d-dunyā wa ʿadhābi-l-ākhirah.",
    "reference": "Busr b. Abī Artāt (raḍiy Allāhu ‘anhu) narrates that I heard the Messenger of Allah ﷺ supplicate with [the above]. (Aḥmad 17628)",
    "virtue": ""
  },
  {
    "id": 132,
    "title": "A Priceless Treasure",
    "categories": "Indecisive",
    "arabic": "اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَ الثَّبَاتَ فِي الْأَمْرِ ، وَالْعَزِيْمَةَ عَلَى الرُّشْدِ ، وَأَسْأَلُكَ مُوْجِبَاتِ رَحْمَتِكَ ، وَعَزَائِمَ مَغْفِرَتِكَ ، وَأَسْأَلُكَ شُكْرَ نِعْمَتِكَ ، وَحُسْنَ عِبَادَتِكَ ، وَأَسْأَلُكَ قَلْبًا سَلِيْمًا ، وَلِسَانًا صَادِقًا ، وَأَسْأَلُكَ مِنْ خَيْرِ مَا تَعْلَمُ ، وَأَعُوْذُ بِكَ مِنْ شَرِّ مَا تَعْلَمُ ، وَأَسْتَغْفِرُكَ لِمَا تَعْلَمُ ، إِنَّكَ أَنْتَ عَلَّامُ الْغُيُوْبِ",
    "translation": "O Allah, I beg you for steadfastness in all matters and the determination to take the right course. I ask You for all that which will necessitate Your mercy and the determination to do all that which will necessitate Your forgiveness. I ask You to make me grateful for Your blessings and to worship You in an excellent manner. I ask You for a sound heart and a truthful tongue. I ask You for the good of what You know, I seek Your protection from the evil of what You know, and I seek Your forgiveness for what You know. Indeed, You are the All-Knowing of the unseen.",
    "transliteration": "Allāhumma innī as’aluka-th-thabāta fil-amr, wa-l-ʿazīmata ʿala-r-rushd, wa as’aluka mūjibāti raḥmatik, wa ʿazā’ima maghfiratik, wa as’aluka shukra niʿmatik, wa ḥusna ʿibādatik, wa as’aluka qalban salīmā, wa lisānan ṣādiqā, wa as’aluka min khayri mā taʿlam, wa aʿūdhu bika min sharri mā taʿlam, wa astaghfiruka limā taʿlam, innaka Anta ʿAllāmul-ghuyūb.",
    "reference": "",
    "virtue": "Shaddād b. Aws (raḍiy Allāhu ‘anhu) narrates that the Messenger of Allah ﷺ was teaching this duā to me. he said: “O Shaddād, when you see people collecting gold & silver as their treasures, then consider [the above] as your treasure.” (Ahmad 17155)"
  },
  {
    "id": 133,
    "title": "Asking for Good & Protection From Evil",
    "categories": "Indecisive",
    "arabic": "اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَ مِنَ الْخَيْرِ كُلِّهِ عَاجِلِهِ وَآجِلِهِ ، مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ ، وَأَعُوْذُ بِكَ مِنَ الشَّرِّ كُلِّهِ عَاجِلِهِ وَآجِلِهِ ، مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ ، اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَ مِنْ خَيْرِ مَا سَأَلَكَ عَبْدُكَ وَنَبِيُّكَ ، وَأَعُوْذُ بِكَ مِنْ شَرِّ مَا عَاذَ مِنْهُ عَبْدُكَ وَنَبِيُّكَ ، اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَ الْجَنَّةَ ، وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ ، وَأَعُوْذُ بِكَ مِنَ النَّارِ ، وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ ، وَأَسْأَلُكَ أَنْ تَجْعَلَ كُلَّ قَضَاءٍ قَضَيْتَهُ لِيْ خَيْرًا",
    "translation": "O Allah, I beg You for all good: the immediate and the delayed, what I know of and what I do not know. I seek Your protection from all evil: the immediate and the delayed, what I know of and what I do not know. O Allah, I beg You for the good which Your slave and Prophet ﷺ asked from You, and I seek Your protection from the evil which Your slave and Prophet ﷺ sought protection for from You. O Allah, I beg You for Paradise, and whatever words or actions lead to it. I seek Your protection from Hell-fire, and whatever words or actions lead to it. I ask You to decree good for me in everything You foreordain for me.",
    "transliteration": "Allāhumma innī as’aluka mina-l-khayri kullihī ʿājilihī wa ājilih, mā ʿalimtu minhu wa mā lam aʿlam, wa aʿūdhu bika mina-sh-sharri kullih ʿājilihī wa ājilih, mā ʿalimtu minhu wa mā lam aʿlam, Allāhumma innī as’aluka min khayri mā sa’alaka ʿabduka wa Nabiyyuk, wa aʿūdhu bika min sharri mā ʿādha minhu ʿabduka wa Nabiyyuk, Allāhumma innī as’aluka-l-Jannah, wa mā qarraba ilayhā min qawlin aw ʿamal, wa aʿūdhu bika mina-n-nār, wa mā qarraba ilayhā min qawlin aw ʿamal, wa as’aluka an tajʿala kulla qaḍā’in qaḍaytahū lī khayrā.",
    "reference": "‘Āishah narrates that the Messenger of Allah ﷺ taught her [the above]. (Ahmad 25019)",
    "virtue": ""
  },
  {
    "id": 134,
    "title": "Guidance & Protection from Evil",
    "categories": "Indecisive",
    "arabic": "اَللّٰهُمَّ أَلْهِمْنِيْ رُشْدِيْ ، وَأَعِذْنِيْ مِنْ شَرِّ نَفْسِيْ.",
    "translation": "O Allah, inspire me with sound guidance and protect me from the evil of my self.",
    "transliteration": "Allāhumma alhimnī rushdī, wa aʿidhnī min sharri nafsī.",
    "reference": "",
    "virtue": "ʿImrān b. Husayn (raḍiy Allāhu ‘anhu) narrated: “The Prophet ﷺ said to my father: ‘O Husayn, how many deities do you worship now?‘ He said: ‘Seven. Six in the earth, and one above the heavens.’ He ﷺ said: ‘So which of them do you take for your ardent requests and fears?’ He said: ‘The one above the heavens.’ He ﷺ said: ‘O Husayn, if you accept Islam, I would teach you two phrases that would benefit you.’” He (the narrator) said: “So when Husayn accepted Islam, he said: ‘O Messenger of Allah, teach me the two phrases you promised me.’ So he ﷺ said: [the above].” (Tirmidhī 3483)"
  },
  {
    "id": 135,
    "title": "Guidance & Protection from Evil",
    "categories": "Indecisive",
    "arabic": "اَللّٰهُمَّ أَلْهِمْنِيْ رُشْدِيْ ، وَأَعِذْنِيْ مِنْ شَرِّ نَفْسِيْ.",
    "translation": "O Allah, inspire me with sound guidance and protect me from the evil of my self.",
    "transliteration": "Allāhumma alhimnī rushdī, wa aʿidhnī min sharri nafsī.",
    "reference": "",
    "virtue": "ʿImrān b. Husayn (raḍiy Allāhu ‘anhu) narrated: “The Prophet ﷺ said to my father: ‘O Husayn, how many deities do you worship now?‘ He said: ‘Seven. Six in the earth, and one above the heavens.’ He ﷺ said: ‘So which of them do you take for your ardent requests and fears?’ He said: ‘The one above the heavens.’ He ﷺ said: ‘O Husayn, if you accept Islam, I would teach you two phrases that would benefit you.’” He (the narrator) said: “So when Husayn accepted Islam, he said: ‘O Messenger of Allah, teach me the two phrases you promised me.’ So he ﷺ said: [the above].” (Tirmidhī 3483)"
  },
  {
    "id": 136,
    "title": "For Firmness of the Heart",
    "categories": "Hypocritical",
    "arabic": "يَا مُقَلِّبَ الْقُلُوْبِ ثَبِّتْ قَلْبِيْ عَلَىٰ دِيْنِكَ",
    "translation": "O Changer of the hearts, make my heart firm upon Your religion.",
    "transliteration": "Yā Muqalliba-l-qulūbi thabbit qalbī ʿalā dīnik.",
    "reference": "Anas (raḍiy Allāhu ‘anhu) said: “The Messenger of Allah ﷺ would often say [the above]. So I asked: ‘O Messenger of Allah, we believe in you and what you have come with, but do you fear for us?’ He replied: ‘Yes. Indeed the hearts are in between the two Fingers of Allah’s Fingers. He changes them as He wills.”’ (Tirmidhī 3522)",
    "virtue": ""
  },
  {
    "id": 137,
    "title": "When One Experiences Doubt in Faith #1",
    "categories": "Hypocritical",
    "arabic": "آمَنْتُ بِاللهِ وَرُسُلِهِ",
    "translation": "I believe in Allah and His Messengers.",
    "transliteration": "Āmantu bi-llāhi wa rusulih.",
    "reference": "",
    "virtue": "The Messenger of Allah ﷺ said: “Shaytān comes to one of you and says: ‘Who created you?’ He replies: ‘Allah.’ Then Shaytān says: ‘Who created Allah?’ If that happens to any one of you, let him say [the above]. Indeed it will go away from him.” (Ahmad 25671)\n\nThe Messenger of Allah ﷺ said: “Whoever experiences any of these insinuations should say [the above] thrice, and it will leave him. (Ibn al-Sunnī 629)"
  },
  {
    "id": 138,
    "title": "When One Experiences Doubt in Faith #2",
    "categories": "Hypocritical",
    "arabic": "آمَنْتُ بِاللهِ وَرُسُلِهِ",
    "translation": "I believe in Allah and His Messengers.",
    "transliteration": "Āmantu bi-llāhi wa rusulih.",
    "reference": "",
    "virtue": "The Messenger of Allah ﷺ said: “Shaytān comes to one of you and says: ‘Who created you?’ He replies: ‘Allah.’ Then Shaytān says: ‘Who created Allah?’ If that happens to any one of you, let him say [the above]. Indeed it will go away from him.” (Ahmad 25671)\n\nThe Messenger of Allah ﷺ said: “Whoever experiences any of these insinuations should say [the above] thrice, and it will leave him. (Ibn al-Sunnī 629)"
  },
  {
    "id": 139,
    "title": "When One Fears Shirk & Riya'",
    "categories": "Hypocritical",
    "arabic": "اَللّٰهُمَّ إِنِّيْ أَعُوْذُ بِكَ أَنْ أُشْرِكَ بِكَ وَأَنَا أَعْلَمُ ، وَأَسْتَغْفِرُكَ لِمَا لَا أَعْلَمُ",
    "translation": "O Allah, I seek Your protection from knowingly committing shirk and seek Your forgiveness for unknowingly (committing it).",
    "transliteration": "Allāhumma innī aʿūdhu bika an ushrika bika wa-ana aʿlam, wa astaghfiruka limā lā aʿlam.",
    "reference": "",
    "virtue": "The Messenger of Allah ﷺ said: “O people, beware of this shirk, for it is more subtle than the footsteps of an ant.” The one whom Allah willed should speak asked him: “How can we beware of it when it is more subtle than the footsteps of an ant, O Messenger of Allah?” He replied: “Say [the above].” (Ahmad 3731)\n\nMa’qil bin Yasār (raḍiy Allāhu ‘anhu) narrated: “I walked with Abū Bakr Siddīq (raḍiy Allāhu ‘anhu) to the Messenger of Allah ﷺ. He ﷺ said: “O Abū Bakr! This shirk is more subtle than the footsteps of an ant.” Abū Bakr asked, “Is shirk not only when a person ascribes a partner with Allah?” The Messenger of Allah ﷺ replied: By the One in whose hands my life is, shirk is more subtle than the footsteps of an ant. Shall I not guide you towards something which if you say, it will remove it’s minor and major? He ﷺ said: “Say [the above].” (Al-Adab al-Mufrad 716)"
  },
  {
    "id": 140,
    "title": "Protection From Dajjal, Trials & Tribulations",
    "categories": "Hypocritical",
    "arabic": "اَللّٰهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنْ عَذَابِ جَهَنَّمَ ، وَمِنْ عَذَابِ الْقَبْرِ ، وَمِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ ، وَمِنْ شَرِّ فِتْنَةِ الْمَسِيْحِ الدَّجَّالِ",
    "translation": "O Allah, I seek Your protection from the punishment of the Hell-fire, and from the punishment of the grave, and from the trials of life and death, and from the evil of the tribulation of Dajjāl, the false Messiah.",
    "transliteration": "Allāhumma innī aʿūdhu bika min ʿadhābi jahannam, wa min ʿadhābi-l-qabr, wa min fitnati-l-maḥyā wa-l-mamāt, wa min sharri fitnati-l-masīḥi-d-dajjāl.",
    "reference": "",
    "virtue": "The Messenger of Allah ﷺ said: “After the tashahhud (in Salāh), one should seek Allah’s protection from four things by saying [the above].” (Muslim 588)\n\nHe ﷺ also said: “If anyone learns the first ten verses of Sūrah al-Kahf by heart, he will be protected from Dajjāl.” (Muslim 809)"
  },
  {
    "id": 141,
    "title": "3 Quls: Be Sufficed in All Your Matters",
    "categories": "Jealous",
    "arabic": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ.\nقُلْ هُوَ اللّٰهُ أَحَدٌ ، اَللّٰهُ الصَّمَدُ ، لَمْ يَلِدْ وَلَمْ يُوْلَدْ ، وَلَمْ يَكُنْ لَّهُ كُفُوًا أَحَدٌ.\n\n  بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ.\nقُلْ أَعُوْذُ بِرَبِّ الْفَلَقِ ، مِنْ شَرِّ مَا خَلَقَ ، وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ ، وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ ، وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ.\n\n  بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ.\nقُلْ أَعُوْذُ بِرَبِّ النَّاسِ ، مَلِكِ النَّاسِ ، إِلٰهِ النَّاسِ ، مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ ، اَلَّذِيْ يُوَسْوِسُ فِيْ صُدُوْرِ النَّاسِ ، مِنَ الْجِنَّةِ وَالنَّاسِ.",
    "translation": "In the name of Allah, the All-Merciful, the Very Merciful.\nSay, He is Allah, the One, the Self-Sufficient Master, Who has not given birth and was not born, and to Whom no one is equal. (112) \n\nIn the name of Allah, the All-Merciful, the Very Merciful.\nSay, I seek protection of the Lord of the daybreak, from the evil of what He has created, and from the evil of the darkening night when it settles, and from the evil of the blowers in knots, and from the evil of the envier when he envies. (113) \n\nIn the name of Allah, the All-Merciful, the Very Merciful.\nSay, I seek protection of the Lord of mankind, the King of mankind, the God of mankind, from the evil of the whisperer who withdraws, who whispers in the hearts of mankind, whether they be Jinn or people. (114)",
    "transliteration": "Bismi-llāhi-r-Raḥmāni-r-Raḥīm. Qul Huwa-llāhu Aḥad. Allāhu-ṣ-Ṣamad. Lam yalid wa lam yūlad. Wa lam yakul-lahū kufuwan aḥad. \n\nBismi-llāhi-r-Raḥmāni-r-Raḥīm. Qul aʿūdhu bi-Rabbi-l-falaq. Min sharri mā khalaq. Wa min sharri ghāsiqin idhā waqab. Wa min sharri-n-naffāthāti fi-l-ʿuqad. Wa min sharri ḥāsidin idhā ḥasad.\n\nBismi-llāhi-r-Raḥmāni-r-Raḥīm. Qul aʿūdhu bi-Rabbi-n-nās. Maliki-n-nās. Ilāh-hin-nās. Min sharri-l-waswāsi-l-khannās. Al-ladhī yuwaswisu fī ṣudūri-n-nās. Mina-l-jinnati wa-n-nās.",
    "reference": "In the name of Allah, the All-Merciful, the Very Merciful",
    "virtue": "Muʿādh b. ʿAbdullāh b. Khubaib, narrated from his father (raḍiy Allāhu ‘anhu), who said: “We went out on a rainy and extremely dark night, looking for the Messenger of Allah ﷺ, so that he could lead us in Salāh.” He said: “So I met him and he ﷺ said: ‘Say’ but I did not say anything. Then he ﷺ said: ‘Say.’ But I did not say anything. He ﷺ said: ‘Say.’ So I said: ‘What should I say?’ He ﷺ said: **“Recite Sūrah al-Ikhlās and al-Mu’awwidhatayn (Sūrah al-Falaq and Sūrah al-Nās) three times in the morning and the evening. It will suffice you in all respects.”** (Tirmidhī 3575) \n‘It will suffice you in all respects’ means it will protect you from all evil."
  },
  {
    "id": 142,
    "title": "Entrust All Your Matters to Allah",
    "categories": "Jealous",
    "arabic": "يَا حَيُّ يَا قَيُّوْمُ ، بِرَحْمَتِكَ أَسْتَغِيْثُ ، أَصْلِحْ لِيْ شَأْنِيْ كُلَّهُ ، وَلَا تَكِلْنِيْ إِلَىٰ نَفْسِيْ طَرْفَةَ عَيْنٍ.",
    "translation": "O The Ever Living, The Sustainer of all. ; I seek assistance through Your mercy. Rectify all of my affairs and do not entrust me to myself for the blink of an eye.",
    "transliteration": "Yā Ḥayyu yā Qayyūm, bi-raḥmatika astaghīth, aṣliḥ lī sha’nī kullah, wa lā takilnī ilā nafsī ṭarfata ʿayn.",
    "reference": "Anas b. Mālik (raḍiy Allāhu ʿanhu) narrates that the Prophet ﷺ said to Fāṭimah (raḍiy Allāhu ʿanhā), “What is preventing you from (doing) what I am advising you; that you say [the above] in the morning and evening?” (Nasā’ī in ʿAmal al-Yawm wa-l-Laylah 570)",
    "virtue": ""
  },
  {
    "id": 143,
    "title": "Duʿa for Seeking Protection from Shaytan",
    "categories": "Jealous",
    "arabic": "رَبِّ أَعُوْذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِيْنِ ، وَأَعُوذُ بِكَ رَبِّ أَنْ يَّحْضُرُوْنِ",
    "translation": "My Lord, I seek protection with You from the promptings of the devils; and I seek protection in You, my Lord, from their coming near me. (23:97-98)",
    "transliteration": "Rabbi aʿūdhu bika min hamazāti-sh-shayāṭīn. Wa aʿūdhu bika Rabbi ay-yaḥḍurūn.",
    "reference": "",
    "virtue": ""
  },
  {
    "id": 144,
    "title": "Becoming A Godly Person",
    "categories": "Jealous",
    "arabic": "رَبِّ أَعِنِّيْ وَلَا تُعِنْ عَلَيَّ ، وَانْصُرْنِيْ وَلَا تَنْصُرْ عَلَيَّ ، وَامْكُرْ لِيْ وَلَا تَمْكُرْ عَلَيَّ ، وَاهْدِنِيْ وَيَسِّرِ الْهُدَىٰ لِيْ ، وَانْصُرْنِيْ عَلَىٰ مَنْ بَغَىٰ عَلَيَّ ، رَبِّ اجْعَلْنِيْ لَكَ شَكَّارًا ، لَكَ ذَكَّارًا ، لَكَ رَهَّابًا ، لَكَ مِطْوَاعًا ، لَكَ مُخْبِتًا ، إِلَيْكَ أَوَّاهًا مُّنِيْبًا ، رَبِّ تَقَبَّلْ تَوْبَتِيْ ، وَاغْسِلْ حَوْبَتِيْ ، وَأَجِبْ دَعْوَتِيْ ، وَثَبِّتْ حُجَّتِيْ ، وَسَدِّدْ لِسَانِيْ ، وَاهْدِ قَلْبِيْ ، وَاسْلُلْ سَخِيْمَةَ صَدْرِيْ",
    "translation": "My Lord, help me and do not help others against me. Grant me victory and do not grant victory to others over me. Plan in my favour and do not plan for others against me. Guide me and ease guidance for me. Help me against those who oppress me. My Lord, make me one who is extremely grateful to You, who remembers you always, who perpetually fears You, who is fully obedient to You, who is humble before You, who constantly cries and pleads with You, and who repeatedly turns to You in repentance. My Lord, accept my repentance, wash away my sins, accept my supplications, strengthen my case, rectify my speech, guide my heart, and remove the malice from my heart.",
    "transliteration": "Rabbi aʿinnī wa lā tuʿin ʿalayya, wan-ṣurnī wa lā tanṣur ʿalayya, wa-mkur lī wa lā tamkur ʿalayya, wa-hdinī wa yas-siri-l-hudā lī, wan-ṣurnī ʿalā ma-m-baghā ʿalayya, Rabbi-j-ʿalnī laka shakkārā, laka dhak- kārā, laka rahhābā, laka miṭwāʿā, laka mukhbitā, ilayka aw-wāha-m-munībā, Rabbi taqabbal tawbatī, wa-ghsil ḥawbatī, wa ajib daʿwatī, wa thab-bit ḥujjatī, wa saddid lisānī, wahdi qalbī, waslul sakhīmata ṣadrī.",
    "reference": "Ibn ʿAbbās (raḍiy Allāhu ‘anhu) narrates that the Messenger of Allah ﷺ would supplicate with [the above]. (Tirmidhī 3551)",
    "virtue": ""
  },
  {
    "id": 145,
    "title": "Contentment & Allah’s Protection",
    "categories": "Jealous",
    "arabic": "اَللّٰهُمَّ قَنِّعْنِيْ بِمَا رَزَقْتَنِيْ ، وَبَارِكْ لِيْ فِيْهِ ، وَاخْلُفْ عَلَيٰ كُلِّ غَائِبَةٍ لِّيْ بِخَيْرٍ",
    "translation": "O Allah, make me content with what You have granted me, bless me in it and be a protector for me in that which is absent from me (i.e. family and wealth).",
    "transliteration": "Allāhumma qanniʿnī bimā razaqtanī, wa bārik lī fīhī, wa-khluf ʿalā kulli ghā’ibati-l-lī bi-khayr.",
    "reference": "Ibn ʿAbbās (radiy Allāhū ‘anhumā) narrates that the Prophet ﷺ would supplicate with [the above]. (Hākim 1/455)",
    "virtue": ""
  },
  {
    "id": 146,
    "title": "Protect Yourself From Anxiety, Laziness, Debt etc",
    "categories": "Lazy",
    "arabic": "اَللّٰهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ ، وَأَعُوْذُ بِكَ مِنَ الْعَجْزِ وَالْكَسَلِ، وَأَعُوْذُ بِكَ مِنَ الْجُبْنِ وَالْبُخْلِ ، وَأَعُوْذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ وَقَهْرِ الرِّجَالِ.",
    "translation": "O Allah, I seek Your protection from anxiety and grief. I seek Your protection from inability and laziness. I seek Your protection from cowardice and miserliness, and I seek Your protection from being overcome by debt and being overpowered by men.",
    "transliteration": "Allāhumma innī aʿūdhu bika min-l-hammi wa-l-ḥazan, wa aʿūdhu bika min-l-ʿajzi wa-l-kasal, wa aʿūdhu bika min-l-jubni wa-l-bukhl, wa aʿūdhu bika min ghalabati-d-dayni wa qahri-r-rijāl.",
    "reference": "",
    "virtue": "Abū Saʿīd al-Khudrī (raḍiy Allāhu ʿanhu) narrated that one day, the Messenger of Allah ﷺ entered the masjid. He saw a man from the Anṣār called Abū Umāmah (raḍiy Allāhu ʿanhu). He ﷺ asked, “What is the matter? Why are you sitting in the mosque when it is not the time for prayer?” He replied, “Never-ending worries and debts, O Messenger of Allah.” The Messenger of Allah ﷺ then asked, “Shall I not teach you words by which, when you say them, Allah will remove your worries, and settle your debts?” He replied, “Yes of course, O Messenger of Allah.” He ﷺ said, “Say in the morning and evening [the above].” Abū Umāmah (raḍiy Allāhu ʿanhu) said, “Then I did that, and Allah removed my worries and settled my debts.” (Abū Dāwūd 1555)"
  },
  {
    "id": 147,
    "title": "Ask Allah For Good Health and Protection",
    "categories": "Lazy",
    "arabic": "اَللّٰهُمَّ عَافِنِيْ فِيْ بَدَنِيْ ، اَللّٰهُمَّ عَافِنِيْ فِيْ سَمْعِيْ ، اَللّٰهُمَّ عَافِنِيْ فِيْ بَصَرِيْ ، لَا إِلٰهَ إِلَّا أَنْتَ ، اَللّٰهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنَ الْكُفْرِ وَالْفَقْرِ، وأَعُوْذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، لَا إِلٰهَ إِلَّا أَنْتَ.",
    "translation": "O Allah, grant me well-being in my body. O Allah, grant me well-being in my hearing. O Allah, grant me well-being in my sight. There is no god worthy of worship except You. O Allah, I seek Your protection from disbelief and poverty and I seek Your protection from the punishment of the grave. There is no god worthy of worship except You.",
    "transliteration": "Allāhumma ʿāfinī fī badanī, Allāhumma ʿāfinī fī samʿī, Allāhumma ʿāfinī fī baṣarī, lā ilāha illā Ant, Allāhumma innī aʿūdhu bika mina-l-kufri wa-l-faqr, wa aʿūdhu bika min ʿadhābi-l-qabr, lā ilāha illā Ant.",
    "reference": "‘Abd al-Raḥmān b. Abī Bakrah (raḍiy Allāhu ʿanhu) narrates that he said to his father, “O my father! I hear you supplicating with [the above] every morning. You repeat them three times in the morning and three times in the evening.” He said, “Indeed I heard the Messenger of Allah ﷺ supplicating with these (words) and I love to follow his practice.” (Abū Dāwūd 5090, Aḥmad 20430)",
    "virtue": ""
  },
  {
    "id": 148,
    "title": "Entrust All Your Matters to Allah",
    "categories": "Lazy",
    "arabic": "يَا حَيُّ يَا قَيُّوْمُ ، بِرَحْمَتِكَ أَسْتَغِيْثُ ، أَصْلِحْ لِيْ شَأْنِيْ كُلَّهُ ، وَلَا تَكِلْنِيْ إِلَىٰ نَفْسِيْ طَرْفَةَ عَيْنٍ.",
    "translation": "O The Ever Living, The Sustainer of all. ; I seek assistance through Your mercy. Rectify all of my affairs and do not entrust me to myself for the blink of an eye.",
    "transliteration": "Yā Ḥayyu yā Qayyūm, bi-raḥmatika astaghīth, aṣliḥ lī sha’nī kullah, wa lā takilnī ilā nafsī ṭarfata ʿayn.",
    "reference": "Anas b. Mālik (raḍiy Allāhu ʿanhu) narrates that the Prophet ﷺ said to Fāṭimah (raḍiy Allāhu ʿanhā), “What is preventing you from (doing) what I am advising you; that you say [the above] in the morning and evening?” (Nasā’ī in ʿAmal al-Yawm wa-l-Laylah 570)",
    "virtue": ""
  },
  {
    "id": 149,
    "title": "Protection from Evil Traits & Endings",
    "categories": "Lazy",
    "arabic": "اَللّٰهُمَّ إِنّيْ أَعُوْذُ بِكَ مِنَ الْبُخْلِ ، وَأَعُوْذُ بِكَ مِنَ الْجُبْنِ ، وَأَعُوْذُ بِكَ أَنْ أُرَدَّ إِلَىٰ أَرْذَلِ الْعُمُرِ ، وَأَعُوْذُ بِكَ مِنْ فِتْنَةِ الدُّنْيَا ، وَأَعُوْذُ بِكَ مِنْ عَذَابِ الْقَبْرِ.",
    "translation": "O Allah, I seek Your protection from miserliness and I seek Your protection from cowardice. I seek Your protection from being returned to the worst part of life (old age), I seek Your protection from the trials of the world, and I seek Your protection from the punishment of the grave.",
    "transliteration": "Allāhumma innī aʿūdhu bika mina-l-bukhl, wa aʿūdhu bika mina-l-jubn, wa aʿūdhu bika an uradda ilā ardhali-l-ʿumur, wa aʿūdhu bika min fitnati-d-dunyā, wa aʿūdhu bika min ʿadhābi-l-qabr.",
    "reference": "Saʿd b. Abī Waqqās (radiy Allāhū ‘anhu) would instruct (to seek refuge) about five things [the above] and he would narrate it from the Messenger of Allah ﷺ . (Bukhārī 6370)",
    "virtue": ""
  },
  {
    "id": 150,
    "title": "Protect Yourself From Anxiety, Laziness, Debt etc",
    "categories": "Lonely",
    "arabic": "اَللّٰهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ ، وَأَعُوْذُ بِكَ مِنَ الْعَجْزِ وَالْكَسَلِ، وَأَعُوْذُ بِكَ مِنَ الْجُبْنِ وَالْبُخْلِ ، وَأَعُوْذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ وَقَهْرِ الرِّجَالِ.",
    "translation": "O Allah, I seek Your protection from anxiety and grief. I seek Your protection from inability and laziness. I seek Your protection from cowardice and miserliness, and I seek Your protection from being overcome by debt and being overpowered by men.",
    "transliteration": "Allāhumma innī aʿūdhu bika min-l-hammi wa-l-ḥazan, wa aʿūdhu bika min-l-ʿajzi wa-l-kasal, wa aʿūdhu bika min-l-jubni wa-l-bukhl, wa aʿūdhu bika min ghalabati-d-dayni wa qahri-r-rijāl.",
    "reference": "",
    "virtue": "Abū Saʿīd al-Khudrī (raḍiy Allāhu ʿanhu) narrated that one day, the Messenger of Allah ﷺ entered the masjid. He saw a man from the Anṣār called Abū Umāmah (raḍiy Allāhu ʿanhu). He ﷺ asked, “What is the matter? Why are you sitting in the mosque when it is not the time for prayer?” He replied, “Never-ending worries and debts, O Messenger of Allah.” The Messenger of Allah ﷺ then asked, “Shall I not teach you words by which, when you say them, Allah will remove your worries, and settle your debts?” He replied, “Yes of course, O Messenger of Allah.” He ﷺ said, “Say in the morning and evening [the above].” Abū Umāmah (raḍiy Allāhu ʿanhu) said, “Then I did that, and Allah removed my worries and settled my debts.” (Abū Dāwūd 1555)"
  },
  {
    "id": 151,
    "title": "Grief & Anxiety #1",
    "categories": "Lonely",
    "arabic": "اَللّٰهُمَّ إِنِّيْ عَبْدُكَ ، وَابْنُ عَبْدِكَ ، وَابْنُ أَمَتِكَ ، نَاصِيَتِيْ بِيَدِكَ ، مَاضٍ فِيَّ حُكْمُكَ ، عَدْلٌ فِيَّ قَضَاؤُكَ ، أَسْأَلُكَ بِكُلِّ اسْمٍ هُوَ لَكَ ، سَمَّيْتَ بِهِ نَفْسَكَ ، أَوْ عَلَّمْتَهُ أَحَدًا مِنْ خَلْقِكَ ، أَوْ أَنْزَلْتَهُ فِيْ كِتَابِكَ ، أَوِ اسْتَأْثَرْتَ بِهِ فِيْ عِلْمِ الْغَيْبِ عِنْدَكَ ، أَنْ تَجْعَلَ الْقُرْآنَ رَبِيْعَ قَلْبِيْ ، وَنُوْرَ صَدْرِيْ وَجَلَاءَ حُزْنِيْ ، وَذَهَابَ هَمِّيْ",
    "translation": "O Allah, I am Your slave and the son of Your male slave and the son of Your female slave. My forehead is in Your Hand (i.e. you have control over me). I am subject to Your judgement and Your decree concerning me is just. I ask You – by every name that is Yours, by which You have named Yourself, or taught any one of Your creation, or revealed in Your Book, or kept unto Yourself in the knowledge of the unseen that is with You – to make the Qur’ān the spring of my heart, the light of my chest, the banisher of my grief and the reliever of my anxiety.",
    "transliteration": "Allāhumma innī ʿabduk, wa-bnu ʿabdik, wa-bnu amatik, nāṣiyatī bi-yadik, māḍin fiyya ḥukmuk, ʿadlun fiyya qaḍā’uk, as’aluka bi-kulli-smin huwa lak, sammayta bihi nafsak, aw ʿallamtahū aḥadam-min khalqik, aw anzaltahū fī Kitābik, awi-sta’tharta bihī fī ʿilmi-l-ghaybi ʿindak, an tajʿala-l-Qur’āna rabīʿa qalbī, wa nūra ṣadrī wa jalā’a ḥuznī, wa dhahāba hammī.",
    "reference": "",
    "virtue": "The Messenger of Allah ﷺ said: “There is no one amongst you who, when he is stricken with grief and anxiety, says [the above] except that Allah will remove his grief and anxiety, and will give him joy instead.” The companions said, ‘O Messenger of Allah, should we not learn these words?’ He ﷺ replied, ‘Of course! One who hears it should learn it.’” (Ahmad 3712)"
  },
  {
    "id": 152,
    "title": "Grief & Anxiety #2",
    "categories": "Lonely",
    "arabic": "لَا إِلٰهَ إِلَّا اللّٰهُ الْعَظِيْمُ الْحَلِيْمُ ، لَا إِلٰهَ إِلَّا اللّٰهُ رَبُّ الْعَرْشِ الْعَظِيْمِ ، لَا إِلٰهَ إِلَّا اللّٰهُ رَبُّ السَّمٰـوٰتِ وَرَبُّ الْأَرْضِ وَرَبُّ الْعَرْشِ الْكَرِيْمِ",
    "translation": "There is no god but Allah, the Supreme, The Forbearing. There is no god but Allah, Lord of the Magnificent Throne. There is no god but Allah, Lord of the heavens, Lord of the earth, Lord of the Noble Throne.",
    "transliteration": "Lā ilāha illā-llāhu-l-ʿĀẓīmu-l-Ḥalīm, lā ilāha illā-llāhu Rabbu-l-ʿĀrshi-l-ʿAẓīm, lā ilāha illā-llāhu Rabbu-s-samāwāti wa Rabbu-l-arḍi wa Rabbu-l-ʿĀrshi-l-karīm.",
    "reference": "The Messenger of Allah ﷺ would invoke Allah at the time of distress with [the above]. (Bukhārī 6345, Muslim 2730)",
    "virtue": ""
  },
  {
    "id": 153,
    "title": "When One is Afraid of People",
    "categories": "Lonely",
    "arabic": "حَسْبُنَا اللّٰهُ وَنِعْمَ الْوَكِيْلُ",
    "translation": "Allah is enough for us and He is the Best Protector.",
    "transliteration": "Ḥasbunallāhu wa niʿmal Wakīl.",
    "reference": "Ibn ʿAbbās (radiy Allāhū ‘anhumā) narrated: \"[the above] was said by Ibrāhīm (‘alayhis-salām) when he was thrown into the fire; and it was said by Muhammad ﷺ when they (i.e. the hypocrites) said, “A great army is gathering against you, therefore, fear them,” but it only increased their faith and they said: “Allah is Sufficient for us, and He is the Best Disposer (of affairs, for us).” (3.173) (Bukhārī 4563)",
    "virtue": ""
  },
  {
    "id": 154,
    "title": "Protection From The Anguish of the World & Hereafter",
    "categories": "Lonely",
    "arabic": "اَللّٰهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنْ ضِيْقِ الدُّنْيَا وَضِيْقِ يَوْمِ الْقِيَامَةِ.",
    "translation": "O Allah, I seek Your protection from the anguish of the world and the anguish of the Day of Judgement.",
    "transliteration": "Allāhumma innī aʿūdhu bika min ḍīqi-d-dunyā wa ḍīqi yawmi-l-qiyāmah.",
    "reference": "Sharīq al-Hawzānī (raḥimahullāh) narrates that I entered upon Aisha (raḍiy Allāhu ‘anhā) and I asked her: “With which supplication did the Messenger of Allah ﷺ begin his Salāh when he woke up at night?” She replied: “You have asked me regarding something which no one has asked me before.” When he woke up at night, he uttered: Allāhu Akbar (Allah is the Greatest) ten times, and uttered Alḥamdullillāh (All praise be to Allah) ten times, and said Subḥāna-llāhi wa bi ḥamdih. (Allah is free from imperfection, and all praise is due to Him.) ten times, and said: Subḥānal Malik al-Quddūs (How perfect is the Sovereign, the Most Holy) ten times, and asked Allah’s forgiveness ten times, and said: “There is no god but Allah” ten times, and then said: [the above] ten times. He then began the Salāh. (Abū Dāwūd 5085)",
    "virtue": ""
  },
  {
    "id": 155,
    "title": "Allah Will Suffice You in Everything",
    "categories": "Lonely",
    "arabic": "حَسْبِيَ اللّٰهُ لَا إِلٰهَ إِلَّا هُوَ ، عَلَيْهِ تَوَكَّلْتُ ، وَهُوَ رَبُّ الْعَرْشِ الْعَظِيْمِ.",
    "translation": "Allah is sufficient for me. There is no god worthy of worship except Him. I have placed my trust in Him only and He is the Lord of the Magnificent Throne.",
    "transliteration": "Ḥasbiya-Allāhu lā ilāha illā Huwa, ʿalayhi tawakkaltu, wa Huwa Rabbu-l-ʿArshi-l-ʿaẓīm.",
    "reference": "",
    "virtue": "Abū al-Dardā’ (raḍiy Allāhu ʿanhu) narrates from the Messenger of Allah ﷺ that he said: “Whoever recites [the above] seven times in the morning and in the evening, Allah will suffice him in everything that concerns him in matters of this world and the next.” (Ibn al-Sunnī 71)"
  },
  {
    "id": 156,
    "title": "Duʿa of Prophet Musa ﷺ Expressing His Dire Need",
    "categories": "Lonely",
    "arabic": "رَبِّ إِنِّيْ لِمَآ أَنْزَلْتَ إِلَيَّ مِنْ خَيْرٍ فَقِيْرٌ",
    "translation": "My Lord, truly I am in dire need of any good which You may send me. (28:24)",
    "transliteration": "Rabbi innī limā anzalta illayya min khayrin faqīr.",
    "reference": "",
    "virtue": ""
  },
  {
    "id": 157,
    "title": "Entrust All Your Matters to Allah",
    "categories": "Lonely",
    "arabic": "يَا حَيُّ يَا قَيُّوْمُ ، بِرَحْمَتِكَ أَسْتَغِيْثُ ، أَصْلِحْ لِيْ شَأْنِيْ كُلَّهُ ، وَلَا تَكِلْنِيْ إِلَىٰ نَفْسِيْ طَرْفَةَ عَيْنٍ.",
    "translation": "O The Ever Living, The Sustainer of all. ; I seek assistance through Your mercy. Rectify all of my affairs and do not entrust me to myself for the blink of an eye.",
    "transliteration": "Yā Ḥayyu yā Qayyūm, bi-raḥmatika astaghīth, aṣliḥ lī sha’nī kullah, wa lā takilnī ilā nafsī ṭarfata ʿayn.",
    "reference": "Anas b. Mālik (raḍiy Allāhu ʿanhu) narrates that the Prophet ﷺ said to Fāṭimah (raḍiy Allāhu ʿanhā), “What is preventing you from (doing) what I am advising you; that you say [the above] in the morning and evening?” (Nasā’ī in ʿAmal al-Yawm wa-l-Laylah 570)",
    "virtue": ""
  },
  {
    "id": 158,
    "title": "Protection from Evil Traits & Endings",
    "categories": "Lonely",
    "arabic": "اَللّٰهُمَّ إِنّيْ أَعُوْذُ بِكَ مِنَ الْبُخْلِ ، وَأَعُوْذُ بِكَ مِنَ الْجُبْنِ ، وَأَعُوْذُ بِكَ أَنْ أُرَدَّ إِلَىٰ أَرْذَلِ الْعُمُرِ ، وَأَعُوْذُ بِكَ مِنْ فِتْنَةِ الدُّنْيَا ، وَأَعُوْذُ بِكَ مِنْ عَذَابِ الْقَبْرِ.",
    "translation": "O Allah, I seek Your protection from miserliness and I seek Your protection from cowardice. I seek Your protection from being returned to the worst part of life (old age), I seek Your protection from the trials of the world, and I seek Your protection from the punishment of the grave.",
    "transliteration": "Allāhumma innī aʿūdhu bika mina-l-bukhl, wa aʿūdhu bika mina-l-jubn, wa aʿūdhu bika an uradda ilā ardhali-l-ʿumur, wa aʿūdhu bika min fitnati-d-dunyā, wa aʿūdhu bika min ʿadhābi-l-qabr.",
    "reference": "Saʿd b. Abī Waqqās (radiy Allāhū ‘anhu) would instruct (to seek refuge) about five things [the above] and he would narrate it from the Messenger of Allah ﷺ . (Bukhārī 6370)",
    "virtue": ""
  },
  {
    "id": 159,
    "title": "Surah al-Fatihah: The Greatest Duʿa",
    "categories": "Lost",
    "arabic": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ ، \nاَلْحَمْدُ لِلّٰهِ رَبِّ الْعَالَمِيْنَ ، الرَّحْمٰنِ الرَّحِيْمِ ، مٰلِكِ يَوْمِ الدِّيْنِ ، إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِيْنُ ، اِهْدِنَا الصِّرَاطَ الْمُسْتَقِيْمَ ، صِرَاطَ الَّذِيْنَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوْبِ عَلَيْهِمْ وَلَا الضَّآلِّيْنَ",
    "translation": "In the name of Allah, the All-Merciful, the Very Merciful. All praises and thanks are for Allah, the Lord of all the worlds, The All-Merciful, The Very Merciful, Master of the Day of Judgement. You Alone we worship, You Alone we ask for help. Guide us on the Straight Path, the path of those whom You have favoured, not of those who incur (Your) anger nor of those who have gone astray. (1:1-7)",
    "transliteration": "Bismi-llāhi-r-Raḥmāni-r-Raḥīm. Alḥamdu-lillāhi Rabbi-l-ʿālamīn, ar-Raḥmāni-r-Raḥīm, Māliki yawmi-d-dīn, iyyāka naʿbudu wa iyyāka nastaʿīn, ihdina-ṣ-Ṣirāṭa-l-Mustaqīm, ṣirāṭa-lladhīna anʿamta ʿalayhim ghayri-l-maghḍūbi ʿālayhim wa la-ḍ-ḍāllīn.",
    "reference": "",
    "virtue": ""
  },
  {
    "id": 160,
    "title": "Protection From The Anguish of the World & Hereafter",
    "categories": "Lost",
    "arabic": "اَللّٰهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنْ ضِيْقِ الدُّنْيَا وَضِيْقِ يَوْمِ الْقِيَامَةِ.",
    "translation": "O Allah, I seek Your protection from the anguish of the world and the anguish of the Day of Judgement.",
    "transliteration": "Allāhumma innī aʿūdhu bika min ḍīqi-d-dunyā wa ḍīqi yawmi-l-qiyāmah.",
    "reference": "Sharīq al-Hawzānī (raḥimahullāh) narrates that I entered upon Aisha (raḍiy Allāhu ‘anhā) and I asked her: “With which supplication did the Messenger of Allah ﷺ begin his Salāh when he woke up at night?” She replied: “You have asked me regarding something which no one has asked me before.” When he woke up at night, he uttered: Allāhu Akbar (Allah is the Greatest) ten times, and uttered Alḥamdullillāh (All praise be to Allah) ten times, and said Subḥāna-llāhi wa bi ḥamdih. (Allah is free from imperfection, and all praise is due to Him.) ten times, and said: Subḥānal Malik al-Quddūs (How perfect is the Sovereign, the Most Holy) ten times, and asked Allah’s forgiveness ten times, and said: “There is no god but Allah” ten times, and then said: [the above] ten times. He then began the Salāh. (Abū Dāwūd 5085)",
    "virtue": ""
  },
  {
    "id": 161,
    "title": "Allah Will Suffice You in Everything",
    "categories": "Lost",
    "arabic": "حَسْبِيَ اللّٰهُ لَا إِلٰهَ إِلَّا هُوَ ، عَلَيْهِ تَوَكَّلْتُ ، وَهُوَ رَبُّ الْعَرْشِ الْعَظِيْمِ.",
    "translation": "Allah is sufficient for me. There is no god worthy of worship except Him. I have placed my trust in Him only and He is the Lord of the Magnificent Throne.",
    "transliteration": "Ḥasbiya-Allāhu lā ilāha illā Huwa, ʿalayhi tawakkaltu, wa Huwa Rabbu-l-ʿArshi-l-ʿaẓīm.",
    "reference": "",
    "virtue": "Abū al-Dardā’ (raḍiy Allāhu ʿanhu) narrates from the Messenger of Allah ﷺ that he said: “Whoever recites [the above] seven times in the morning and in the evening, Allah will suffice him in everything that concerns him in matters of this world and the next.” (Ibn al-Sunnī 71)"
  },
  {
    "id": 162,
    "title": "Duʿa of Prophet Musa ﷺ Expressing His Dire Need",
    "categories": "Lost",
    "arabic": "رَبِّ إِنِّيْ لِمَآ أَنْزَلْتَ إِلَيَّ مِنْ خَيْرٍ فَقِيْرٌ",
    "translation": "My Lord, truly I am in dire need of any good which You may send me. (28:24)",
    "transliteration": "Rabbi innī limā anzalta illayya min khayrin faqīr.",
    "reference": "",
    "virtue": ""
  },
  {
    "id": 163,
    "title": "Entrust All Your Matters to Allah",
    "categories": "Lost",
    "arabic": "يَا حَيُّ يَا قَيُّوْمُ ، بِرَحْمَتِكَ أَسْتَغِيْثُ ، أَصْلِحْ لِيْ شَأْنِيْ كُلَّهُ ، وَلَا تَكِلْنِيْ إِلَىٰ نَفْسِيْ طَرْفَةَ عَيْنٍ.",
    "translation": "O The Ever Living, The Sustainer of all. ; I seek assistance through Your mercy. Rectify all of my affairs and do not entrust me to myself for the blink of an eye.",
    "transliteration": "Yā Ḥayyu yā Qayyūm, bi-raḥmatika astaghīth, aṣliḥ lī sha’nī kullah, wa lā takilnī ilā nafsī ṭarfata ʿayn.",
    "reference": "Anas b. Mālik (raḍiy Allāhu ʿanhu) narrates that the Prophet ﷺ said to Fāṭimah (raḍiy Allāhu ʿanhā), “What is preventing you from (doing) what I am advising you; that you say [the above] in the morning and evening?” (Nasā’ī in ʿAmal al-Yawm wa-l-Laylah 570)",
    "virtue": ""
  },
  {
    "id": 164,
    "title": "Asking for Good & Protection From Evil",
    "categories": "Lost",
    "arabic": "اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَ مِنَ الْخَيْرِ كُلِّهِ عَاجِلِهِ وَآجِلِهِ ، مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ ، وَأَعُوْذُ بِكَ مِنَ الشَّرِّ كُلِّهِ عَاجِلِهِ وَآجِلِهِ ، مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ ، اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَ مِنْ خَيْرِ مَا سَأَلَكَ عَبْدُكَ وَنَبِيُّكَ ، وَأَعُوْذُ بِكَ مِنْ شَرِّ مَا عَاذَ مِنْهُ عَبْدُكَ وَنَبِيُّكَ ، اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَ الْجَنَّةَ ، وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ ، وَأَعُوْذُ بِكَ مِنَ النَّارِ ، وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ ، وَأَسْأَلُكَ أَنْ تَجْعَلَ كُلَّ قَضَاءٍ قَضَيْتَهُ لِيْ خَيْرًا",
    "translation": "O Allah, I beg You for all good: the immediate and the delayed, what I know of and what I do not know. I seek Your protection from all evil: the immediate and the delayed, what I know of and what I do not know. O Allah, I beg You for the good which Your slave and Prophet ﷺ asked from You, and I seek Your protection from the evil which Your slave and Prophet ﷺ sought protection for from You. O Allah, I beg You for Paradise, and whatever words or actions lead to it. I seek Your protection from Hell-fire, and whatever words or actions lead to it. I ask You to decree good for me in everything You foreordain for me.",
    "transliteration": "Allāhumma innī as’aluka mina-l-khayri kullihī ʿājilihī wa ājilih, mā ʿalimtu minhu wa mā lam aʿlam, wa aʿūdhu bika mina-sh-sharri kullih ʿājilihī wa ājilih, mā ʿalimtu minhu wa mā lam aʿlam, Allāhumma innī as’aluka min khayri mā sa’alaka ʿabduka wa Nabiyyuk, wa aʿūdhu bika min sharri mā ʿādha minhu ʿabduka wa Nabiyyuk, Allāhumma innī as’aluka-l-Jannah, wa mā qarraba ilayhā min qawlin aw ʿamal, wa aʿūdhu bika mina-n-nār, wa mā qarraba ilayhā min qawlin aw ʿamal, wa as’aluka an tajʿala kulla qaḍā’in qaḍaytahū lī khayrā.",
    "reference": "‘Āishah narrates that the Messenger of Allah ﷺ taught her [the above]. (Ahmad 25019)",
    "virtue": ""
  },
  {
    "id": 165,
    "title": "Goodness in Din, Dunya & the Hereafter",
    "categories": "Lost",
    "arabic": "اَللّٰهُمَّ أَصْلِحْ لِيْ دِيْنِيَ الَّذِيْ هُوَ عِصْمَةُ أَمْرِيْ ، وَأَصْلِحْ لِيْ دُنْيَايَ الَّتِيْ فِيْهَا مَعَاشِيْ ، وَأَصْلِحْ لِيْ آخِرَتِيَ الَّتِيْ فِيْهَا مَعَادِيْ ، وَاجْعَلِ الْحَيَاةَ زِيَادَةً لِّيْ فِيْ كُلِّ خَيْرٍ ، وَاجْعَلِ الْمَوْتَ رَاحَةً لِّيْ مِنْ كُلِّ شَرٍّ",
    "translation": "O Allah, rectify my religion for me which is the protection of my affairs. Rectify my world for me wherein is my livelihood. Rectify my hereafter for me, to which is my return. Make my life a means of increase for me in every good, and make death a respite for me from every evil.",
    "transliteration": "Allāhumma aṣliḥ lī dīniya-l-ladhī huwa ʿiṣmatu amrī, wa aṣliḥ lī dunyāya-l-latī fīhā maʿāshī, wa aṣliḥ lī ākhiratiya-l-latī fīhā maʿādī, wa-jʿali-l-ḥayāta ziyādata-l-lī fī kulli khayr, wa-jʿali-l-mawta rāḥata-l-lī min kulli sharr.",
    "reference": "Abū Hurayrah (raḍiy Allāhu ‘anhu) mentions that the Messenger of Allah ﷺ would say (supplicate): [the above]. (Muslim 2720)",
    "virtue": ""
  },
  {
    "id": 166,
    "title": "Protect Yourself From Anxiety, Laziness, Debt etc",
    "categories": "Nervous",
    "arabic": "اَللّٰهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ ، وَأَعُوْذُ بِكَ مِنَ الْعَجْزِ وَالْكَسَلِ، وَأَعُوْذُ بِكَ مِنَ الْجُبْنِ وَالْبُخْلِ ، وَأَعُوْذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ وَقَهْرِ الرِّجَالِ.",
    "translation": "O Allah, I seek Your protection from anxiety and grief. I seek Your protection from inability and laziness. I seek Your protection from cowardice and miserliness, and I seek Your protection from being overcome by debt and being overpowered by men.",
    "transliteration": "Allāhumma innī aʿūdhu bika min-l-hammi wa-l-ḥazan, wa aʿūdhu bika min-l-ʿajzi wa-l-kasal, wa aʿūdhu bika min-l-jubni wa-l-bukhl, wa aʿūdhu bika min ghalabati-d-dayni wa qahri-r-rijāl.",
    "reference": "",
    "virtue": "Abū Saʿīd al-Khudrī (raḍiy Allāhu ʿanhu) narrated that one day, the Messenger of Allah ﷺ entered the masjid. He saw a man from the Anṣār called Abū Umāmah (raḍiy Allāhu ʿanhu). He ﷺ asked, “What is the matter? Why are you sitting in the mosque when it is not the time for prayer?” He replied, “Never-ending worries and debts, O Messenger of Allah.” The Messenger of Allah ﷺ then asked, “Shall I not teach you words by which, when you say them, Allah will remove your worries, and settle your debts?” He replied, “Yes of course, O Messenger of Allah.” He ﷺ said, “Say in the morning and evening [the above].” Abū Umāmah (raḍiy Allāhu ʿanhu) said, “Then I did that, and Allah removed my worries and settled my debts.” (Abū Dāwūd 1555)"
  },
  {
    "id": 167,
    "title": "Well-being in this World and the Hereafter",
    "categories": "Nervous",
    "arabic": "اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَ الْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ ، اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِيْ دِيْنِيْ وَدُنْيَايَ وَأَهْلِيْ وَمَالِيْ ، اَللّٰهُمَّ اسْتُرْ عَوْرَاتِيْ وَآمِنْ رَوْعَاتِيْ ، اَللّٰهُمَّ احْفَظْنِيْ مِنْ بَيْنِ يَدَيَّ ، وَمِنْ خَلْفِيْ ، وَعَنْ يَّمِيْنِيْ ، وَعَنْ شِمَالِيْ ، وَمِنْ فَوْقِيْ ، وَأَعُوْذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِيْ.",
    "translation": "O Allah, I ask You for well-being in this world and the next. O Allah, I ask You for forgiveness and well-being in my religion, in my worldly affairs, in my family and in my wealth. O Allah, conceal my faults and calm my fears. O Allah, guard me from in front of me and behind me, from my right, and from my left, and from above me. I seek protection in Your Greatness from being unexpectedly destroyed from beneath me.",
    "transliteration": "Allāhumma innī as’aluka-l-ʿāfiyata fi-d-dunyā wa-l-ākhirah. Allāhumma innī as’aluka-l-ʿafwa wa-l-ʿāfiyata fī dīnī wa dunyāya wa ahlī wa mālī, Allāhumma-stur ʿawrātī wa āmin rawʿātī. Allāhumma-ḥfaẓnī mim bayni yadayya wa min khalfī, wa ʿay-yamīnī wa ʿan shimālī wa min fawqī, wa aʿūdhu bi-ʿaẓamatika an ughtāla min taḥtī.",
    "reference": "",
    "virtue": "ʿAbdullāh b. ʿUmar (raḍiy Allāhu ʿanhumā) narrated: “The Messenger of Allah ﷺ never failed to say these words in the morning and in the evening.” (Abū Dāwūd 5074)"
  },
  {
    "id": 168,
    "title": "Allah Will Suffice You in Everything",
    "categories": "Nervous",
    "arabic": "حَسْبِيَ اللّٰهُ لَا إِلٰهَ إِلَّا هُوَ ، عَلَيْهِ تَوَكَّلْتُ ، وَهُوَ رَبُّ الْعَرْشِ الْعَظِيْمِ.",
    "translation": "Allah is sufficient for me. There is no god worthy of worship except Him. I have placed my trust in Him only and He is the Lord of the Magnificent Throne.",
    "transliteration": "Ḥasbiya-Allāhu lā ilāha illā Huwa, ʿalayhi tawakkaltu, wa Huwa Rabbu-l-ʿArshi-l-ʿaẓīm.",
    "reference": "",
    "virtue": "Abū al-Dardā’ (raḍiy Allāhu ʿanhu) narrates from the Messenger of Allah ﷺ that he said: “Whoever recites [the above] seven times in the morning and in the evening, Allah will suffice him in everything that concerns him in matters of this world and the next.” (Ibn al-Sunnī 71)"
  },
  {
    "id": 169,
    "title": "When One is Distressed",
    "categories": "Nervous",
    "arabic": "اَللّٰهُمَّ رَحْمَتَكَ أَرْجُوْ فَلَا تَكِلْنِيْ إِلٰى نَفْسِيْ طَرْفَةَ عَيْنٍ ، وَأَصْلِحْ لِي شَأْنِيْ كُلَّهُ لَا إِلٰهَ إِلَّا أَنْتَ",
    "translation": "O Allah! Your Mercy is what I hope for so do not entrust me to myself for the blink of an eye, rectify all of my affairs. There is no god worthy of worship but You.",
    "transliteration": "Allāhumma raḥmataka arjū fa-lā takilnī ilā nafsī ṭarfata ʿayn, wa aṣliḥ lī sha’nī kullah lā ilāha illā Ant.",
    "reference": "The Messenger of Allah ﷺ said: “The supplications for the one who is distressed are [the above].” (Abu Dāwud 5090)",
    "virtue": ""
  },
  {
    "id": 170,
    "title": "Duʿa of Prophet Musa ﷺ for Inner Peace & Strength",
    "categories": "Nervous",
    "arabic": "رَبِّ اشْرَحْ لِيْ صَدْرِيْ وَيَسِّرْ لِيْٓٓ أَمْرِيْْ",
    "translation": "My Lord, put my heart at peace for me, and make my task easy for me. (20:25)",
    "transliteration": "Rabbi-sh-shraḥ lī ṣadrī. Wa yassir lī amrī.",
    "reference": "",
    "virtue": ""
  },
  {
    "id": 171,
    "title": "Entrust All Your Matters to Allah",
    "categories": "Nervous",
    "arabic": "يَا حَيُّ يَا قَيُّوْمُ ، بِرَحْمَتِكَ أَسْتَغِيْثُ ، أَصْلِحْ لِيْ شَأْنِيْ كُلَّهُ ، وَلَا تَكِلْنِيْ إِلَىٰ نَفْسِيْ طَرْفَةَ عَيْنٍ.",
    "translation": "O The Ever Living, The Sustainer of all. ; I seek assistance through Your mercy. Rectify all of my affairs and do not entrust me to myself for the blink of an eye.",
    "transliteration": "Yā Ḥayyu yā Qayyūm, bi-raḥmatika astaghīth, aṣliḥ lī sha’nī kullah, wa lā takilnī ilā nafsī ṭarfata ʿayn.",
    "reference": "Anas b. Mālik (raḍiy Allāhu ʿanhu) narrates that the Prophet ﷺ said to Fāṭimah (raḍiy Allāhu ʿanhā), “What is preventing you from (doing) what I am advising you; that you say [the above] in the morning and evening?” (Nasā’ī in ʿAmal al-Yawm wa-l-Laylah 570)",
    "virtue": ""
  },
  {
    "id": 172,
    "title": "Duʿa of Prophet Ayyub ﷺ for Times of Distress",
    "categories": "Nervous",
    "arabic": "-رَبِّ- أَنِّيْ مَسَّنِيَ الضُّرُّ وَأَنْتَ أَرْحَمُ الرّٰحِمِيْنَ",
    "translation": "(My Lord), indeed adversity has touched me, and you are the Most Merciful of the merciful. (21:83)",
    "transliteration": "(Rabbi) Annī massaniya-ḍ-ḍurru wa Anta Arḥamu-r-raḥimīn.",
    "reference": "",
    "virtue": ""
  },
  {
    "id": 173,
    "title": "Surah al-Fatihah: The Greatest Duʿa",
    "categories": "Overwhelmed",
    "arabic": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ ، \nاَلْحَمْدُ لِلّٰهِ رَبِّ الْعَالَمِيْنَ ، الرَّحْمٰنِ الرَّحِيْمِ ، مٰلِكِ يَوْمِ الدِّيْنِ ، إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِيْنُ ، اِهْدِنَا الصِّرَاطَ الْمُسْتَقِيْمَ ، صِرَاطَ الَّذِيْنَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوْبِ عَلَيْهِمْ وَلَا الضَّآلِّيْنَ",
    "translation": "In the name of Allah, the All-Merciful, the Very Merciful. All praises and thanks are for Allah, the Lord of all the worlds, The All-Merciful, The Very Merciful, Master of the Day of Judgement. You Alone we worship, You Alone we ask for help. Guide us on the Straight Path, the path of those whom You have favoured, not of those who incur (Your) anger nor of those who have gone astray. (1:1-7)",
    "transliteration": "Bismi-llāhi-r-Raḥmāni-r-Raḥīm. Alḥamdu-lillāhi Rabbi-l-ʿālamīn, ar-Raḥmāni-r-Raḥīm, Māliki yawmi-d-dīn, iyyāka naʿbudu wa iyyāka nastaʿīn, ihdina-ṣ-Ṣirāṭa-l-Mustaqīm, ṣirāṭa-lladhīna anʿamta ʿalayhim ghayri-l-maghḍūbi ʿālayhim wa la-ḍ-ḍāllīn.",
    "reference": "",
    "virtue": ""
  },
  {
    "id": 174,
    "title": "When Difficulties Make You Yearn for Death",
    "categories": "Overwhelmed",
    "arabic": "اَللّٰهُمَّ أَحْيِنِيْ مَا كَانَتِ الْحَيَاةُ خَيْرًا لِيْ ، وَتَوَفَّنِيْ إِذَا كَانَتِ الْوَفَاةُ خَيْرًا لِيْ",
    "translation": "O Allah, let me live as long as life is better for me; and give me death when death is better for me.",
    "transliteration": "Allāhumma aḥyinī mā kānati-l-ḥayātu khayral-lī, wa tawaffanī idhā kānati-l-wafātu khayral-lī.",
    "reference": "The Messenger of Allah ﷺ said: “None of you should wish for death because of a difficulty that befalls him. Rather he should say [the above].” (Bukhārī 5671, Muslim 2680)",
    "virtue": ""
  },
  {
    "id": 175,
    "title": "When Something You Dislike Happens",
    "categories": "Overwhelmed",
    "arabic": "قَدَّرَ اللّٰهُ وَمَا شَاءَ فَعَلَ",
    "translation": "Allah has decreed and He does whatever He wills.",
    "transliteration": "Qaddara-llāhu wa mā shā’a faʿal.",
    "reference": "The Messenger of Allah ﷺ said: “A strong believer is better and more beloved to Allah than a weak believer, and there is good in everyone. Be keen on what benefits you and seek help from Allah, and do not give up. If anything afflicts you, do not say: ‘If I had done (something else), such and such would have happened.’ But say [the above], for (the utterance) ‘If’ provides an opening for the deeds of the devil.” (Muslim 2664)",
    "virtue": ""
  },
  {
    "id": 176,
    "title": "When One is in a Difficult Situation",
    "categories": "Overwhelmed",
    "arabic": "اَللّٰهُمَّ لَا سَهْلَ إِلَّا مَا جَعَلْتَهُ سَهْلًا ، وَأَنْتَ تَجْعَلُ الْحَزْنَ إِذَا شِئْتَ سَهْلًا",
    "translation": "O Allah, there is no ease except in that which You have made easy, and You make the difficulty easy when You wish.",
    "transliteration": "Allāhumma lā sahla illā mā jaʿaltahū sahlā, wa anta tajʿalu-l-ḥazna idhā shi’ta sahlā.",
    "reference": "Anas b. Malik (raḍiy Allāhu ‘anhu) ﷺ narrates that the Messenger of Allah said [the above]. (Ibn Hibbān 2427, Ibn al-Sunnī 351)",
    "virtue": ""
  },
  {
    "id": 177,
    "title": "Protect Yourself From Anxiety, Laziness, Debt etc",
    "categories": "Overwhelmed",
    "arabic": "اَللّٰهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ ، وَأَعُوْذُ بِكَ مِنَ الْعَجْزِ وَالْكَسَلِ، وَأَعُوْذُ بِكَ مِنَ الْجُبْنِ وَالْبُخْلِ ، وَأَعُوْذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ وَقَهْرِ الرِّجَالِ.",
    "translation": "O Allah, I seek Your protection from anxiety and grief. I seek Your protection from inability and laziness. I seek Your protection from cowardice and miserliness, and I seek Your protection from being overcome by debt and being overpowered by men.",
    "transliteration": "Allāhumma innī aʿūdhu bika min-l-hammi wa-l-ḥazan, wa aʿūdhu bika min-l-ʿajzi wa-l-kasal, wa aʿūdhu bika min-l-jubni wa-l-bukhl, wa aʿūdhu bika min ghalabati-d-dayni wa qahri-r-rijāl.",
    "reference": "",
    "virtue": "Abū Saʿīd al-Khudrī (raḍiy Allāhu ʿanhu) narrated that one day, the Messenger of Allah ﷺ entered the masjid. He saw a man from the Anṣār called Abū Umāmah (raḍiy Allāhu ʿanhu). He ﷺ asked, “What is the matter? Why are you sitting in the mosque when it is not the time for prayer?” He replied, “Never-ending worries and debts, O Messenger of Allah.” The Messenger of Allah ﷺ then asked, “Shall I not teach you words by which, when you say them, Allah will remove your worries, and settle your debts?” He replied, “Yes of course, O Messenger of Allah.” He ﷺ said, “Say in the morning and evening [the above].” Abū Umāmah (raḍiy Allāhu ʿanhu) said, “Then I did that, and Allah removed my worries and settled my debts.” (Abū Dāwūd 1555)"
  },
  {
    "id": 178,
    "title": "When Struck by a Calamity",
    "categories": "Overwhelmed",
    "arabic": "إِنَّا لِلّٰهِ وَإِنَّا إِلَيْهِ رَاجِعُوْنَ ، اَللّٰهُمَّ اْجُرْنِيْ فِيْ مُصِيْبَتِيْ ، وَأَخْلِفْ لِيْ خَيْرًا مِنْهَا",
    "translation": "To Allah we belong and unto Him is our return. O Allah, recompense me for my affliction and replace it for me with something better.",
    "transliteration": "Innā lillāhi wa innā ilayhi rājiʿūn, Allāhumma-‘jurnī fī muṣībatī, wa akhlif lī khayram-minha.",
    "reference": "",
    "virtue": "Umm Salamah (raḍiy Allāhu ‘anhā) said: I heard the Messenger of Allah ﷺ say, “There is no Muslim who is afflicted with a calamity, and then says what Allah has commanded him [the above supplication], except that Allah will recompense him with something better than it.” She says: “When Abū Salamah (her first husband) passed away, I said, ‘Which Muslim is better than Abū Salamah – the first household to migrate to the Messenger of Allah?’ I then said (the above duʿā’), and Allah recompensed me (by marrying me to) the Messenger of Allah ﷺ.” (Muslim 918)"
  },
  {
    "id": 179,
    "title": "Well-being in this World and the Hereafter",
    "categories": "Overwhelmed",
    "arabic": "اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَ الْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ ، اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِيْ دِيْنِيْ وَدُنْيَايَ وَأَهْلِيْ وَمَالِيْ ، اَللّٰهُمَّ اسْتُرْ عَوْرَاتِيْ وَآمِنْ رَوْعَاتِيْ ، اَللّٰهُمَّ احْفَظْنِيْ مِنْ بَيْنِ يَدَيَّ ، وَمِنْ خَلْفِيْ ، وَعَنْ يَّمِيْنِيْ ، وَعَنْ شِمَالِيْ ، وَمِنْ فَوْقِيْ ، وَأَعُوْذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِيْ.",
    "translation": "O Allah, I ask You for well-being in this world and the next. O Allah, I ask You for forgiveness and well-being in my religion, in my worldly affairs, in my family and in my wealth. O Allah, conceal my faults and calm my fears. O Allah, guard me from in front of me and behind me, from my right, and from my left, and from above me. I seek protection in Your Greatness from being unexpectedly destroyed from beneath me.",
    "transliteration": "Allāhumma innī as’aluka-l-ʿāfiyata fi-d-dunyā wa-l-ākhirah. Allāhumma innī as’aluka-l-ʿafwa wa-l-ʿāfiyata fī dīnī wa dunyāya wa ahlī wa mālī, Allāhumma-stur ʿawrātī wa āmin rawʿātī. Allāhumma-ḥfaẓnī mim bayni yadayya wa min khalfī, wa ʿay-yamīnī wa ʿan shimālī wa min fawqī, wa aʿūdhu bi-ʿaẓamatika an ughtāla min taḥtī.",
    "reference": "",
    "virtue": "ʿAbdullāh b. ʿUmar (raḍiy Allāhu ʿanhumā) narrated: “The Messenger of Allah ﷺ never failed to say these words in the morning and in the evening.” (Abū Dāwūd 5074)"
  },
  {
    "id": 180,
    "title": "Grief & Anxiety #1",
    "categories": "Overwhelmed",
    "arabic": "اَللّٰهُمَّ إِنِّيْ عَبْدُكَ ، وَابْنُ عَبْدِكَ ، وَابْنُ أَمَتِكَ ، نَاصِيَتِيْ بِيَدِكَ ، مَاضٍ فِيَّ حُكْمُكَ ، عَدْلٌ فِيَّ قَضَاؤُكَ ، أَسْأَلُكَ بِكُلِّ اسْمٍ هُوَ لَكَ ، سَمَّيْتَ بِهِ نَفْسَكَ ، أَوْ عَلَّمْتَهُ أَحَدًا مِنْ خَلْقِكَ ، أَوْ أَنْزَلْتَهُ فِيْ كِتَابِكَ ، أَوِ اسْتَأْثَرْتَ بِهِ فِيْ عِلْمِ الْغَيْبِ عِنْدَكَ ، أَنْ تَجْعَلَ الْقُرْآنَ رَبِيْعَ قَلْبِيْ ، وَنُوْرَ صَدْرِيْ وَجَلَاءَ حُزْنِيْ ، وَذَهَابَ هَمِّيْ",
    "translation": "O Allah, I am Your slave and the son of Your male slave and the son of Your female slave. My forehead is in Your Hand (i.e. you have control over me). I am subject to Your judgement and Your decree concerning me is just. I ask You – by every name that is Yours, by which You have named Yourself, or taught any one of Your creation, or revealed in Your Book, or kept unto Yourself in the knowledge of the unseen that is with You – to make the Qur’ān the spring of my heart, the light of my chest, the banisher of my grief and the reliever of my anxiety.",
    "transliteration": "Allāhumma innī ʿabduk, wa-bnu ʿabdik, wa-bnu amatik, nāṣiyatī bi-yadik, māḍin fiyya ḥukmuk, ʿadlun fiyya qaḍā’uk, as’aluka bi-kulli-smin huwa lak, sammayta bihi nafsak, aw ʿallamtahū aḥadam-min khalqik, aw anzaltahū fī Kitābik, awi-sta’tharta bihī fī ʿilmi-l-ghaybi ʿindak, an tajʿala-l-Qur’āna rabīʿa qalbī, wa nūra ṣadrī wa jalā’a ḥuznī, wa dhahāba hammī.",
    "reference": "",
    "virtue": "The Messenger of Allah ﷺ said: “There is no one amongst you who, when he is stricken with grief and anxiety, says [the above] except that Allah will remove his grief and anxiety, and will give him joy instead.” The companions said, ‘O Messenger of Allah, should we not learn these words?’ He ﷺ replied, ‘Of course! One who hears it should learn it.’” (Ahmad 3712)"
  },
  {
    "id": 181,
    "title": "Grief & Anxiety #2",
    "categories": "Overwhelmed",
    "arabic": "لَا إِلٰهَ إِلَّا اللّٰهُ الْعَظِيْمُ الْحَلِيْمُ ، لَا إِلٰهَ إِلَّا اللّٰهُ رَبُّ الْعَرْشِ الْعَظِيْمِ ، لَا إِلٰهَ إِلَّا اللّٰهُ رَبُّ السَّمٰـوٰتِ وَرَبُّ الْأَرْضِ وَرَبُّ الْعَرْشِ الْكَرِيْمِ",
    "translation": "There is no god but Allah, the Supreme, The Forbearing. There is no god but Allah, Lord of the Magnificent Throne. There is no god but Allah, Lord of the heavens, Lord of the earth, Lord of the Noble Throne.",
    "transliteration": "Lā ilāha illā-llāhu-l-ʿĀẓīmu-l-Ḥalīm, lā ilāha illā-llāhu Rabbu-l-ʿĀrshi-l-ʿAẓīm, lā ilāha illā-llāhu Rabbu-s-samāwāti wa Rabbu-l-arḍi wa Rabbu-l-ʿĀrshi-l-karīm.",
    "reference": "The Messenger of Allah ﷺ would invoke Allah at the time of distress with [the above]. (Bukhārī 6345, Muslim 2730)",
    "virtue": ""
  },
  {
    "id": 182,
    "title": "When One is Afraid of People #1",
    "categories": "Overwhelmed",
    "arabic": "حَسْبُنَا اللّٰهُ وَنِعْمَ الْوَكِيْلُ",
    "translation": "Allah is enough for us and He is the Best Protector.",
    "transliteration": "Ḥasbunallāhu wa niʿmal Wakīl.",
    "reference": "Ibn ʿAbbās (radiy Allāhū ‘anhumā) narrated: \"[the above] was said by Ibrāhīm (‘alayhis-salām) when he was thrown into the fire; and it was said by Muhammad ﷺ when they (i.e. the hypocrites) said, “A great army is gathering against you, therefore, fear them,” but it only increased their faith and they said: “Allah is Sufficient for us, and He is the Best Disposer (of affairs, for us).” (3.173) (Bukhārī 4563)",
    "virtue": ""
  },
  {
    "id": 183,
    "title": "When One is Afraid of People #2",
    "categories": "Overwhelmed",
    "arabic": "اَللّٰهُمَّ اسْتُرْ عَوْرَاتِنَا وَاٰمِنْ رَوْعَاتِنَا",
    "translation": "O Allah, conceal our faults and assuage my fears.",
    "transliteration": "Allāhumma-stur ‘awrātinā wa āmin raw‘ātinā.",
    "reference": "Abū Sa‘īd al-Khuḍrī (raḍiy Allāhu ‘anhu) narrates: “We (the Companions) said on the Day of Khandaq (Trenches): ‘O Messenger of Allah, is there anything we can say? For the hearts have reached the throats (out of fear).’ He ﷺ replied: ‘Yes! (Say) [the above].’ Abū Sa‘īd al-Khuḍrī says: ‘Allah, Mighty and Majestic destroyed the faces of the enemy with wind and Allah made them face defeat through wind.’” (Ahmad 10613)",
    "virtue": ""
  },
  {
    "id": 184,
    "title": "When One Feels Frightened",
    "categories": "Overwhelmed",
    "arabic": "لَا إِلٰهَ إِلَّا اللّٰهُ",
    "translation": "There is no god but Allah.",
    "transliteration": "Lā ilāha illā-llāh.",
    "reference": "Zaynab bint Jaḥsh (raḍiy Allāhu ʿanhā) said that the Messenger of Allah ﷺ once came to her in a state of fear and said, [the above] Woe unto the Arabs from a danger that has come near. An opening has been made in the wall of Yājūj and Mājūj like this, making a circle with his thumb and index finger. Zaynab bint Jaḥsh said, “O Messenger of Allah ﷺ! Shall we be destroyed even though there are pious persons among us?” He said, “Yes, when evil (people) will increase.” (Bukhārī 3346)",
    "virtue": ""
  },
  {
    "id": 185,
    "title": "Protection From The Anguish of the World & Hereafter",
    "categories": "Overwhelmed",
    "arabic": "اَللّٰهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنْ ضِيْقِ الدُّنْيَا وَضِيْقِ يَوْمِ الْقِيَامَةِ.",
    "translation": "O Allah, I seek Your protection from the anguish of the world and the anguish of the Day of Judgement.",
    "transliteration": "Allāhumma innī aʿūdhu bika min ḍīqi-d-dunyā wa ḍīqi yawmi-l-qiyāmah.",
    "reference": "Sharīq al-Hawzānī (raḥimahullāh) narrates that I entered upon Aisha (raḍiy Allāhu ‘anhā) and I asked her: “With which supplication did the Messenger of Allah ﷺ begin his Salāh when he woke up at night?” She replied: “You have asked me regarding something which no one has asked me before.” When he woke up at night, he uttered: Allāhu Akbar (Allah is the Greatest) ten times, and uttered Alḥamdullillāh (All praise be to Allah) ten times, and said Subḥāna-llāhi wa bi ḥamdih. (Allah is free from imperfection, and all praise is due to Him.) ten times, and said: Subḥānal Malik al-Quddūs (How perfect is the Sovereign, the Most Holy) ten times, and asked Allah’s forgiveness ten times, and said: “There is no god but Allah” ten times, and then said: [the above] ten times. He then began the Salāh. (Abū Dāwūd 5085)",
    "virtue": ""
  },
  {
    "id": 186,
    "title": "Allah Will Suffice You in Everything",
    "categories": "Overwhelmed",
    "arabic": "حَسْبِيَ اللّٰهُ لَا إِلٰهَ إِلَّا هُوَ ، عَلَيْهِ تَوَكَّلْتُ ، وَهُوَ رَبُّ الْعَرْشِ الْعَظِيْمِ.",
    "translation": "Allah is sufficient for me. There is no god worthy of worship except Him. I have placed my trust in Him only and He is the Lord of the Magnificent Throne.",
    "transliteration": "Ḥasbiya-Allāhu lā ilāha illā Huwa, ʿalayhi tawakkaltu, wa Huwa Rabbu-l-ʿArshi-l-ʿaẓīm.",
    "reference": "",
    "virtue": "Abū al-Dardā’ (raḍiy Allāhu ʿanhu) narrates from the Messenger of Allah ﷺ that he said: “Whoever recites [the above] seven times in the morning and in the evening, Allah will suffice him in everything that concerns him in matters of this world and the next.” (Ibn al-Sunnī 71)"
  },
  {
    "id": 187,
    "title": "Duʿa of Prophet Musa ﷺ Expressing His Dire Need",
    "categories": "Overwhelmed",
    "arabic": "رَبِّ إِنِّيْ لِمَآ أَنْزَلْتَ إِلَيَّ مِنْ خَيْرٍ فَقِيْرٌ",
    "translation": "My Lord, truly I am in dire need of any good which You may send me. (28:24)",
    "transliteration": "Rabbi innī limā anzalta illayya min khayrin faqīr.",
    "reference": "",
    "virtue": ""
  },
  {
    "id": 188,
    "title": "When Something Overwhelms You",
    "categories": "Overwhelmed",
    "arabic": "حَسْبِيَ اللّٰهُ وَنِعْمَ الْوَكِيْلُ",
    "translation": "Allah is enough for me and He is the Best Protector.",
    "transliteration": "Ḥasbiyallāhu wa niʿmal Wakīl.",
    "reference": "ʿAwf bin Mālik (raḍiy Allāhu ‘anhu) said that the Messenger of Allah ﷺ gave judgement between two men, and the one against whom the judgement was given said [the above] when he turned away. The Messenger ﷺ said: “Allah rebukes people for weakness. You must be strong. If something overwhelms you, say: [the above]. (Abū Dāwūd 3627)",
    "virtue": ""
  },
  {
    "id": 189,
    "title": "For Difficult Times: All Your Prayers Answered",
    "categories": "Overwhelmed",
    "arabic": "لَآ إِلٰهَ إِلَّآ أَنْتَ سُبْحَانَكَ إِنِّيْ كُنْتُ مِنَ الظَّالِمِيْنَ",
    "translation": "There is no god worthy of worship except You; You are free from all imperfection. Indeed, I have been of the wrongdoers. (21:87)",
    "transliteration": "Lā ilāha illā Anta subḥānaka innī kuntu mina-ẓ-ẓālimīn.",
    "reference": "",
    "virtue": "The Messenger of Allah ﷺ said: “The supplication of Dhun-Nūn (Prophet Yūnus) when he supplicated, while in the belly of the whale was: [the above]. ”No Muslim man ever supplicates with [the above] except that Allah answers his supplication.” (Tirmidhī 3505)"
  },
  {
    "id": 190,
    "title": "When One is Distressed",
    "categories": "Overwhelmed",
    "arabic": "اَللّٰهُمَّ رَحْمَتَكَ أَرْجُوْ فَلَا تَكِلْنِيْ إِلٰى نَفْسِيْ طَرْفَةَ عَيْنٍ ، وَأَصْلِحْ لِي شَأْنِيْ كُلَّهُ لَا إِلٰهَ إِلَّا أَنْتَ",
    "translation": "O Allah! Your Mercy is what I hope for so do not entrust me to myself for the blink of an eye, rectify all of my affairs. There is no god worthy of worship but You.",
    "transliteration": "Allāhumma raḥmataka arjū fa-lā takilnī ilā nafsī ṭarfata ʿayn, wa aṣliḥ lī sha’nī kullah lā ilāha illā Ant.",
    "reference": "The Messenger of Allah ﷺ said: “The supplications for the one who is distressed are [the above].” (Abu Dāwud 5090)",
    "virtue": ""
  },
  {
    "id": 191,
    "title": "Entrust All Your Matters to Allah",
    "categories": "Overwhelmed",
    "arabic": "يَا حَيُّ يَا قَيُّوْمُ ، بِرَحْمَتِكَ أَسْتَغِيْثُ ، أَصْلِحْ لِيْ شَأْنِيْ كُلَّهُ ، وَلَا تَكِلْنِيْ إِلَىٰ نَفْسِيْ طَرْفَةَ عَيْنٍ.",
    "translation": "O The Ever Living, The Sustainer of all. ; I seek assistance through Your mercy. Rectify all of my affairs and do not entrust me to myself for the blink of an eye.",
    "transliteration": "Yā Ḥayyu yā Qayyūm, bi-raḥmatika astaghīth, aṣliḥ lī sha’nī kullah, wa lā takilnī ilā nafsī ṭarfata ʿayn.",
    "reference": "Anas b. Mālik (raḍiy Allāhu ʿanhu) narrates that the Prophet ﷺ said to Fāṭimah (raḍiy Allāhu ʿanhā), “What is preventing you from (doing) what I am advising you; that you say [the above] in the morning and evening?” (Nasā’ī in ʿAmal al-Yawm wa-l-Laylah 570)",
    "virtue": ""
  },
  {
    "id": 192,
    "title": "Protection from Trials, Wretchedness, Bad Fate & the Gloating of Enemies",
    "categories": "Overwhelmed",
    "arabic": "اَللّٰهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنْ جَهْدِ الْبَلَاءِ ، وَدَرَكِ الشَّقَاءِ ، وَسُوْءِ الْقَضَاءِ ، وَشَمَاتَةِ الْأَعْدَاءِ.",
    "translation": "O Allah, I seek Your protection from severe trials, wretchedness, bad fate and that my enemies rejoice in my misery.",
    "transliteration": "Allāhumma innī aʿūdhu bika min jahdi-l-balā’, wa daraki-sh-shaqā’, wa sūi’-l-qaḍā’, wa shamātati-l-aʿdā’.",
    "reference": "Abū Hurayrah (raḍiy Allāhu ‘anhu) narrates that the Messenger of Allah ﷺ used to seek refuge with Allah from [the above]. (Bukhārī 6347)",
    "virtue": ""
  },
  {
    "id": 193,
    "title": "Duʿa of the Grief-stricken Prophet Yunus ﷺ",
    "categories": "Regret",
    "arabic": "لَآ إِلٰهَ إِلَّآ أَنْتَ سُبْحَانَكَ إِنِّيْ كُنْتُ مِنَ الظَّالِمِيْنَ",
    "translation": "There is no god worthy of worship except You. You are free from imperfection. Indeed, I have been of the wrongdoers. (21:87)",
    "transliteration": "Lā ilāha illā Anta subḥānaka innī kuntu mina-ẓ-ẓālimīn.",
    "reference": "",
    "virtue": ""
  },
  {
    "id": 194,
    "title": "Duʿa of Prophet Musa ﷺ for Forgiveness",
    "categories": "Regret",
    "arabic": "أَنْتَ وَلِيُّنَا فَاغْفِرْ لَنَا وَارْحَمْنَا ۖ وَأَنْتَ خَيْرُ الْغَافِرِيْنَ",
    "translation": "You are our Protector, so forgive us and have mercy upon us. You are the best of those who forgive. (7:155)",
    "transliteration": "Anta Walliyyunā fa-ghfir lanā war-ḥamnā wa Anta khayrul-ghāfirīn.",
    "reference": "",
    "virtue": ""
  },
  {
    "id": 195,
    "title": "Protect Yourself From Anxiety, Laziness, Debt etc",
    "categories": "Regret",
    "arabic": "اَللّٰهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ ، وَأَعُوْذُ بِكَ مِنَ الْعَجْزِ وَالْكَسَلِ، وَأَعُوْذُ بِكَ مِنَ الْجُبْنِ وَالْبُخْلِ ، وَأَعُوْذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ وَقَهْرِ الرِّجَالِ.",
    "translation": "O Allah, I seek Your protection from anxiety and grief. I seek Your protection from inability and laziness. I seek Your protection from cowardice and miserliness, and I seek Your protection from being overcome by debt and being overpowered by men.",
    "transliteration": "Allāhumma innī aʿūdhu bika min-l-hammi wa-l-ḥazan, wa aʿūdhu bika min-l-ʿajzi wa-l-kasal, wa aʿūdhu bika min-l-jubni wa-l-bukhl, wa aʿūdhu bika min ghalabati-d-dayni wa qahri-r-rijāl.",
    "reference": "",
    "virtue": "Abū Saʿīd al-Khudrī (raḍiy Allāhu ʿanhu) narrated that one day, the Messenger of Allah ﷺ entered the masjid. He saw a man from the Anṣār called Abū Umāmah (raḍiy Allāhu ʿanhu). He ﷺ asked, “What is the matter? Why are you sitting in the mosque when it is not the time for prayer?” He replied, “Never-ending worries and debts, O Messenger of Allah.” The Messenger of Allah ﷺ then asked, “Shall I not teach you words by which, when you say them, Allah will remove your worries, and settle your debts?” He replied, “Yes of course, O Messenger of Allah.” He ﷺ said, “Say in the morning and evening [the above].” Abū Umāmah (raḍiy Allāhu ʿanhu) said, “Then I did that, and Allah removed my worries and settled my debts.” (Abū Dāwūd 1555)"
  },
  {
    "id": 196,
    "title": "Duʿa of Prophet Adam ﷺ and Hawwa for Forgiveness",
    "categories": "Regret",
    "arabic": "رَبَّنَا ظَلَمْنَآ أَنْفُسَنَا وَإِنْ لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُوْنَنَّ مِنَ الْخٰسِرِيْنَ",
    "translation": "Our Lord, we have wronged ourselves. If You do not forgive us and have mercy upon us, we will surely be amongst the losers. (7:23)",
    "transliteration": "Rabbanā ẓalamnā anfusanā wa il-lam taghfir lanā wa tarḥamnā la-nakūnanna minal-khāsīrīn.",
    "reference": "",
    "virtue": ""
  },
  {
    "id": 197,
    "title": "Duʿa of the Pious for Forgiveness & Protection From the Hell-fire",
    "categories": "Regret",
    "arabic": "رَبَّنَآ إِنَّنَآ اٰمَنَّا فَاغْفِرْ لَنَا ذُنُوْبَنَا وَقِنَا عَذَابَ النَّارِ",
    "translation": "Our Lord, indeed we have believed, so forgive us our sins and protect us from the punishment of the Fire. (3:16)",
    "transliteration": "Rabbanā in-nanā āmannā fa-ghfir lanā dhunūbanā wa qinā ʿadhāba-n-nār.",
    "reference": "",
    "virtue": ""
  },
  {
    "id": 198,
    "title": "Duʿa of the Slaves of Allah for Forgiveness & Mercy",
    "categories": "Regret",
    "arabic": "رَبَّنَآ اٰمَنَّا فَاغْفِرْ لَنَا وَارْحَمْنَا وَأَنْتَ خَيْرُ الرّٰحِمِيْنَ",
    "translation": "Our Lord, we have believed, so forgive us and have mercy upon us: You are the Best of those who are merciful. (23:109)",
    "transliteration": "Rabbanā āmannā fa-ghfir lanā war-ḥamnā wa Anta khayru-r-rāḥimīn.",
    "reference": "",
    "virtue": ""
  },
  {
    "id": 199,
    "title": "Duʿa for Forgiveness & Mercy",
    "categories": "Regret",
    "arabic": "رَبِّ اغْفِرْ وَارْحَمْ وَأَنْتَ خَيْرُ الرّٰحِمِيْنَ",
    "translation": "My Lord, forgive and have mercy. You are the Best of those who are merciful. (23:118)",
    "transliteration": "Rabbi-ghfir wa-rḥam wa Anta khayru-r-rāḥimīn.",
    "reference": "",
    "virtue": ""
  },
  {
    "id": 200,
    "title": "Surah al-Fatihah: The Greatest Duʿa",
    "categories": "Sad",
    "arabic": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ ، \nاَلْحَمْدُ لِلّٰهِ رَبِّ الْعَالَمِيْنَ ، الرَّحْمٰنِ الرَّحِيْمِ ، مٰلِكِ يَوْمِ الدِّيْنِ ، إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِيْنُ ، اِهْدِنَا الصِّرَاطَ الْمُسْتَقِيْمَ ، صِرَاطَ الَّذِيْنَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوْبِ عَلَيْهِمْ وَلَا الضَّآلِّيْنَ",
    "translation": "In the name of Allah, the All-Merciful, the Very Merciful. All praises and thanks are for Allah, the Lord of all the worlds, The All-Merciful, The Very Merciful, Master of the Day of Judgement. You Alone we worship, You Alone we ask for help. Guide us on the Straight Path, the path of those whom You have favoured, not of those who incur (Your) anger nor of those who have gone astray. (1:1-7)",
    "transliteration": "Bismi-llāhi-r-Raḥmāni-r-Raḥīm. Alḥamdu-lillāhi Rabbi-l-ʿālamīn, ar-Raḥmāni-r-Raḥīm, Māliki yawmi-d-dīn, iyyāka naʿbudu wa iyyāka nastaʿīn, ihdina-ṣ-Ṣirāṭa-l-Mustaqīm, ṣirāṭa-lladhīna anʿamta ʿalayhim ghayri-l-maghḍūbi ʿālayhim wa la-ḍ-ḍāllīn.",
    "reference": "",
    "virtue": ""
  },
  {
    "id": 201,
    "title": "When Something You Dislike Happens #1",
    "categories": "Sad",
    "arabic": "اَلْحَمْدُ لِلّٰهِ عَلَىٰ كُلِّ حَالٍ",
    "translation": "All praise is for Allah in every situation.",
    "transliteration": "Al-ḥamdu li-llāhi ʿalā kulli ḥāl.",
    "reference": "When the Messenger of Allah ﷺ saw anything which displeased him, he used to say [the above]. (Ibn Mājah 3803, Ibn al-Sunnī 378)",
    "virtue": ""
  },
  {
    "id": 202,
    "title": "When Something You Dislike Happens #2",
    "categories": "Sad",
    "arabic": "قَدَّرَ اللّٰهُ وَمَا شَاءَ فَعَلَ",
    "translation": "Allah has decreed and He does whatever He wills.",
    "transliteration": "Qaddara-llāhu wa mā shā’a faʿal.",
    "reference": "The Messenger of Allah ﷺ said: “A strong believer is better and more beloved to Allah than a weak believer, and there is good in everyone. Be keen on what benefits you and seek help from Allah, and do not give up. If anything afflicts you, do not say: ‘If I had done (something else), such and such would have happened.’ But say [the above], for (the utterance) ‘If’ provides an opening for the deeds of the devil.” (Muslim 2664)",
    "virtue": ""
  },
  {
    "id": 203,
    "title": "When Difficulties Make You Yearn for Death",
    "categories": "Sad",
    "arabic": "اَللّٰهُمَّ أَحْيِنِيْ مَا كَانَتِ الْحَيَاةُ خَيْرًا لِيْ ، وَتَوَفَّنِيْ إِذَا كَانَتِ الْوَفَاةُ خَيْرًا لِيْ",
    "translation": "O Allah, let me live as long as life is better for me; and give me death when death is better for me.",
    "transliteration": "Allāhumma aḥyinī mā kānati-l-ḥayātu khayral-lī, wa tawaffanī idhā kānati-l-wafātu khayral-lī.",
    "reference": "The Messenger of Allah ﷺ said: “None of you should wish for death because of a difficulty that befalls him. Rather he should say [the above].” (Bukhārī 5671, Muslim 2680)",
    "virtue": ""
  },
  {
    "id": 204,
    "title": "Protect Yourself From Anxiety, Laziness, Debt etc",
    "categories": "Sad",
    "arabic": "اَللّٰهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ ، وَأَعُوْذُ بِكَ مِنَ الْعَجْزِ وَالْكَسَلِ، وَأَعُوْذُ بِكَ مِنَ الْجُبْنِ وَالْبُخْلِ ، وَأَعُوْذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ وَقَهْرِ الرِّجَالِ.",
    "translation": "O Allah, I seek Your protection from anxiety and grief. I seek Your protection from inability and laziness. I seek Your protection from cowardice and miserliness, and I seek Your protection from being overcome by debt and being overpowered by men.",
    "transliteration": "Allāhumma innī aʿūdhu bika min-l-hammi wa-l-ḥazan, wa aʿūdhu bika min-l-ʿajzi wa-l-kasal, wa aʿūdhu bika min-l-jubni wa-l-bukhl, wa aʿūdhu bika min ghalabati-d-dayni wa qahri-r-rijāl.",
    "reference": "",
    "virtue": "Abū Saʿīd al-Khudrī (raḍiy Allāhu ʿanhu) narrated that one day, the Messenger of Allah ﷺ entered the masjid. He saw a man from the Anṣār called Abū Umāmah (raḍiy Allāhu ʿanhu). He ﷺ asked, “What is the matter? Why are you sitting in the mosque when it is not the time for prayer?” He replied, “Never-ending worries and debts, O Messenger of Allah.” The Messenger of Allah ﷺ then asked, “Shall I not teach you words by which, when you say them, Allah will remove your worries, and settle your debts?” He replied, “Yes of course, O Messenger of Allah.” He ﷺ said, “Say in the morning and evening [the above].” Abū Umāmah (raḍiy Allāhu ʿanhu) said, “Then I did that, and Allah removed my worries and settled my debts.” (Abū Dāwūd 1555)"
  },
  {
    "id": 205,
    "title": "When Struck by a Calamity",
    "categories": "Sad",
    "arabic": "إِنَّا لِلّٰهِ وَإِنَّا إِلَيْهِ رَاجِعُوْنَ ، اَللّٰهُمَّ اْجُرْنِيْ فِيْ مُصِيْبَتِيْ ، وَأَخْلِفْ لِيْ خَيْرًا مِنْهَا",
    "translation": "To Allah we belong and unto Him is our return. O Allah, recompense me for my affliction and replace it for me with something better.",
    "transliteration": "Innā lillāhi wa innā ilayhi rājiʿūn, Allāhumma-‘jurnī fī muṣībatī, wa akhlif lī khayram-minha.",
    "reference": "",
    "virtue": "Umm Salamah (raḍiy Allāhu ‘anhā) said: I heard the Messenger of Allah ﷺ say, “There is no Muslim who is afflicted with a calamity, and then says what Allah has commanded him [the above supplication], except that Allah will recompense him with something better than it.” She says: “When Abū Salamah (her first husband) passed away, I said, ‘Which Muslim is better than Abū Salamah – the first household to migrate to the Messenger of Allah?’ I then said (the above duʿā’), and Allah recompensed me (by marrying me to) the Messenger of Allah ﷺ.” (Muslim 918)"
  },
  {
    "id": 206,
    "title": "Well-being in this World and the Hereafter",
    "categories": "Sad",
    "arabic": "اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَ الْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ ، اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِيْ دِيْنِيْ وَدُنْيَايَ وَأَهْلِيْ وَمَالِيْ ، اَللّٰهُمَّ اسْتُرْ عَوْرَاتِيْ وَآمِنْ رَوْعَاتِيْ ، اَللّٰهُمَّ احْفَظْنِيْ مِنْ بَيْنِ يَدَيَّ ، وَمِنْ خَلْفِيْ ، وَعَنْ يَّمِيْنِيْ ، وَعَنْ شِمَالِيْ ، وَمِنْ فَوْقِيْ ، وَأَعُوْذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِيْ.",
    "translation": "O Allah, I ask You for well-being in this world and the next. O Allah, I ask You for forgiveness and well-being in my religion, in my worldly affairs, in my family and in my wealth. O Allah, conceal my faults and calm my fears. O Allah, guard me from in front of me and behind me, from my right, and from my left, and from above me. I seek protection in Your Greatness from being unexpectedly destroyed from beneath me.",
    "transliteration": "Allāhumma innī as’aluka-l-ʿāfiyata fi-d-dunyā wa-l-ākhirah. Allāhumma innī as’aluka-l-ʿafwa wa-l-ʿāfiyata fī dīnī wa dunyāya wa ahlī wa mālī, Allāhumma-stur ʿawrātī wa āmin rawʿātī. Allāhumma-ḥfaẓnī mim bayni yadayya wa min khalfī, wa ʿay-yamīnī wa ʿan shimālī wa min fawqī, wa aʿūdhu bi-ʿaẓamatika an ughtāla min taḥtī.",
    "reference": "",
    "virtue": "ʿAbdullāh b. ʿUmar (raḍiy Allāhu ʿanhumā) narrated: “The Messenger of Allah ﷺ never failed to say these words in the morning and in the evening.” (Abū Dāwūd 5074)"
  },
  {
    "id": 207,
    "title": "Grief & Anxiety #1",
    "categories": "Sad",
    "arabic": "اَللّٰهُمَّ إِنِّيْ عَبْدُكَ ، وَابْنُ عَبْدِكَ ، وَابْنُ أَمَتِكَ ، نَاصِيَتِيْ بِيَدِكَ ، مَاضٍ فِيَّ حُكْمُكَ ، عَدْلٌ فِيَّ قَضَاؤُكَ ، أَسْأَلُكَ بِكُلِّ اسْمٍ هُوَ لَكَ ، سَمَّيْتَ بِهِ نَفْسَكَ ، أَوْ عَلَّمْتَهُ أَحَدًا مِنْ خَلْقِكَ ، أَوْ أَنْزَلْتَهُ فِيْ كِتَابِكَ ، أَوِ اسْتَأْثَرْتَ بِهِ فِيْ عِلْمِ الْغَيْبِ عِنْدَكَ ، أَنْ تَجْعَلَ الْقُرْآنَ رَبِيْعَ قَلْبِيْ ، وَنُوْرَ صَدْرِيْ وَجَلَاءَ حُزْنِيْ ، وَذَهَابَ هَمِّيْ",
    "translation": "O Allah, I am Your slave and the son of Your male slave and the son of Your female slave. My forehead is in Your Hand (i.e. you have control over me). I am subject to Your judgement and Your decree concerning me is just. I ask You – by every name that is Yours, by which You have named Yourself, or taught any one of Your creation, or revealed in Your Book, or kept unto Yourself in the knowledge of the unseen that is with You – to make the Qur’ān the spring of my heart, the light of my chest, the banisher of my grief and the reliever of my anxiety.",
    "transliteration": "Allāhumma innī ʿabduk, wa-bnu ʿabdik, wa-bnu amatik, nāṣiyatī bi-yadik, māḍin fiyya ḥukmuk, ʿadlun fiyya qaḍā’uk, as’aluka bi-kulli-smin huwa lak, sammayta bihi nafsak, aw ʿallamtahū aḥadam-min khalqik, aw anzaltahū fī Kitābik, awi-sta’tharta bihī fī ʿilmi-l-ghaybi ʿindak, an tajʿala-l-Qur’āna rabīʿa qalbī, wa nūra ṣadrī wa jalā’a ḥuznī, wa dhahāba hammī.",
    "reference": "",
    "virtue": "The Messenger of Allah ﷺ said: “There is no one amongst you who, when he is stricken with grief and anxiety, says [the above] except that Allah will remove his grief and anxiety, and will give him joy instead.” The companions said, ‘O Messenger of Allah, should we not learn these words?’ He ﷺ replied, ‘Of course! One who hears it should learn it.’” (Ahmad 3712)"
  },
  {
    "id": 208,
    "title": "Grief & Anxiety #2",
    "categories": "Sad",
    "arabic": "لَا إِلٰهَ إِلَّا اللّٰهُ الْعَظِيْمُ الْحَلِيْمُ ، لَا إِلٰهَ إِلَّا اللّٰهُ رَبُّ الْعَرْشِ الْعَظِيْمِ ، لَا إِلٰهَ إِلَّا اللّٰهُ رَبُّ السَّمٰـوٰتِ وَرَبُّ الْأَرْضِ وَرَبُّ الْعَرْشِ الْكَرِيْمِ",
    "translation": "There is no god but Allah, the Supreme, The Forbearing. There is no god but Allah, Lord of the Magnificent Throne. There is no god but Allah, Lord of the heavens, Lord of the earth, Lord of the Noble Throne.",
    "transliteration": "Lā ilāha illā-llāhu-l-ʿĀẓīmu-l-Ḥalīm, lā ilāha illā-llāhu Rabbu-l-ʿĀrshi-l-ʿAẓīm, lā ilāha illā-llāhu Rabbu-s-samāwāti wa Rabbu-l-arḍi wa Rabbu-l-ʿĀrshi-l-karīm.",
    "reference": "The Messenger of Allah ﷺ would invoke Allah at the time of distress with [the above]. (Bukhārī 6345, Muslim 2730)",
    "virtue": ""
  },
  {
    "id": 209,
    "title": "When One is Afraid of People",
    "categories": "Sad",
    "arabic": "اَللّٰهُمَّ اسْتُرْ عَوْرَاتِنَا وَاٰمِنْ رَوْعَاتِنَا",
    "translation": "O Allah, conceal our faults and assuage my fears.",
    "transliteration": "Allāhumma-stur ‘awrātinā wa āmin raw‘ātinā.",
    "reference": "Abū Sa‘īd al-Khuḍrī (raḍiy Allāhu ‘anhu) narrates: “We (the Companions) said on the Day of Khandaq (Trenches): ‘O Messenger of Allah, is there anything we can say? For the hearts have reached the throats (out of fear).’ He ﷺ replied: ‘Yes! (Say) [the above].’ Abū Sa‘īd al-Khuḍrī says: ‘Allah, Mighty and Majestic destroyed the faces of the enemy with wind and Allah made them face defeat through wind.’” (Ahmad 10613)",
    "virtue": ""
  },
  {
    "id": 210,
    "title": "When One Feels Frightened",
    "categories": "Sad",
    "arabic": "لَا إِلٰهَ إِلَّا اللّٰهُ",
    "translation": "There is no god but Allah.",
    "transliteration": "Lā ilāha illā-llāh.",
    "reference": "Zaynab bint Jaḥsh (raḍiy Allāhu ʿanhā) said that the Messenger of Allah ﷺ once came to her in a state of fear and said, [the above] Woe unto the Arabs from a danger that has come near. An opening has been made in the wall of Yājūj and Mājūj like this, making a circle with his thumb and index finger. Zaynab bint Jaḥsh said, “O Messenger of Allah ﷺ! Shall we be destroyed even though there are pious persons among us?” He said, “Yes, when evil (people) will increase.” (Bukhārī 3346)",
    "virtue": ""
  },
  {
    "id": 211,
    "title": "Allah Will Suffice You in Everything",
    "categories": "Sad",
    "arabic": "حَسْبِيَ اللّٰهُ لَا إِلٰهَ إِلَّا هُوَ ، عَلَيْهِ تَوَكَّلْتُ ، وَهُوَ رَبُّ الْعَرْشِ الْعَظِيْمِ.",
    "translation": "Allah is sufficient for me. There is no god worthy of worship except Him. I have placed my trust in Him only and He is the Lord of the Magnificent Throne.",
    "transliteration": "Ḥasbiya-Allāhu lā ilāha illā Huwa, ʿalayhi tawakkaltu, wa Huwa Rabbu-l-ʿArshi-l-ʿaẓīm.",
    "reference": "",
    "virtue": "Abū al-Dardā’ (raḍiy Allāhu ʿanhu) narrates from the Messenger of Allah ﷺ that he said: “Whoever recites [the above] seven times in the morning and in the evening, Allah will suffice him in everything that concerns him in matters of this world and the next.” (Ibn al-Sunnī 71)"
  },
  {
    "id": 212,
    "title": "Duʿa of Prophet Musa ﷺ Expressing His Dire Need",
    "categories": "Sad",
    "arabic": "رَبِّ إِنِّيْ لِمَآ أَنْزَلْتَ إِلَيَّ مِنْ خَيْرٍ فَقِيْرٌ",
    "translation": "My Lord, truly I am in dire need of any good which You may send me. (28:24)",
    "transliteration": "Rabbi innī limā anzalta illayya min khayrin faqīr.",
    "reference": "",
    "virtue": ""
  },
  {
    "id": 213,
    "title": "When Something Overwhelms You",
    "categories": "Sad",
    "arabic": "حَسْبِيَ اللّٰهُ وَنِعْمَ الْوَكِيْلُ",
    "translation": "Allah is enough for me and He is the Best Protector.",
    "transliteration": "Ḥasbiyallāhu wa niʿmal Wakīl.",
    "reference": "ʿAwf bin Mālik (raḍiy Allāhu ‘anhu) said that the Messenger of Allah ﷺ gave judgement between two men, and the one against whom the judgement was given said [the above] when he turned away. The Messenger ﷺ said: “Allah rebukes people for weakness. You must be strong. If something overwhelms you, say: [the above]. (Abū Dāwūd 3627)",
    "virtue": ""
  },
  {
    "id": 214,
    "title": "When One is Distressed",
    "categories": "Sad",
    "arabic": "اَللّٰهُمَّ رَحْمَتَكَ أَرْجُوْ فَلَا تَكِلْنِيْ إِلٰى نَفْسِيْ طَرْفَةَ عَيْنٍ ، وَأَصْلِحْ لِي شَأْنِيْ كُلَّهُ لَا إِلٰهَ إِلَّا أَنْتَ",
    "translation": "O Allah! Your Mercy is what I hope for so do not entrust me to myself for the blink of an eye, rectify all of my affairs. There is no god worthy of worship but You.",
    "transliteration": "Allāhumma raḥmataka arjū fa-lā takilnī ilā nafsī ṭarfata ʿayn, wa aṣliḥ lī sha’nī kullah lā ilāha illā Ant.",
    "reference": "The Messenger of Allah ﷺ said: “The supplications for the one who is distressed are [the above].” (Abu Dāwud 5090)",
    "virtue": ""
  },
  {
    "id": 215,
    "title": "Entrust All Your Matters to Allah",
    "categories": "Sad",
    "arabic": "يَا حَيُّ يَا قَيُّوْمُ ، بِرَحْمَتِكَ أَسْتَغِيْثُ ، أَصْلِحْ لِيْ شَأْنِيْ كُلَّهُ ، وَلَا تَكِلْنِيْ إِلَىٰ نَفْسِيْ طَرْفَةَ عَيْنٍ.",
    "translation": "O The Ever Living, The Sustainer of all. ; I seek assistance through Your mercy. Rectify all of my affairs and do not entrust me to myself for the blink of an eye.",
    "transliteration": "Yā Ḥayyu yā Qayyūm, bi-raḥmatika astaghīth, aṣliḥ lī sha’nī kullah, wa lā takilnī ilā nafsī ṭarfata ʿayn.",
    "reference": "Anas b. Mālik (raḍiy Allāhu ʿanhu) narrates that the Prophet ﷺ said to Fāṭimah (raḍiy Allāhu ʿanhā), “What is preventing you from (doing) what I am advising you; that you say [the above] in the morning and evening?” (Nasā’ī in ʿAmal al-Yawm wa-l-Laylah 570)",
    "virtue": ""
  },
  {
    "id": 216,
    "title": "For Difficult Times: All Your Prayers Answered",
    "categories": "Sad",
    "arabic": "لَآ إِلٰهَ إِلَّآ أَنْتَ سُبْحَانَكَ إِنِّيْ كُنْتُ مِنَ الظَّالِمِيْنَ",
    "translation": "There is no god worthy of worship except You; You are free from all imperfection. Indeed, I have been of the wrongdoers. (21:87)",
    "transliteration": "Lā ilāha illā Anta subḥānaka innī kuntu mina-ẓ-ẓālimīn.",
    "reference": "",
    "virtue": "The Messenger of Allah ﷺ said: “The supplication of Dhun-Nūn (Prophet Yūnus) when he supplicated, while in the belly of the whale was: [the above]. ”No Muslim man ever supplicates with [the above] except that Allah answers his supplication.” (Tirmidhī 3505)"
  },
  {
    "id": 217,
    "title": "Duʿa for Seeking Protection from Shaytan",
    "categories": "Sad",
    "arabic": "رَبِّ أَعُوْذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِيْنِ ، وَأَعُوذُ بِكَ رَبِّ أَنْ يَّحْضُرُوْنِ",
    "translation": "My Lord, I seek protection with You from the promptings of the devils; and I seek protection in You, my Lord, from their coming near me. (23:97-98)",
    "transliteration": "Rabbi aʿūdhu bika min hamazāti-sh-shayāṭīn. Wa aʿūdhu bika Rabbi ay-yaḥḍurūn.",
    "reference": "",
    "virtue": ""
  },
  {
    "id": 218,
    "title": "Protection from Evil Traits & Endings",
    "categories": "Sad",
    "arabic": "اَللّٰهُمَّ إِنّيْ أَعُوْذُ بِكَ مِنَ الْبُخْلِ ، وَأَعُوْذُ بِكَ مِنَ الْجُبْنِ ، وَأَعُوْذُ بِكَ أَنْ أُرَدَّ إِلَىٰ أَرْذَلِ الْعُمُرِ ، وَأَعُوْذُ بِكَ مِنْ فِتْنَةِ الدُّنْيَا ، وَأَعُوْذُ بِكَ مِنْ عَذَابِ الْقَبْرِ.",
    "translation": "O Allah, I seek Your protection from miserliness and I seek Your protection from cowardice. I seek Your protection from being returned to the worst part of life (old age), I seek Your protection from the trials of the world, and I seek Your protection from the punishment of the grave.",
    "transliteration": "Allāhumma innī aʿūdhu bika mina-l-bukhl, wa aʿūdhu bika mina-l-jubn, wa aʿūdhu bika an uradda ilā ardhali-l-ʿumur, wa aʿūdhu bika min fitnati-d-dunyā, wa aʿūdhu bika min ʿadhābi-l-qabr.",
    "reference": "Saʿd b. Abī Waqqās (radiy Allāhū ‘anhu) would instruct (to seek refuge) about five things [the above] and he would narrate it from the Messenger of Allah ﷺ . (Bukhārī 6370)",
    "virtue": ""
  },
  {
    "id": 219,
    "title": "After a Nightmare",
    "categories": "Scared",
    "arabic": "أَعُوْذُ بِكَلِمَاتِ اللّٰهِ التَّامَّاتِ مِنْ غَضَبِهِ وَعِقَابِهِ ، وَشَرِّ عِبَادِهِ ، وَمِنْ هَمَزَاتِ الشَّيَاطِيْنِ وَأَنْ يَّحْضُرُوْنِ.",
    "translation": "I seek protection in the perfect words of Allah from His anger and punishment, and from the evil of His servants, and from the evil suggestions of the devils and from them appearing to me.",
    "transliteration": "Aʿūdhu bi kalimāt-i-llāhi-t-tāmmāti min ghaḍabihi wa ʿiqābih, wa sharri ʿibādih, wa min hamazāti-sh-shayaṭīn wa an yaḥḍurūn.",
    "reference": "ʿAmr b. Shuʿayb narrated from his father, who narrated from his grandfather, that the Messenger of Allah ﷺ said: “When one of you becomes frightened during sleep, then let him say: [the above]. For verily, they shall not harm him.” He said: “So ʿAbdullah b. ʿAmr (raḍiy Allāhu ‘anhu) used to teach it to those of his children who attained maturity, and those of them who did not, he would write it on a sheet and then hang it around their neck.” (Tirmidhī 3528) \n\nThe Messenger of Allah ﷺ said: “A good dream is from Allah, so if anyone of you sees a dream which pleases him, he should not tell anybody about it except to the one whom he loves. And if he sees a dream which he dislikes, then he should seek Allah’s protection from its evil and from the evil of Shaytān. He should spit three times on his left and should not tell anybody about it, lest it might harm him.” (Bukhārī 6986)",
    "virtue": ""
  },
  {
    "id": 220,
    "title": "When One is Afraid of People #1",
    "categories": "Scared",
    "arabic": "اَللّٰهُمَّ اكْفِنِيْهِمْ بِمَا شِئْتَ",
    "translation": "O Allah, suffice me from them, with what You choose.",
    "transliteration": "Allāhumma-kfinīhim bimā shi’ta.",
    "reference": "Muslim 3005",
    "virtue": ""
  },
  {
    "id": 221,
    "title": "When One is Afraid of People #2",
    "categories": "Scared",
    "arabic": "حَسْبُنَا اللّٰهُ وَنِعْمَ الْوَكِيْلُ",
    "translation": "Allah is enough for us and He is the Best Protector.",
    "transliteration": "Ḥasbunallāhu wa niʿmal Wakīl.",
    "reference": "Ibn ʿAbbās (radiy Allāhū ‘anhumā) narrated: \"[the above] was said by Ibrāhīm (‘alayhis-salām) when he was thrown into the fire; and it was said by Muhammad ﷺ when they (i.e. the hypocrites) said, “A great army is gathering against you, therefore, fear them,” but it only increased their faith and they said: “Allah is Sufficient for us, and He is the Best Disposer (of affairs, for us).” (3.173) (Bukhārī 4563)",
    "virtue": ""
  },
  {
    "id": 222,
    "title": "When One is Afraid of People #3",
    "categories": "Scared",
    "arabic": "اَللّٰهُمَّ إِنَّا نَجْعَلُكَ فِيْ نُحُوْرِهِمْ ، وَنَعُوْذُ بِكَ مِنْ شُرُوْرِهِمْ",
    "translation": "O Allah, we make You our shield against them and we seek refuge in You from their evil.",
    "transliteration": "Allāhumma innā najʿaluka fī nuḥūrihim, wa naʿūdhu bika min shurūrihim.",
    "reference": "When the Messenger of Allah ﷺ was apprehensive of [a group] of people, he would say: [the above]. (Abū Dāwūd 1537)",
    "virtue": ""
  },
  {
    "id": 223,
    "title": "When One is Afraid of People #4",
    "categories": "Scared",
    "arabic": "اَللّٰهُمَّ أنْتَ عَضُدِيْ وَأَنْتَ نَصِيْرِيْ ، بِكَ أَحُوْلُ ، وبِكَ أصُوْلُ ، وَبِكَ أُقَاتِلُ",
    "translation": "O Allah, You are my aid and helper; by You I move, by You I attack, and by You I fight.",
    "transliteration": "Allāhumma Anta Aḍudī wa Anta Naṣīrī, Bika aḥūlu, wa bika aṣūlu, wa bika uqātil.",
    "reference": "Anas b. Mālik (raḍiy Allāhu ‘anhu) narrated that when the Messenger of Allah ﷺ went on an expedition, he said [the above].” (Abū Dāwūd 2632)",
    "virtue": ""
  },
  {
    "id": 224,
    "title": "When One is Afraid of People #5",
    "categories": "Scared",
    "arabic": "اَللّٰهُمَّ اسْتُرْ عَوْرَاتِنَا وَاٰمِنْ رَوْعَاتِنَا",
    "translation": "O Allah, conceal our faults and assuage my fears.",
    "transliteration": "Allāhumma-stur ‘awrātinā wa āmin raw‘ātinā.",
    "reference": "Abū Sa‘īd al-Khuḍrī (raḍiy Allāhu ‘anhu) narrates: “We (the Companions) said on the Day of Khandaq (Trenches): ‘O Messenger of Allah, is there anything we can say? For the hearts have reached the throats (out of fear).’ He ﷺ replied: ‘Yes! (Say) [the above].’ Abū Sa‘īd al-Khuḍrī says: ‘Allah, Mighty and Majestic destroyed the faces of the enemy with wind and Allah made them face defeat through wind.’” (Ahmad 10613)",
    "virtue": ""
  },
  {
    "id": 225,
    "title": "When Meeting the Enemy",
    "categories": "Scared",
    "arabic": "اللَّهُمَّ مُنْزِلَ الكِتَابِ ، ومُجْرِيَ السَّحَابِ ، وهَازِمَ الأحْزَابِ ، اهْزِمْهُمْ وانْصُرْنَا عَلَيْهِمْ",
    "translation": "O Allah, Revealer of the Book, Mover of the clouds, Defeater of the tribes, defeat them and grant us victory over them.",
    "transliteration": "Allāhumma munzila-l-kitāb, wa mujriya-s-saḥāb, wa hāzima-l-aḥzāb, ihzimhum wa-n-ṣurnā ʿalayhim.",
    "reference": "ʿAbdullāh b. Abī Awfā (raḍiy Allāhu ‘anhu) reported that the Messenger of Allah ﷺ, on one of the days that he met the enemy, waited until the sun rose, the stood among the people and said: “O people, do not look forward to meeting the enemy, but ask Allah for well-being. When you meet them, be steadfast. And know that Paradise is under the shadow of swords.” Then he said [the above]. (Bukhārī 3025)",
    "virtue": ""
  },
  {
    "id": 226,
    "title": "When One Feels Frightened",
    "categories": "Scared",
    "arabic": "لَا إِلٰهَ إِلَّا اللّٰهُ",
    "translation": "There is no god but Allah.",
    "transliteration": "Lā ilāha illā-llāh.",
    "reference": "Zaynab bint Jaḥsh (raḍiy Allāhu ʿanhā) said that the Messenger of Allah ﷺ once came to her in a state of fear and said, [the above] Woe unto the Arabs from a danger that has come near. An opening has been made in the wall of Yājūj and Mājūj like this, making a circle with his thumb and index finger. Zaynab bint Jaḥsh said, “O Messenger of Allah ﷺ! Shall we be destroyed even though there are pious persons among us?” He said, “Yes, when evil (people) will increase.” (Bukhārī 3346)",
    "virtue": ""
  },
  {
    "id": 227,
    "title": "When One Fears a Ruler",
    "categories": "Scared",
    "arabic": "اَللّٰهُمَّ رَبَّ السَّمٰـوٰتِ السَّبْعِ ، وَرَبَّ العَرْشِ العَظِيْمِ ، كُنْ لِيْ جَارًا مِنْ فُلَانِ بْنِ فُلَانٍ ، وَأَحْزَابِهِ مِنْ خَلَائِقِكَ ؛ أنْ يَّفْرُطَ عَلَىَّ أحَدٌ مِنهُمْ أوْ يَطْغٰى ، عَزَّ جَارُكَ ، وَجَلَّ ثَنَاؤُكَ ، وَلَا إِلٰهَ إِلَّا أَنْتَ",
    "translation": "O Allah, Lord of the seven heavens, Lord of the Magnificent Throne, be for me a support against [such and such a person] and his helpers from among your creatures, lest any of them abuse me or do me wrong. Mighty is Your patronage, and glorious are Your praises. There is none worthy of worship but You.",
    "transliteration": "Allāhumma Rabb-as-samāwāti-s-sabiʿ, wa Rabba-l-ʿArshi-l-ʿaẓīm, kun lī jāran min fulāni-bni-fulān, wa aḥzābihi min khalāiqiqa; ay-yafruṭa ʿalayya aḥadun minhum aw yaṭgā, ʿazza jāruk, wa jalla thanā’uk, wa lā ilāha illā Ant.",
    "reference": "ʿAbdullāh b. Masʿūd (raḍiy Allāhu ‘anhu) narrated that the Prophet ﷺ said: “When one of you fears a ruler, they should say [the above].” (Ṭabarānī in Muʿjam al-Kabīr)",
    "virtue": ""
  },
  {
    "id": 228,
    "title": "When One is Distressed",
    "categories": "Scared",
    "arabic": "اَللّٰهُمَّ رَحْمَتَكَ أَرْجُوْ فَلَا تَكِلْنِيْ إِلٰى نَفْسِيْ طَرْفَةَ عَيْنٍ ، وَأَصْلِحْ لِي شَأْنِيْ كُلَّهُ لَا إِلٰهَ إِلَّا أَنْتَ",
    "translation": "O Allah! Your Mercy is what I hope for so do not entrust me to myself for the blink of an eye, rectify all of my affairs. There is no god worthy of worship but You.",
    "transliteration": "Allāhumma raḥmataka arjū fa-lā takilnī ilā nafsī ṭarfata ʿayn, wa aṣliḥ lī sha’nī kullah lā ilāha illā Ant.",
    "reference": "The Messenger of Allah ﷺ said: “The supplications for the one who is distressed are [the above].” (Abu Dāwud 5090)",
    "virtue": ""
  },
  {
    "id": 229,
    "title": "Surah al-Fatihah: The Greatest Duʿa",
    "categories": "Suicidal",
    "arabic": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ ، \nاَلْحَمْدُ لِلّٰهِ رَبِّ الْعَالَمِيْنَ ، الرَّحْمٰنِ الرَّحِيْمِ ، مٰلِكِ يَوْمِ الدِّيْنِ ، إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِيْنُ ، اِهْدِنَا الصِّرَاطَ الْمُسْتَقِيْمَ ، صِرَاطَ الَّذِيْنَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوْبِ عَلَيْهِمْ وَلَا الضَّآلِّيْنَ",
    "translation": "In the name of Allah, the All-Merciful, the Very Merciful. All praises and thanks are for Allah, the Lord of all the worlds, The All-Merciful, The Very Merciful, Master of the Day of Judgement. You Alone we worship, You Alone we ask for help. Guide us on the Straight Path, the path of those whom You have favoured, not of those who incur (Your) anger nor of those who have gone astray. (1:1-7)",
    "transliteration": "Bismi-llāhi-r-Raḥmāni-r-Raḥīm. Alḥamdu-lillāhi Rabbi-l-ʿālamīn, ar-Raḥmāni-r-Raḥīm, Māliki yawmi-d-dīn, iyyāka naʿbudu wa iyyāka nastaʿīn, ihdina-ṣ-Ṣirāṭa-l-Mustaqīm, ṣirāṭa-lladhīna anʿamta ʿalayhim ghayri-l-maghḍūbi ʿālayhim wa la-ḍ-ḍāllīn.",
    "reference": "",
    "virtue": ""
  },
  {
    "id": 230,
    "title": "When Difficulties Make You Yearn for Death",
    "categories": "Suicidal",
    "arabic": "اَللّٰهُمَّ أَحْيِنِيْ مَا كَانَتِ الْحَيَاةُ خَيْرًا لِيْ ، وَتَوَفَّنِيْ إِذَا كَانَتِ الْوَفَاةُ خَيْرًا لِيْ",
    "translation": "O Allah, let me live as long as life is better for me; and give me death when death is better for me.",
    "transliteration": "Allāhumma aḥyinī mā kānati-l-ḥayātu khayral-lī, wa tawaffanī idhā kānati-l-wafātu khayral-lī.",
    "reference": "The Messenger of Allah ﷺ said: “None of you should wish for death because of a difficulty that befalls him. Rather he should say [the above].” (Bukhārī 5671, Muslim 2680)",
    "virtue": ""
  },
  {
    "id": 231,
    "title": "Protect Yourself From Anxiety, Laziness, Debt etc",
    "categories": "Suicidal",
    "arabic": "اَللّٰهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ ، وَأَعُوْذُ بِكَ مِنَ الْعَجْزِ وَالْكَسَلِ، وَأَعُوْذُ بِكَ مِنَ الْجُبْنِ وَالْبُخْلِ ، وَأَعُوْذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ وَقَهْرِ الرِّجَالِ.",
    "translation": "O Allah, I seek Your protection from anxiety and grief. I seek Your protection from inability and laziness. I seek Your protection from cowardice and miserliness, and I seek Your protection from being overcome by debt and being overpowered by men.",
    "transliteration": "Allāhumma innī aʿūdhu bika min-l-hammi wa-l-ḥazan, wa aʿūdhu bika min-l-ʿajzi wa-l-kasal, wa aʿūdhu bika min-l-jubni wa-l-bukhl, wa aʿūdhu bika min ghalabati-d-dayni wa qahri-r-rijāl.",
    "reference": "",
    "virtue": "Abū Saʿīd al-Khudrī (raḍiy Allāhu ʿanhu) narrated that one day, the Messenger of Allah ﷺ entered the masjid. He saw a man from the Anṣār called Abū Umāmah (raḍiy Allāhu ʿanhu). He ﷺ asked, “What is the matter? Why are you sitting in the mosque when it is not the time for prayer?” He replied, “Never-ending worries and debts, O Messenger of Allah.” The Messenger of Allah ﷺ then asked, “Shall I not teach you words by which, when you say them, Allah will remove your worries, and settle your debts?” He replied, “Yes of course, O Messenger of Allah.” He ﷺ said, “Say in the morning and evening [the above].” Abū Umāmah (raḍiy Allāhu ʿanhu) said, “Then I did that, and Allah removed my worries and settled my debts.” (Abū Dāwūd 1555)"
  },
  {
    "id": 232,
    "title": "Grief & Anxiety #1",
    "categories": "Suicidal",
    "arabic": "اَللّٰهُمَّ إِنِّيْ عَبْدُكَ ، وَابْنُ عَبْدِكَ ، وَابْنُ أَمَتِكَ ، نَاصِيَتِيْ بِيَدِكَ ، مَاضٍ فِيَّ حُكْمُكَ ، عَدْلٌ فِيَّ قَضَاؤُكَ ، أَسْأَلُكَ بِكُلِّ اسْمٍ هُوَ لَكَ ، سَمَّيْتَ بِهِ نَفْسَكَ ، أَوْ عَلَّمْتَهُ أَحَدًا مِنْ خَلْقِكَ ، أَوْ أَنْزَلْتَهُ فِيْ كِتَابِكَ ، أَوِ اسْتَأْثَرْتَ بِهِ فِيْ عِلْمِ الْغَيْبِ عِنْدَكَ ، أَنْ تَجْعَلَ الْقُرْآنَ رَبِيْعَ قَلْبِيْ ، وَنُوْرَ صَدْرِيْ وَجَلَاءَ حُزْنِيْ ، وَذَهَابَ هَمِّيْ",
    "translation": "O Allah, I am Your slave and the son of Your male slave and the son of Your female slave. My forehead is in Your Hand (i.e. you have control over me). I am subject to Your judgement and Your decree concerning me is just. I ask You – by every name that is Yours, by which You have named Yourself, or taught any one of Your creation, or revealed in Your Book, or kept unto Yourself in the knowledge of the unseen that is with You – to make the Qur’ān the spring of my heart, the light of my chest, the banisher of my grief and the reliever of my anxiety.",
    "transliteration": "Allāhumma innī ʿabduk, wa-bnu ʿabdik, wa-bnu amatik, nāṣiyatī bi-yadik, māḍin fiyya ḥukmuk, ʿadlun fiyya qaḍā’uk, as’aluka bi-kulli-smin huwa lak, sammayta bihi nafsak, aw ʿallamtahū aḥadam-min khalqik, aw anzaltahū fī Kitābik, awi-sta’tharta bihī fī ʿilmi-l-ghaybi ʿindak, an tajʿala-l-Qur’āna rabīʿa qalbī, wa nūra ṣadrī wa jalā’a ḥuznī, wa dhahāba hammī.",
    "reference": "",
    "virtue": "The Messenger of Allah ﷺ said: “There is no one amongst you who, when he is stricken with grief and anxiety, says [the above] except that Allah will remove his grief and anxiety, and will give him joy instead.” The companions said, ‘O Messenger of Allah, should we not learn these words?’ He ﷺ replied, ‘Of course! One who hears it should learn it.’” (Ahmad 3712)"
  },
  {
    "id": 233,
    "title": "Grief & Anxiety #2",
    "categories": "Suicidal",
    "arabic": "لَا إِلٰهَ إِلَّا اللّٰهُ الْعَظِيْمُ الْحَلِيْمُ ، لَا إِلٰهَ إِلَّا اللّٰهُ رَبُّ الْعَرْشِ الْعَظِيْمِ ، لَا إِلٰهَ إِلَّا اللّٰهُ رَبُّ السَّمٰـوٰتِ وَرَبُّ الْأَرْضِ وَرَبُّ الْعَرْشِ الْكَرِيْمِ",
    "translation": "There is no god but Allah, the Supreme, The Forbearing. There is no god but Allah, Lord of the Magnificent Throne. There is no god but Allah, Lord of the heavens, Lord of the earth, Lord of the Noble Throne.",
    "transliteration": "Lā ilāha illā-llāhu-l-ʿĀẓīmu-l-Ḥalīm, lā ilāha illā-llāhu Rabbu-l-ʿĀrshi-l-ʿAẓīm, lā ilāha illā-llāhu Rabbu-s-samāwāti wa Rabbu-l-arḍi wa Rabbu-l-ʿĀrshi-l-karīm.",
    "reference": "The Messenger of Allah ﷺ would invoke Allah at the time of distress with [the above]. (Bukhārī 6345, Muslim 2730)",
    "virtue": ""
  },
  {
    "id": 234,
    "title": "Allah Will Suffice You in Everything",
    "categories": "Suicidal",
    "arabic": "حَسْبِيَ اللّٰهُ لَا إِلٰهَ إِلَّا هُوَ ، عَلَيْهِ تَوَكَّلْتُ ، وَهُوَ رَبُّ الْعَرْشِ الْعَظِيْمِ.",
    "translation": "Allah is sufficient for me. There is no god worthy of worship except Him. I have placed my trust in Him only and He is the Lord of the Magnificent Throne.",
    "transliteration": "Ḥasbiya-Allāhu lā ilāha illā Huwa, ʿalayhi tawakkaltu, wa Huwa Rabbu-l-ʿArshi-l-ʿaẓīm.",
    "reference": "",
    "virtue": "Abū al-Dardā’ (raḍiy Allāhu ʿanhu) narrates from the Messenger of Allah ﷺ that he said: “Whoever recites [the above] seven times in the morning and in the evening, Allah will suffice him in everything that concerns him in matters of this world and the next.” (Ibn al-Sunnī 71)"
  },
  {
    "id": 235,
    "title": "Entrust All Your Matters to Allah",
    "categories": "Suicidal",
    "arabic": "يَا حَيُّ يَا قَيُّوْمُ ، بِرَحْمَتِكَ أَسْتَغِيْثُ ، أَصْلِحْ لِيْ شَأْنِيْ كُلَّهُ ، وَلَا تَكِلْنِيْ إِلَىٰ نَفْسِيْ طَرْفَةَ عَيْنٍ.",
    "translation": "O The Ever Living, The Sustainer of all. ; I seek assistance through Your mercy. Rectify all of my affairs and do not entrust me to myself for the blink of an eye.",
    "transliteration": "Yā Ḥayyu yā Qayyūm, bi-raḥmatika astaghīth, aṣliḥ lī sha’nī kullah, wa lā takilnī ilā nafsī ṭarfata ʿayn.",
    "reference": "Anas b. Mālik (raḍiy Allāhu ʿanhu) narrates that the Prophet ﷺ said to Fāṭimah (raḍiy Allāhu ʿanhā), “What is preventing you from (doing) what I am advising you; that you say [the above] in the morning and evening?” (Nasā’ī in ʿAmal al-Yawm wa-l-Laylah 570)",
    "virtue": ""
  },
  {
    "id": 236,
    "title": "For Difficult Times: All Your Prayers Answered",
    "categories": "Suicidal",
    "arabic": "لَآ إِلٰهَ إِلَّآ أَنْتَ سُبْحَانَكَ إِنِّيْ كُنْتُ مِنَ الظَّالِمِيْنَ",
    "translation": "There is no god worthy of worship except You; You are free from all imperfection. Indeed, I have been of the wrongdoers. (21:87)",
    "transliteration": "Lā ilāha illā Anta subḥānaka innī kuntu mina-ẓ-ẓālimīn.",
    "reference": "",
    "virtue": "The Messenger of Allah ﷺ said: “The supplication of Dhun-Nūn (Prophet Yūnus) when he supplicated, while in the belly of the whale was: [the above]. ”No Muslim man ever supplicates with [the above] except that Allah answers his supplication.” (Tirmidhī 3505)"
  },
  {
    "id": 237,
    "title": "Duʿa for Seeking Protection from Shaytan",
    "categories": "Suicidal",
    "arabic": "رَبِّ أَعُوْذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِيْنِ ، وَأَعُوذُ بِكَ رَبِّ أَنْ يَّحْضُرُوْنِ",
    "translation": "My Lord, I seek protection with You from the promptings of the devils; and I seek protection in You, my Lord, from their coming near me. (23:97-98)",
    "transliteration": "Rabbi aʿūdhu bika min hamazāti-sh-shayāṭīn. Wa aʿūdhu bika Rabbi ay-yaḥḍurūn.",
    "reference": "",
    "virtue": ""
  },
  {
    "id": 238,
    "title": "When One is Distressed",
    "categories": "Suicidal",
    "arabic": "اَللّٰهُمَّ رَحْمَتَكَ أَرْجُوْ فَلَا تَكِلْنِيْ إِلٰى نَفْسِيْ طَرْفَةَ عَيْنٍ ، وَأَصْلِحْ لِي شَأْنِيْ كُلَّهُ لَا إِلٰهَ إِلَّا أَنْتَ",
    "translation": "O Allah! Your Mercy is what I hope for so do not entrust me to myself for the blink of an eye, rectify all of my affairs. There is no god worthy of worship but You.",
    "transliteration": "Allāhumma raḥmataka arjū fa-lā takilnī ilā nafsī ṭarfata ʿayn, wa aṣliḥ lī sha’nī kullah lā ilāha illā Ant.",
    "reference": "The Messenger of Allah ﷺ said: “The supplications for the one who is distressed are [the above].” (Abu Dāwud 5090)",
    "virtue": ""
  },
  {
    "id": 239,
    "title": "The Ultimate Duʿa",
    "categories": "Suicidal",
    "arabic": "اَللّٰهُمَّ بِعِلْمِكَ الْغَيْبَ ، وَقُدْرَتِكَ عَلَى الْخَلْقِ ، أَحْيِنِيْ مَا عَلِمْتَ الْحَيَاةَ خَيْرًا لِّيْ ، وَتَوَفَّنِيْ إِذَا عَلِمْتَ الْوَفَاةَ خَيْرًا لِّيْ ، اَللّٰهُمَّ وَأَسْأَلُكَ خَشْيَتَكَ فِي الْغَيْبِ وَالشَّهَادَةِ ، وَأَسْأَلُكَ كَلِمَةَ الْحَقِّ فِي الرِّضَا وَالْغَضَبِ ، وَأَسْأَلُكَ الْقَصْدَ فِي الْفَقْرِ وَالْغِنَىٰ ، وَأَسْأَلُكَ نَعِيْمًا لَّا يَنْفَدُ ، وَأَسْأَلُكَ قُرَّةَ عَيْنٍ لَّا تَنْقَطِعُ ، وَأَسْأَلُكَ الرِّضَا بَعْدَ الْقَضَاءِ ، وَأَسْأَلُكَ بَرْدَ الْعَيْشِ بَعْدَ الْمَوْتِ ، وَأَسْأَلُكَ لَذَّةَ النَّظَرِ إِلَىٰ وَجْهِكَ ، وَالشَّوْقَ إِلَىٰ لِقَائِكَ ، فِيْ غَيْرِ ضَرَّاءَ مُضِرَّةٍ ، وَلَا فِتْنَةٍ مُّضِلَّةٍ ، اَللّٰهُمَّ زَيِّنَّا بِزِيْنَةِ الْإِيْمَانِ ، وَاجْعَلْنَا هُدَاةً مُّهْتَدِيْنَ",
    "translation": "O Allah, with Your knowledge of the unseen and Your absolute power over the creation, let me live in this world as long as You know my living is good for me; and give me death when You know death is better for me. O Allah, I ask You for Your fear in private and in public, and for the word of truth in times of joy and anger. I ask You for moderation in poverty and in wealth. I ask You for endless blessings and perpetual delights. I ask You to make me pleased with destiny; for a cool and comfortable life after death; for the pleasure of seeing Your Face; and for the longing to meet You, without any painful ordeals and tribulations that misguide. O Allah, adorn us with the beauty of faith, and make us those who guide others and are guided themselves.",
    "transliteration": "Allāhumma bi-ʿilmika-l-ghayb, wa qudratika ʿala-l-khalq, aḥyinī mā kānati-l-ḥayātu khayra-l-lī, wa tawaffanī idhā kānati-l-wafātu khayra-l-lī, Allāhumma innī as’aluka khashyataka fi-l-ghaybi wa-sh-shahādah, wa as’aluka kalimata-l-ḥaqqi fi-r-riḍā wa-l-ghaḍab, wa as’aluka-l-qaṣda fi-l-faqr wa-l-ghinā, wa as’aluka naʿīma-l-lā yanfad, wa as’aluka qurrata ʿayni-l-lā tanqaṭiʿ, wa as’aluka-r-riḍā baʿda-l-qaḍā, wa as’aluka barda-l-ʿayshi baʿda-l-mawt, wa as’aluka ladh-dhata-n-naẓari ilā wajhik, wa-sh-shawqa ilā liqā’ik, fī ghayri ḍarrā’a muḍirrah, wa lā fitnati-m-muḍillah, Allāhumma zayyinnā bi-zīnati-l-īmān, wa-jʿalnā hudāta-m-muhtadīn.",
    "reference": "ʿAtā b. As-Sā’ib narrated that his father said: “ʿAmmār b. Yāsir (raḍiy Allāhu ‘anhu) led us in prayer and he made it brief. Some of the people said to him: ‘You made the prayer short (or brief).’ He said: ‘Nevertheless I still recited supplications that I heard from the Messenger of Allah ﷺ.’ When he got up and left, a man- he was my father but he did not name himself- followed him and asked him about that supplication, then he came and told the people [the above].” (Nasā’ī 1305)",
    "virtue": ""
  },
  {
    "id": 240,
    "title": "Duʿa of Prophet Ayyub ﷺ for Times of Distress",
    "categories": "Suicidal",
    "arabic": "-رَبِّ- أَنِّيْ مَسَّنِيَ الضُّرُّ وَأَنْتَ أَرْحَمُ الرّٰحِمِيْنَ",
    "translation": "(My Lord), indeed adversity has touched me, and you are the Most Merciful of the merciful. (21:83)",
    "transliteration": "(Rabbi) Annī massaniya-ḍ-ḍurru wa Anta Arḥamu-r-raḥimīn.",
    "reference": "",
    "virtue": ""
  },
  {
    "id": 241,
    "title": "Protection from Evil Traits & Endings",
    "categories": "Suicidal",
    "arabic": "اَللّٰهُمَّ إِنّيْ أَعُوْذُ بِكَ مِنَ الْبُخْلِ ، وَأَعُوْذُ بِكَ مِنَ الْجُبْنِ ، وَأَعُوْذُ بِكَ أَنْ أُرَدَّ إِلَىٰ أَرْذَلِ الْعُمُرِ ، وَأَعُوْذُ بِكَ مِنْ فِتْنَةِ الدُّنْيَا ، وَأَعُوْذُ بِكَ مِنْ عَذَابِ الْقَبْرِ.",
    "translation": "O Allah, I seek Your protection from miserliness and I seek Your protection from cowardice. I seek Your protection from being returned to the worst part of life (old age), I seek Your protection from the trials of the world, and I seek Your protection from the punishment of the grave.",
    "transliteration": "Allāhumma innī aʿūdhu bika mina-l-bukhl, wa aʿūdhu bika mina-l-jubn, wa aʿūdhu bika an uradda ilā ardhali-l-ʿumur, wa aʿūdhu bika min fitnati-d-dunyā, wa aʿūdhu bika min ʿadhābi-l-qabr.",
    "reference": "Saʿd b. Abī Waqqās (radiy Allāhū ‘anhu) would instruct (to seek refuge) about five things [the above] and he would narrate it from the Messenger of Allah ﷺ . (Bukhārī 6370)",
    "virtue": ""
  },
  {
    "id": 242,
    "title": "Protect Yourself From Anxiety, Laziness, Debt etc",
    "categories": "Tired",
    "arabic": "اَللّٰهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ ، وَأَعُوْذُ بِكَ مِنَ الْعَجْزِ وَالْكَسَلِ، وَأَعُوْذُ بِكَ مِنَ الْجُبْنِ وَالْبُخْلِ ، وَأَعُوْذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ وَقَهْرِ الرِّجَالِ.",
    "translation": "O Allah, I seek Your protection from anxiety and grief. I seek Your protection from inability and laziness. I seek Your protection from cowardice and miserliness, and I seek Your protection from being overcome by debt and being overpowered by men.",
    "transliteration": "Allāhumma innī aʿūdhu bika min-l-hammi wa-l-ḥazan, wa aʿūdhu bika min-l-ʿajzi wa-l-kasal, wa aʿūdhu bika min-l-jubni wa-l-bukhl, wa aʿūdhu bika min ghalabati-d-dayni wa qahri-r-rijāl.",
    "reference": "",
    "virtue": "Abū Saʿīd al-Khudrī (raḍiy Allāhu ʿanhu) narrated that one day, the Messenger of Allah ﷺ entered the masjid. He saw a man from the Anṣār called Abū Umāmah (raḍiy Allāhu ʿanhu). He ﷺ asked, “What is the matter? Why are you sitting in the mosque when it is not the time for prayer?” He replied, “Never-ending worries and debts, O Messenger of Allah.” The Messenger of Allah ﷺ then asked, “Shall I not teach you words by which, when you say them, Allah will remove your worries, and settle your debts?” He replied, “Yes of course, O Messenger of Allah.” He ﷺ said, “Say in the morning and evening [the above].” Abū Umāmah (raḍiy Allāhu ʿanhu) said, “Then I did that, and Allah removed my worries and settled my debts.” (Abū Dāwūd 1555)"
  },
  {
    "id": 243,
    "title": "Ask Allah For Good Health and Protection",
    "categories": "Tired",
    "arabic": "اَللّٰهُمَّ عَافِنِيْ فِيْ بَدَنِيْ ، اَللّٰهُمَّ عَافِنِيْ فِيْ سَمْعِيْ ، اَللّٰهُمَّ عَافِنِيْ فِيْ بَصَرِيْ ، لَا إِلٰهَ إِلَّا أَنْتَ ، اَللّٰهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنَ الْكُفْرِ وَالْفَقْرِ، وأَعُوْذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، لَا إِلٰهَ إِلَّا أَنْتَ.",
    "translation": "O Allah, grant me well-being in my body. O Allah, grant me well-being in my hearing. O Allah, grant me well-being in my sight. There is no god worthy of worship except You. O Allah, I seek Your protection from disbelief and poverty and I seek Your protection from the punishment of the grave. There is no god worthy of worship except You.",
    "transliteration": "Allāhumma ʿāfinī fī badanī, Allāhumma ʿāfinī fī samʿī, Allāhumma ʿāfinī fī baṣarī, lā ilāha illā Ant, Allāhumma innī aʿūdhu bika mina-l-kufri wa-l-faqr, wa aʿūdhu bika min ʿadhābi-l-qabr, lā ilāha illā Ant.",
    "reference": "‘Abd al-Raḥmān b. Abī Bakrah (raḍiy Allāhu ʿanhu) narrates that he said to his father, “O my father! I hear you supplicating with [the above] every morning. You repeat them three times in the morning and three times in the evening.” He said, “Indeed I heard the Messenger of Allah ﷺ supplicating with these (words) and I love to follow his practice.” (Abū Dāwūd 5090, Aḥmad 20430)",
    "virtue": ""
  },
  {
    "id": 244,
    "title": "Allah Will Suffice You in Everything",
    "categories": "Tired",
    "arabic": "حَسْبِيَ اللّٰهُ لَا إِلٰهَ إِلَّا هُوَ ، عَلَيْهِ تَوَكَّلْتُ ، وَهُوَ رَبُّ الْعَرْشِ الْعَظِيْمِ.",
    "translation": "Allah is sufficient for me. There is no god worthy of worship except Him. I have placed my trust in Him only and He is the Lord of the Magnificent Throne.",
    "transliteration": "Ḥasbiya-Allāhu lā ilāha illā Huwa, ʿalayhi tawakkaltu, wa Huwa Rabbu-l-ʿArshi-l-ʿaẓīm.",
    "reference": "",
    "virtue": "Abū al-Dardā’ (raḍiy Allāhu ʿanhu) narrates from the Messenger of Allah ﷺ that he said: “Whoever recites [the above] seven times in the morning and in the evening, Allah will suffice him in everything that concerns him in matters of this world and the next.” (Ibn al-Sunnī 71)"
  },
  {
    "id": 245,
    "title": "Duʿa of Prophet Musa ﷺ Expressing His Dire Need",
    "categories": "Tired",
    "arabic": "رَبِّ إِنِّيْ لِمَآ أَنْزَلْتَ إِلَيَّ مِنْ خَيْرٍ فَقِيْرٌ",
    "translation": "My Lord, truly I am in dire need of any good which You may send me. (28:24)",
    "transliteration": "Rabbi innī limā anzalta illayya min khayrin faqīr.",
    "reference": "",
    "virtue": ""
  },
  {
    "id": 246,
    "title": "Entrust All Your Matters to Allah",
    "categories": "Tired",
    "arabic": "يَا حَيُّ يَا قَيُّوْمُ ، بِرَحْمَتِكَ أَسْتَغِيْثُ ، أَصْلِحْ لِيْ شَأْنِيْ كُلَّهُ ، وَلَا تَكِلْنِيْ إِلَىٰ نَفْسِيْ طَرْفَةَ عَيْنٍ.",
    "translation": "O The Ever Living, The Sustainer of all. ; I seek assistance through Your mercy. Rectify all of my affairs and do not entrust me to myself for the blink of an eye.",
    "transliteration": "Yā Ḥayyu yā Qayyūm, bi-raḥmatika astaghīth, aṣliḥ lī sha’nī kullah, wa lā takilnī ilā nafsī ṭarfata ʿayn.",
    "reference": "Anas b. Mālik (raḍiy Allāhu ʿanhu) narrates that the Prophet ﷺ said to Fāṭimah (raḍiy Allāhu ʿanhā), “What is preventing you from (doing) what I am advising you; that you say [the above] in the morning and evening?” (Nasā’ī in ʿAmal al-Yawm wa-l-Laylah 570)",
    "virtue": ""
  },
  {
    "id": 247,
    "title": "Duʿa of Prophet Musa ﷺ Expressing His Dire Need",
    "categories": "Unloved",
    "arabic": "رَبِّ إِنِّيْ لِمَآ أَنْزَلْتَ إِلَيَّ مِنْ خَيْرٍ فَقِيْرٌ",
    "translation": "My Lord, truly I am in dire need of any good which You may send me. (28:24)",
    "transliteration": "Rabbi innī limā anzalta illayya min khayrin faqīr.",
    "reference": "",
    "virtue": ""
  },
  {
    "id": 248,
    "title": "Well-being in this World and the Hereafter",
    "categories": "Unloved",
    "arabic": "اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَ الْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ ، اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِيْ دِيْنِيْ وَدُنْيَايَ وَأَهْلِيْ وَمَالِيْ ، اَللّٰهُمَّ اسْتُرْ عَوْرَاتِيْ وَآمِنْ رَوْعَاتِيْ ، اَللّٰهُمَّ احْفَظْنِيْ مِنْ بَيْنِ يَدَيَّ ، وَمِنْ خَلْفِيْ ، وَعَنْ يَّمِيْنِيْ ، وَعَنْ شِمَالِيْ ، وَمِنْ فَوْقِيْ ، وَأَعُوْذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِيْ.",
    "translation": "O Allah, I ask You for well-being in this world and the next. O Allah, I ask You for forgiveness and well-being in my religion, in my worldly affairs, in my family and in my wealth. O Allah, conceal my faults and calm my fears. O Allah, guard me from in front of me and behind me, from my right, and from my left, and from above me. I seek protection in Your Greatness from being unexpectedly destroyed from beneath me.",
    "transliteration": "Allāhumma innī as’aluka-l-ʿāfiyata fi-d-dunyā wa-l-ākhirah. Allāhumma innī as’aluka-l-ʿafwa wa-l-ʿāfiyata fī dīnī wa dunyāya wa ahlī wa mālī, Allāhumma-stur ʿawrātī wa āmin rawʿātī. Allāhumma-ḥfaẓnī mim bayni yadayya wa min khalfī, wa ʿay-yamīnī wa ʿan shimālī wa min fawqī, wa aʿūdhu bi-ʿaẓamatika an ughtāla min taḥtī.",
    "reference": "",
    "virtue": "ʿAbdullāh b. ʿUmar (raḍiy Allāhu ʿanhumā) narrated: “The Messenger of Allah ﷺ never failed to say these words in the morning and in the evening.” (Abū Dāwūd 5074)"
  },
  {
    "id": 249,
    "title": "Loving Allah & What He Loves",
    "categories": "Unloved",
    "arabic": "اَللّٰهُمَّ ارْزُقْـنِيْ حُبَّكَ ، وَحُبَّ مَنْ يَّنْفَعُنِيْ حُبُّهُ عِنْدَكَ ، اَللّٰهُمَّ مَا رَزَقْتَنِيْ مِمَّا أُحِبُّ فَاجْعَلْهُ قُوَّةً لِّيْ فِيْمَا تُحِبُّ ، اَللّٰهُمَّ مَا زَوَيْتَ عَنِّيْ مِمَّا أُحِبُّ فَاجْعَلْهُ فَرَاغًا لِّيْ فِيْمَا تُحِبُّ",
    "translation": "O Allah, grant me Your love and the love of those whose love will benefit me with You. O Allah, whatever You have provided me of the things that I love, make them a source of strength for me in pursuing what You love. O Allah, whatever you have withheld from me from what I love, make its absence a means for me to pursue what You love.",
    "transliteration": "Allāhumma-r-zuqnī ḥubbak, wa ḥubba ma-y-yanfaʿunī ḥubbuhu ʿindak, Allāhumma mā razaqtanī mim-mā uḥibbu fa-jʿalhu quwwata-l-lī fīmā tuḥibb, Allāhumma mā zawayta ʿannī mim-mā uḥibbu fa-jʿalhu farāgha-l-lī fīmā tuḥibb.",
    "reference": "ʿAbdullāh b. Yazīd Al-Khatmī Al-Ansarī (raḍiy Allāhu ‘anhu) narrated that the Messenger of Allah used to say [the above] in his supplication. (Tirmidhī 3491)",
    "virtue": ""
  },
  {
    "id": 250,
    "title": "When One is Afraid of People",
    "categories": "Unloved",
    "arabic": "حَسْبُنَا اللّٰهُ وَنِعْمَ الْوَكِيْلُ",
    "translation": "Allah is enough for us and He is the Best Protector.",
    "transliteration": "Ḥasbunallāhu wa niʿmal Wakīl.",
    "reference": "Ibn ʿAbbās (radiy Allāhū ‘anhumā) narrated: \"[the above] was said by Ibrāhīm (‘alayhis-salām) when he was thrown into the fire; and it was said by Muhammad ﷺ when they (i.e. the hypocrites) said, “A great army is gathering against you, therefore, fear them,” but it only increased their faith and they said: “Allah is Sufficient for us, and He is the Best Disposer (of affairs, for us).” (3.173) (Bukhārī 4563)",
    "virtue": ""
  },
  {
    "id": 251,
    "title": "Allah Will Suffice You in Everything",
    "categories": "Unloved",
    "arabic": "حَسْبِيَ اللّٰهُ لَا إِلٰهَ إِلَّا هُوَ ، عَلَيْهِ تَوَكَّلْتُ ، وَهُوَ رَبُّ الْعَرْشِ الْعَظِيْمِ.",
    "translation": "Allah is sufficient for me. There is no god worthy of worship except Him. I have placed my trust in Him only and He is the Lord of the Magnificent Throne.",
    "transliteration": "Ḥasbiya-Allāhu lā ilāha illā Huwa, ʿalayhi tawakkaltu, wa Huwa Rabbu-l-ʿArshi-l-ʿaẓīm.",
    "reference": "",
    "virtue": "Abū al-Dardā’ (raḍiy Allāhu ʿanhu) narrates from the Messenger of Allah ﷺ that he said: “Whoever recites [the above] seven times in the morning and in the evening, Allah will suffice him in everything that concerns him in matters of this world and the next.” (Ibn al-Sunnī 71)"
  },
  {
    "id": 252,
    "title": "Entrust All Your Matters to Allah",
    "categories": "Unloved",
    "arabic": "يَا حَيُّ يَا قَيُّوْمُ ، بِرَحْمَتِكَ أَسْتَغِيْثُ ، أَصْلِحْ لِيْ شَأْنِيْ كُلَّهُ ، وَلَا تَكِلْنِيْ إِلَىٰ نَفْسِيْ طَرْفَةَ عَيْنٍ.",
    "translation": "O The Ever Living, The Sustainer of all. ; I seek assistance through Your mercy. Rectify all of my affairs and do not entrust me to myself for the blink of an eye.",
    "transliteration": "Yā Ḥayyu yā Qayyūm, bi-raḥmatika astaghīth, aṣliḥ lī sha’nī kullah, wa lā takilnī ilā nafsī ṭarfata ʿayn.",
    "reference": "Anas b. Mālik (raḍiy Allāhu ʿanhu) narrates that the Prophet ﷺ said to Fāṭimah (raḍiy Allāhu ʿanhā), “What is preventing you from (doing) what I am advising you; that you say [the above] in the morning and evening?” (Nasā’ī in ʿAmal al-Yawm wa-l-Laylah 570)",
    "virtue": ""
  },
  {
    "id": 253,
    "title": "When Something You Dislike Happens",
    "categories": "Weak",
    "arabic": "قَدَّرَ اللّٰهُ وَمَا شَاءَ فَعَلَ",
    "translation": "Allah has decreed and He does whatever He wills.",
    "transliteration": "Qaddara-llāhu wa mā shā’a faʿal.",
    "reference": "The Messenger of Allah ﷺ said: “A strong believer is better and more beloved to Allah than a weak believer, and there is good in everyone. Be keen on what benefits you and seek help from Allah, and do not give up. If anything afflicts you, do not say: ‘If I had done (something else), such and such would have happened.’ But say [the above], for (the utterance) ‘If’ provides an opening for the deeds of the devil.” (Muslim 2664)",
    "virtue": ""
  },
  {
    "id": 254,
    "title": "When One is in a Difficult Situation",
    "categories": "Weak",
    "arabic": "اَللّٰهُمَّ لَا سَهْلَ إِلَّا مَا جَعَلْتَهُ سَهْلًا ، وَأَنْتَ تَجْعَلُ الْحَزْنَ إِذَا شِئْتَ سَهْلًا",
    "translation": "O Allah, there is no ease except in that which You have made easy, and You make the difficulty easy when You wish.",
    "transliteration": "Allāhumma lā sahla illā mā jaʿaltahū sahlā, wa anta tajʿalu-l-ḥazna idhā shi’ta sahlā.",
    "reference": "Anas b. Malik (raḍiy Allāhu ‘anhu) ﷺ narrates that the Messenger of Allah said [the above]. (Ibn Hibbān 2427, Ibn al-Sunnī 351)",
    "virtue": ""
  },
  {
    "id": 255,
    "title": "Protect Yourself From Anxiety, Laziness, Debt etc",
    "categories": "Weak",
    "arabic": "اَللّٰهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ ، وَأَعُوْذُ بِكَ مِنَ الْعَجْزِ وَالْكَسَلِ، وَأَعُوْذُ بِكَ مِنَ الْجُبْنِ وَالْبُخْلِ ، وَأَعُوْذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ وَقَهْرِ الرِّجَالِ.",
    "translation": "O Allah, I seek Your protection from anxiety and grief. I seek Your protection from inability and laziness. I seek Your protection from cowardice and miserliness, and I seek Your protection from being overcome by debt and being overpowered by men.",
    "transliteration": "Allāhumma innī aʿūdhu bika min-l-hammi wa-l-ḥazan, wa aʿūdhu bika min-l-ʿajzi wa-l-kasal, wa aʿūdhu bika min-l-jubni wa-l-bukhl, wa aʿūdhu bika min ghalabati-d-dayni wa qahri-r-rijāl.",
    "reference": "",
    "virtue": "Abū Saʿīd al-Khudrī (raḍiy Allāhu ʿanhu) narrated that one day, the Messenger of Allah ﷺ entered the masjid. He saw a man from the Anṣār called Abū Umāmah (raḍiy Allāhu ʿanhu). He ﷺ asked, “What is the matter? Why are you sitting in the mosque when it is not the time for prayer?” He replied, “Never-ending worries and debts, O Messenger of Allah.” The Messenger of Allah ﷺ then asked, “Shall I not teach you words by which, when you say them, Allah will remove your worries, and settle your debts?” He replied, “Yes of course, O Messenger of Allah.” He ﷺ said, “Say in the morning and evening [the above].” Abū Umāmah (raḍiy Allāhu ʿanhu) said, “Then I did that, and Allah removed my worries and settled my debts.” (Abū Dāwūd 1555)"
  },
  {
    "id": 256,
    "title": "Grief & Anxiety #1",
    "categories": "Weak",
    "arabic": "اَللّٰهُمَّ إِنِّيْ عَبْدُكَ ، وَابْنُ عَبْدِكَ ، وَابْنُ أَمَتِكَ ، نَاصِيَتِيْ بِيَدِكَ ، مَاضٍ فِيَّ حُكْمُكَ ، عَدْلٌ فِيَّ قَضَاؤُكَ ، أَسْأَلُكَ بِكُلِّ اسْمٍ هُوَ لَكَ ، سَمَّيْتَ بِهِ نَفْسَكَ ، أَوْ عَلَّمْتَهُ أَحَدًا مِنْ خَلْقِكَ ، أَوْ أَنْزَلْتَهُ فِيْ كِتَابِكَ ، أَوِ اسْتَأْثَرْتَ بِهِ فِيْ عِلْمِ الْغَيْبِ عِنْدَكَ ، أَنْ تَجْعَلَ الْقُرْآنَ رَبِيْعَ قَلْبِيْ ، وَنُوْرَ صَدْرِيْ وَجَلَاءَ حُزْنِيْ ، وَذَهَابَ هَمِّيْ",
    "translation": "O Allah, I am Your slave and the son of Your male slave and the son of Your female slave. My forehead is in Your Hand (i.e. you have control over me). I am subject to Your judgement and Your decree concerning me is just. I ask You – by every name that is Yours, by which You have named Yourself, or taught any one of Your creation, or revealed in Your Book, or kept unto Yourself in the knowledge of the unseen that is with You – to make the Qur’ān the spring of my heart, the light of my chest, the banisher of my grief and the reliever of my anxiety.",
    "transliteration": "Allāhumma innī ʿabduk, wa-bnu ʿabdik, wa-bnu amatik, nāṣiyatī bi-yadik, māḍin fiyya ḥukmuk, ʿadlun fiyya qaḍā’uk, as’aluka bi-kulli-smin huwa lak, sammayta bihi nafsak, aw ʿallamtahū aḥadam-min khalqik, aw anzaltahū fī Kitābik, awi-sta’tharta bihī fī ʿilmi-l-ghaybi ʿindak, an tajʿala-l-Qur’āna rabīʿa qalbī, wa nūra ṣadrī wa jalā’a ḥuznī, wa dhahāba hammī.",
    "reference": "",
    "virtue": "The Messenger of Allah ﷺ said: “There is no one amongst you who, when he is stricken with grief and anxiety, says [the above] except that Allah will remove his grief and anxiety, and will give him joy instead.” The companions said, ‘O Messenger of Allah, should we not learn these words?’ He ﷺ replied, ‘Of course! One who hears it should learn it.’” (Ahmad 3712)"
  },
  {
    "id": 257,
    "title": "Grief & Anxiety #2",
    "categories": "Weak",
    "arabic": "لَا إِلٰهَ إِلَّا اللّٰهُ الْعَظِيْمُ الْحَلِيْمُ ، لَا إِلٰهَ إِلَّا اللّٰهُ رَبُّ الْعَرْشِ الْعَظِيْمِ ، لَا إِلٰهَ إِلَّا اللّٰهُ رَبُّ السَّمٰـوٰتِ وَرَبُّ الْأَرْضِ وَرَبُّ الْعَرْشِ الْكَرِيْمِ",
    "translation": "There is no god but Allah, the Supreme, The Forbearing. There is no god but Allah, Lord of the Magnificent Throne. There is no god but Allah, Lord of the heavens, Lord of the earth, Lord of the Noble Throne.",
    "transliteration": "Lā ilāha illā-llāhu-l-ʿĀẓīmu-l-Ḥalīm, lā ilāha illā-llāhu Rabbu-l-ʿĀrshi-l-ʿAẓīm, lā ilāha illā-llāhu Rabbu-s-samāwāti wa Rabbu-l-arḍi wa Rabbu-l-ʿĀrshi-l-karīm.",
    "reference": "The Messenger of Allah ﷺ would invoke Allah at the time of distress with [the above]. (Bukhārī 6345, Muslim 2730)",
    "virtue": ""
  },
  {
    "id": 258,
    "title": "Well-being in this World and the Hereafter",
    "categories": "Weak",
    "arabic": "اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَ الْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ ، اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِيْ دِيْنِيْ وَدُنْيَايَ وَأَهْلِيْ وَمَالِيْ ، اَللّٰهُمَّ اسْتُرْ عَوْرَاتِيْ وَآمِنْ رَوْعَاتِيْ ، اَللّٰهُمَّ احْفَظْنِيْ مِنْ بَيْنِ يَدَيَّ ، وَمِنْ خَلْفِيْ ، وَعَنْ يَّمِيْنِيْ ، وَعَنْ شِمَالِيْ ، وَمِنْ فَوْقِيْ ، وَأَعُوْذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِيْ.",
    "translation": "O Allah, I ask You for well-being in this world and the next. O Allah, I ask You for forgiveness and well-being in my religion, in my worldly affairs, in my family and in my wealth. O Allah, conceal my faults and calm my fears. O Allah, guard me from in front of me and behind me, from my right, and from my left, and from above me. I seek protection in Your Greatness from being unexpectedly destroyed from beneath me.",
    "transliteration": "Allāhumma innī as’aluka-l-ʿāfiyata fi-d-dunyā wa-l-ākhirah. Allāhumma innī as’aluka-l-ʿafwa wa-l-ʿāfiyata fī dīnī wa dunyāya wa ahlī wa mālī, Allāhumma-stur ʿawrātī wa āmin rawʿātī. Allāhumma-ḥfaẓnī mim bayni yadayya wa min khalfī, wa ʿay-yamīnī wa ʿan shimālī wa min fawqī, wa aʿūdhu bi-ʿaẓamatika an ughtāla min taḥtī.",
    "reference": "",
    "virtue": "ʿAbdullāh b. ʿUmar (raḍiy Allāhu ʿanhumā) narrated: “The Messenger of Allah ﷺ never failed to say these words in the morning and in the evening.” (Abū Dāwūd 5074)"
  },
  {
    "id": 259,
    "title": "When One is Afraid of People #1",
    "categories": "Weak",
    "arabic": "اَللّٰهُمَّ اكْفِنِيْهِمْ بِمَا شِئْتَ",
    "translation": "O Allah, suffice me from them, with what You choose.",
    "transliteration": "Allāhumma-kfinīhim bimā shi’ta.",
    "reference": "Muslim 3005",
    "virtue": ""
  },
  {
    "id": 260,
    "title": "When One is Afraid of People #2",
    "categories": "Weak",
    "arabic": "حَسْبُنَا اللّٰهُ وَنِعْمَ الْوَكِيْلُ",
    "translation": "Allah is enough for us and He is the Best Protector.",
    "transliteration": "Ḥasbunallāhu wa niʿmal Wakīl.",
    "reference": "Ibn ʿAbbās (radiy Allāhū ‘anhumā) narrated: \"[the above] was said by Ibrāhīm (‘alayhis-salām) when he was thrown into the fire; and it was said by Muhammad ﷺ when they (i.e. the hypocrites) said, “A great army is gathering against you, therefore, fear them,” but it only increased their faith and they said: “Allah is Sufficient for us, and He is the Best Disposer (of affairs, for us).” (3.173) (Bukhārī 4563)",
    "virtue": ""
  },
  {
    "id": 261,
    "title": "When One is Afraid of People #3",
    "categories": "Weak",
    "arabic": "اَللّٰهُمَّ إِنَّا نَجْعَلُكَ فِيْ نُحُوْرِهِمْ ، وَنَعُوْذُ بِكَ مِنْ شُرُوْرِهِمْ",
    "translation": "O Allah, we make You our shield against them and we seek refuge in You from their evil.",
    "transliteration": "Allāhumma innā najʿaluka fī nuḥūrihim, wa naʿūdhu bika min shurūrihim.",
    "reference": "When the Messenger of Allah ﷺ was apprehensive of [a group] of people, he would say: [the above]. (Abū Dāwūd 1537)",
    "virtue": ""
  },
  {
    "id": 262,
    "title": "When One is Afraid of People #4",
    "categories": "Weak",
    "arabic": "اَللّٰهُ اَللّٰهُ رَبِّيْ ، لاَ أُشْرِكُ بِهِ شَيْئًا",
    "translation": "Allah, Allah is my Lord, I do not assign anything as a partner to Him.",
    "transliteration": "Allāhu Allāhu Rabbī, lā ushriku bihi shay’ā.",
    "reference": "Asmā bint ʿUmays (raḍiy Allāhu ‘anhā) narrated that the Messenger of Allah ﷺ said to her: “Shall I not teach you words for you to say in times of distress?” or “when in distress?”. He then said [the above]. (Abū Dāwūd 1525)",
    "virtue": ""
  },
  {
    "id": 263,
    "title": "When Meeting the Enemy",
    "categories": "Weak",
    "arabic": "اللَّهُمَّ مُنْزِلَ الكِتَابِ ، ومُجْرِيَ السَّحَابِ ، وهَازِمَ الأحْزَابِ ، اهْزِمْهُمْ وانْصُرْنَا عَلَيْهِمْ",
    "translation": "O Allah, Revealer of the Book, Mover of the clouds, Defeater of the tribes, defeat them and grant us victory over them.",
    "transliteration": "Allāhumma munzila-l-kitāb, wa mujriya-s-saḥāb, wa hāzima-l-aḥzāb, ihzimhum wa-n-ṣurnā ʿalayhim.",
    "reference": "ʿAbdullāh b. Abī Awfā (raḍiy Allāhu ‘anhu) reported that the Messenger of Allah ﷺ, on one of the days that he met the enemy, waited until the sun rose, the stood among the people and said: “O people, do not look forward to meeting the enemy, but ask Allah for well-being. When you meet them, be steadfast. And know that Paradise is under the shadow of swords.” Then he said [the above]. (Bukhārī 3025)",
    "virtue": ""
  },
  {
    "id": 264,
    "title": "When One Feels Frightened",
    "categories": "Weak",
    "arabic": "لَا إِلٰهَ إِلَّا اللّٰهُ",
    "translation": "There is no god but Allah.",
    "transliteration": "Lā ilāha illā-llāh.",
    "reference": "Zaynab bint Jaḥsh (raḍiy Allāhu ʿanhā) said that the Messenger of Allah ﷺ once came to her in a state of fear and said, [the above] Woe unto the Arabs from a danger that has come near. An opening has been made in the wall of Yājūj and Mājūj like this, making a circle with his thumb and index finger. Zaynab bint Jaḥsh said, “O Messenger of Allah ﷺ! Shall we be destroyed even though there are pious persons among us?” He said, “Yes, when evil (people) will increase.” (Bukhārī 3346)",
    "virtue": ""
  },
  {
    "id": 265,
    "title": "Ask Allah For Good Health and Protection",
    "categories": "Weak",
    "arabic": "اَللّٰهُمَّ عَافِنِيْ فِيْ بَدَنِيْ ، اَللّٰهُمَّ عَافِنِيْ فِيْ سَمْعِيْ ، اَللّٰهُمَّ عَافِنِيْ فِيْ بَصَرِيْ ، لَا إِلٰهَ إِلَّا أَنْتَ ، اَللّٰهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنَ الْكُفْرِ وَالْفَقْرِ، وأَعُوْذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، لَا إِلٰهَ إِلَّا أَنْتَ.",
    "translation": "O Allah, grant me well-being in my body. O Allah, grant me well-being in my hearing. O Allah, grant me well-being in my sight. There is no god worthy of worship except You. O Allah, I seek Your protection from disbelief and poverty and I seek Your protection from the punishment of the grave. There is no god worthy of worship except You.",
    "transliteration": "Allāhumma ʿāfinī fī badanī, Allāhumma ʿāfinī fī samʿī, Allāhumma ʿāfinī fī baṣarī, lā ilāha illā Ant, Allāhumma innī aʿūdhu bika mina-l-kufri wa-l-faqr, wa aʿūdhu bika min ʿadhābi-l-qabr, lā ilāha illā Ant.",
    "reference": "‘Abd al-Raḥmān b. Abī Bakrah (raḍiy Allāhu ʿanhu) narrates that he said to his father, “O my father! I hear you supplicating with [the above] every morning. You repeat them three times in the morning and three times in the evening.” He said, “Indeed I heard the Messenger of Allah ﷺ supplicating with these (words) and I love to follow his practice.” (Abū Dāwūd 5090, Aḥmad 20430)",
    "virtue": ""
  },
  {
    "id": 266,
    "title": "When One Fears a Ruler",
    "categories": "Weak",
    "arabic": "اَللّٰهُمَّ رَبَّ السَّمٰـوٰتِ السَّبْعِ ، وَرَبَّ العَرْشِ العَظِيْمِ ، كُنْ لِيْ جَارًا مِنْ فُلَانِ بْنِ فُلَانٍ ، وَأَحْزَابِهِ مِنْ خَلَائِقِكَ ؛ أنْ يَّفْرُطَ عَلَىَّ أحَدٌ مِنهُمْ أوْ يَطْغٰى ، عَزَّ جَارُكَ ، وَجَلَّ ثَنَاؤُكَ ، وَلَا إِلٰهَ إِلَّا أَنْتَ",
    "translation": "O Allah, Lord of the seven heavens, Lord of the Magnificent Throne, be for me a support against [such and such a person] and his helpers from among your creatures, lest any of them abuse me or do me wrong. Mighty is Your patronage, and glorious are Your praises. There is none worthy of worship but You.",
    "transliteration": "Allāhumma Rabb-as-samāwāti-s-sabiʿ, wa Rabba-l-ʿArshi-l-ʿaẓīm, kun lī jāran min fulāni-bni-fulān, wa aḥzābihi min khalāiqiqa; ay-yafruṭa ʿalayya aḥadun minhum aw yaṭgā, ʿazza jāruk, wa jalla thanā’uk, wa lā ilāha illā Ant.",
    "reference": "ʿAbdullāh b. Masʿūd (raḍiy Allāhu ‘anhu) narrated that the Prophet ﷺ said: “When one of you fears a ruler, they should say [the above].” (Ṭabarānī in Muʿjam al-Kabīr)",
    "virtue": ""
  },
  {
    "id": 267,
    "title": "Allah Will Suffice You in Everything",
    "categories": "Weak",
    "arabic": "حَسْبِيَ اللّٰهُ لَا إِلٰهَ إِلَّا هُوَ ، عَلَيْهِ تَوَكَّلْتُ ، وَهُوَ رَبُّ الْعَرْشِ الْعَظِيْمِ.",
    "translation": "Allah is sufficient for me. There is no god worthy of worship except Him. I have placed my trust in Him only and He is the Lord of the Magnificent Throne.",
    "transliteration": "Ḥasbiya-Allāhu lā ilāha illā Huwa, ʿalayhi tawakkaltu, wa Huwa Rabbu-l-ʿArshi-l-ʿaẓīm.",
    "reference": "",
    "virtue": "Abū al-Dardā’ (raḍiy Allāhu ʿanhu) narrates from the Messenger of Allah ﷺ that he said: “Whoever recites [the above] seven times in the morning and in the evening, Allah will suffice him in everything that concerns him in matters of this world and the next.” (Ibn al-Sunnī 71)"
  },
  {
    "id": 268,
    "title": "Duʿa of Prophet Musa ﷺ Expressing His Dire Need",
    "categories": "Weak",
    "arabic": "رَبِّ إِنِّيْ لِمَآ أَنْزَلْتَ إِلَيَّ مِنْ خَيْرٍ فَقِيْرٌ",
    "translation": "My Lord, truly I am in dire need of any good which You may send me. (28:24)",
    "transliteration": "Rabbi innī limā anzalta illayya min khayrin faqīr.",
    "reference": "",
    "virtue": ""
  },
  {
    "id": 269,
    "title": "For Difficult Times: All Your Prayers Answered",
    "categories": "Weak",
    "arabic": "لَآ إِلٰهَ إِلَّآ أَنْتَ سُبْحَانَكَ إِنِّيْ كُنْتُ مِنَ الظَّالِمِيْنَ",
    "translation": "There is no god worthy of worship except You; You are free from all imperfection. Indeed, I have been of the wrongdoers. (21:87)",
    "transliteration": "Lā ilāha illā Anta subḥānaka innī kuntu mina-ẓ-ẓālimīn.",
    "reference": "",
    "virtue": "The Messenger of Allah ﷺ said: “The supplication of Dhun-Nūn (Prophet Yūnus) when he supplicated, while in the belly of the whale was: [the above]. ”No Muslim man ever supplicates with [the above] except that Allah answers his supplication.” (Tirmidhī 3505)"
  },
  {
    "id": 270,
    "title": "When One is Distressed",
    "categories": "Weak",
    "arabic": "اَللّٰهُمَّ رَحْمَتَكَ أَرْجُوْ فَلَا تَكِلْنِيْ إِلٰى نَفْسِيْ طَرْفَةَ عَيْنٍ ، وَأَصْلِحْ لِي شَأْنِيْ كُلَّهُ لَا إِلٰهَ إِلَّا أَنْتَ",
    "translation": "O Allah! Your Mercy is what I hope for so do not entrust me to myself for the blink of an eye, rectify all of my affairs. There is no god worthy of worship but You.",
    "transliteration": "Allāhumma raḥmataka arjū fa-lā takilnī ilā nafsī ṭarfata ʿayn, wa aṣliḥ lī sha’nī kullah lā ilāha illā Ant.",
    "reference": "The Messenger of Allah ﷺ said: “The supplications for the one who is distressed are [the above].” (Abu Dāwud 5090)",
    "virtue": ""
  },
  {
    "id": 271,
    "title": "Entrust All Your Matters to Allah",
    "categories": "Weak",
    "arabic": "يَا حَيُّ يَا قَيُّوْمُ ، بِرَحْمَتِكَ أَسْتَغِيْثُ ، أَصْلِحْ لِيْ شَأْنِيْ كُلَّهُ ، وَلَا تَكِلْنِيْ إِلَىٰ نَفْسِيْ طَرْفَةَ عَيْنٍ.",
    "translation": "O The Ever Living, The Sustainer of all. ; I seek assistance through Your mercy. Rectify all of my affairs and do not entrust me to myself for the blink of an eye.",
    "transliteration": "Yā Ḥayyu yā Qayyūm, bi-raḥmatika astaghīth, aṣliḥ lī sha’nī kullah, wa lā takilnī ilā nafsī ṭarfata ʿayn.",
    "reference": "Anas b. Mālik (raḍiy Allāhu ʿanhu) narrates that the Prophet ﷺ said to Fāṭimah (raḍiy Allāhu ʿanhā), “What is preventing you from (doing) what I am advising you; that you say [the above] in the morning and evening?” (Nasā’ī in ʿAmal al-Yawm wa-l-Laylah 570)",
    "virtue": ""
  }
]